Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: de_de, ja_jp, ko_kr

source: so that we can track the source of the change subset, even if a strict cherry-pick doesn\'t make sense.
de_de: um die Quelle der Änderungen nachvollziehen zu können - selbst wenn ein Cherry-Pick dieser einzeln nicht sinnvoll wäre.
ja_jp: そうすれば、厳格なcherry-pickの意味が分からなくても、変更サブセットのソースを追跡できるようになります。

source: If the patch you're proposing will not cherry-pick cleanly, you can help by resolving the conflicts yourself and proposing the resulting patch. Please keep Conflicts lines in the commit message to help review of the stable patch.
de_de: Wenn ein Cherry-Pick des Patches, den man vorschlägt, nicht ohne Konflikte verläuft, kann man diese selbst beheben und dann den sich daraus ergebenden Patch vorschlagen. Um die Prüfung des Stable Branch zu vereinfachen, belässt man dabei die Conflicts Zeilen in der Commit Nachricht.
ja_jp: 提案するパッチがきれいにcherry-pickしない場合は、競合を自分で解決し、その結果のパッチを提案することができます。 安定したパッチのレビューをサポートするために、コミット・メッセージ内の競合行を保持してください。

source: Backport labels
de_de: Labels zur Rückportierung
ja_jp: バックポート・ラベル
ko_kr: 이전 버전을 수정하는 백포트(backport) 레이블

source: Bugs or PRs tagged with ``stable backport potential`` are bugs that apply to the stable release too and may be suitable for backporting once a fix lands in master. Once the backport has been proposed, the tag should be removed.
de_de: Bugs oder Pull-Requests welche mit dem Label ``stable backport potential`` gekennzeichnet wurden, kommen für eine Rückportierung in den Stable Branch in Frage, sobald dafür ein Patch im Master Branch ist. Sobald die Rückportierung geplant ist, sollte das Label entfernt werden.
ja_jp: ``stable backport potential`` とタグ付けされたバグやプルリクエスト (PR) は、安定したリリースにも適用されるバグであり、マスターの一時修正が行われると、バックポーティングに適している可能性があります。 バックポートが提案されると、タグを削除する必要があります。

source: Include ``[Stable]`` in the title of the PR against the stable branch, as a sign that setting the target branch as stable was not a mistake. Also, reference to the PR number in master that you are porting.
de_de: Um zu zeigen, dass die Auswahl des Stable Branch als Ziel in einem Pull-Request kein Fehler war, verwendet man ``[Stable]`` im Titel. Zusätzlich gibt man eine Referenz zum Pull-Request der Änderung im Master Branch an, welche man rückportiert.
ja_jp: ターゲット・ブランチを安定と設定したことが間違いないようにするために、安定ブランチに対するプルリクエスト (PR) のタイトルに ``[Stable]`` を含めて下さい。また、ポーティングしているマスター中のプルリクエスト (PR) 番号を参照して下さい。

source: Contributing to Documentation
de_de: Zur Dokumentation beitragen
ja_jp: ドキュメンテーションへの貢献
ko_kr: 문서에 기여하기

source: Qiskit documentation is shaped by the `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ philosophy, primarily drawn from Qiskit code comments in the `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
de_de: Die Qiskit-Dokumentation gestaltet sich nach der `Dokumentation-wie-Quelltext <https://www.writethedocs.org/guide/docs-as-code/>`__-Philosophie, primär gespeist aus Qiskit-Quelltextkommentaren im `Stil einer API-Dokumentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__.
ja_jp: Qiskit ドキュメンテーションは `docs as code <https://www.writethedocs.org/guide/docs-as-code/>`__ philosophy, に則り、 `style of API documentation <https://alistapart.com/article/the-ten-essentials-for-good-api-documentation/>`__ に基づくQiskitコードコメントから形成されています。

source: The documentation is built from the master branch of `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ using `Sphinx <http://www.sphinx-doc.org/en/master/>`__. The majority of documentation, under `API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__, is drawn from code comments in the repositories listed in :ref:`where_things_are`.
de_de: Die Dokumentation wird mit `Sphinx <http://www.sphinx-doc.org/en/master/>`__ aus dem master-Branch von `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ generiert. Der Großteil der Dokumentation, unter `API-Referenz <https://qiskit.org/documentation/apidoc/qiskit.html>`__, speist sich aus Quelltextkommentaren in den in :ref:`where_things_are` aufgeführten Repositories.
ja_jp: ドキュメントは、 `Qiskit/qiskit/docs <https://github.com/Qiskit/qiskit/tree/master/docs>`__ のmasterブランチから `Sphinx <http://www.sphinx-doc.org/en/master/>`__ を使用して構築されます 。`API Reference <https://qiskit.org/documentation/apidoc/qiskit.html>`__ の下にあるドキュメントの大部分は :ref:`where_things_are` にリストされているリポジトリのコードコメントから作成されています。

source: Documentation Structure
de_de: Aufbau der Dokumentation
ja_jp: 文書構造
ko_kr: 문서 구조

source: The way documentation is structured in Qiskit is to push as much of the actual documentation into the docstrings as possible. This makes it easier for additions and corrections to be made during development, because the majority of the documentation lives near the code being changed. There are three levels in the normal documentation structure in Terra:
de_de: Die Dokumentation in Qiskit ist so aufgebaut, so viel wie möglich der eigentlichen Dokumentation über Docstrings abzubilden. Das macht das Ergänzen und Korrigieren der Dokumentation während der Entwicklung einfacher, da die Dokumentation nahe am betreffenden Code ist. Im Aufbau der Dokumentation von Terra gibt es drei Ebenen:
ja_jp: Qiskitでドキュメントを構造化する方法は、できるだけ多くの実際のドキュメントをドキュメント文字列にプッシュすることです。 ドキュメントの大部分は変更されるコードの近くにあるため、これにより、開発中に追加や修正が簡単になります。 Terraの通常のドキュメント構造には3つのレベルがあります。

source: The ``.rst`` files in the ``docs/apidocs``
de_de: Die ``.rst`` Dateien in ``docs/apidocs``
ja_jp: ``docs/apidocs``の中の``.rst``ファイル

source: These files are used to tell Sphinx which modules to include in the rendered documentation. This contains two pieces of information: an `internal reference <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ or `cross reference <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ to the module, which can be used for internal links inside the documentation, and an `automodule directive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ used to parse the module docstrings from a specified import path. For example, the dagcircuit.rst file contains::
de_de: Diese Dateien werden verwendet, um Sphinx mitzuteilen, welche Module in die Dokumentation aufgenommen werden sollen. Dabei gibt es zwei Arten von Information: Eine `Interne Referenz <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`__ oder einen `Querverweis <https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`__ zu dem Modul, welches die interne Verlinkung innerhalb der Dokumentation beschreibt und eine `Auto-Modul Direktive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ um die Docstrings des Moduls aus dem spezifizierten Import-Pfad zu parsen. Als Beispiel ein Ausschnitt der Datei dagcircuit.rst::
ja_jp: これらのファイルは、レンダリングされたドキュメントに含めるモジュールをSphinxに伝えるために使用されます。 これには、ドキュメント内の内部リンクに使用できるモジュールへの`内部参照<http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#reference-names>`または`相互参照<https://www.sphinx-doc.org/en/latest/usage/restructuredtext/roles.html#ref-role>`、および指定された挿入パスからモジュールのdocstringを解析するために使用される`自動モジュールディレクティブ <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`の2つの情報が含まれます。 たとえば、dagcircuit.rstファイルには以下が含まれます。

source: The only ``.rst`` file outside of this is ``qiskit.rst``, which contains the table of contents. If you're adding a new ``.rst`` file for a new module's documentation, make sure to add it to the `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ in that file.
de_de: Die einzige ``.rst`` Datei die außerhalb liegt, ist ``qiskit.rst``. Diese enthält das Inhaltsverzeichnis. Wenn man eine neue ``.rst`` Datei für die Dokumentation eines neuen Moduls anlegt, muss diese dort unter `toctree <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>`__ hinzugefügt werden.
ja_jp: これ以外の唯一の ``.rst`` ファイルは ``qiskit.rst`` で、目次が含まれています。 新しいモジュールのドキュメント用に新しい ``.rst`` ファイルを追加する場合は、そのファイルの`toctree<https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html#table-of-contents>` に必ず追加してください。

source: The module-level docstring
de_de: Der Docstring auf Modul-Ebene
ja_jp: モジュール・レベルdocstring
ko_kr: 모듈-레벨 docstring

source: This docstring is at the module level for the module specified in the ``automodule`` directive in the rst file. If the module specified is a directory/namespace, the docstring should be specified in the ``__init__.py`` file for that directory. This module-level docstring contains more details about the module being documented. The normal structure to this docstring is to outline all the classes and functions of the public API that are contained in that module. This is typically done using the `autosummary directive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (or `autodoc directives <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ directly if the module is simple, such as in the case of ``qiskit.execute``). The autosummary directive is used to autodoc a list of different Python elements (classes, functions, etc.) directly without having to manually call out the autodoc directives for each one. The module-level docstring is where to provide a high-level overview of what functionality the module provides. This is normally done by grouping the different components of the public API together into multiple subsections.
de_de: Dies ist der Docstring für das Modul, welches über die ``automodule`` Direktive in der rst-Datei angegeben wird. Wenn das angegebene Modul ein Verzeichnis oder ein Namespace ist, muss sich der Docstring in der Datei ``__init__.py`` dieses Verzeichnisses befinden. Der Docstring auf Modul-Ebene enthält weitere Details über das dokumentierte Modul. Der reguläre Aufbau beschreibt dabei alle Klassen und Funktionen der öffentlichen API des Moduls. Dies macht man üblicherweise mit der `autosummary Direktive <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__ (oder direkt mit der `autodoc Direktive <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__, wenn das Modul einfach gehalten ist, wie bspw. bei ``qiskit.execute``). Die autosummary Direktive wird verwendet, um eine gesammelte Liste verschiedener Python Objekte (Klassen, Funktionen, etc.) zu erstellen, ohne für jedes einzeln die autodoc Direktive aufrufen zu müssen. Im Docstring auf Modul-Ebene gibt man einen groben Überblick über die Funktionalität des Moduls, indem man die verschiedenen Komponenten der öffentlichen API in mehreren Unterkategorien zusammenfasst.
ja_jp: このdocstringは、rstファイルの ``automodule`` ディレクティブで指定されたモジュールのモジュールレベルにあります。指定されたモジュールがディレクトリ/名前空間である場合、docstringはそのディレクトリの ``__init__.py`` ファイルで指定する必要があります。このモジュールレベルのdocstringには、ドキュメント化されるモジュールに関する詳細が含まれています。このdocstringの通常の構造は、そのモジュールに含まれているパブリックAPIのすべてのクラスと関数の概要を説明することです。これは通常、`autosummary ディレクティブ <https://www.sphinx-doc.org/en/master/usage/extensions/autosummary.html>`__を使用（または、qiskit.executeの場合のようにモジュールが単純な場合はautodoc ディレクティブ <http://www.sphinx-doc.org/en/master/usage/extensions/autodoc.html>`__ を直接使用）して行われます。 autosummaryディレクティブは、さまざまなPython要素（クラス、関数など）のリストを直接autodocするために使用されます。それぞれのautodocディレクティブを手動で呼び出す必要はありません。モジュールレベルのdocstringは、モジュールが提供する機能の概要を提供する場所です。これは通常、パブリックAPIのさまざまなコンポーネントを複数のサブセクションにグループ化することによって行われます

source: For example, as in the previous dagcircuit module example, the contents of the module docstring for ``qiskit/dagcircuit/__init__.py`` would be::
de_de: Anhand des vorherigen dagcircuit Beispiels, könnte der Inhalt des Modul-Docstrings in ``qiskit/dagcircuit/__init__.py`` etwa so aussehen::
ja_jp: 例えば、前のdagcircuitモジュールの例と同様に、``qiskit/dagcircuit/__init__.py`` のdocstringモジュールの内容は次のようになります：

source: This is just an example and the actual module docstring for the dagcircuit module might diverge from this.
de_de: Dies ist nur ein Beispiel und der tatsächliche Docstring des dagcircuit Moduls kann von diesem abweichen.
ja_jp: これは単なる例であり、dagcircuitモジュールの実際のdocstringモジュールはこれとは異なる場合があります。

source: The actual docstring for the elements listed in the module docstring
de_de: Der eigentliche Docstring der Objekte, die im Modul-Docstring aufgeführt sind
ja_jp: docstringモジュールにリストされる要素の実際のdocstring

source: You should strive to document thoroughly all the public interfaces exposed using examples when necessary. For docstrings, `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ are used. This is parsed using the `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__. The `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ contains a good example of how docstrings should be formatted.
de_de: Alle öffentlichen Schnittstellen sollten bestmöglich und, wenn nötig, mit Beispielen dokumentiert sein. Für Docstrings werden dabei `Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ verwendet. Diese werden mit der `Napoleon Sphinx Erweiterung <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__ erfasst. Die `Napoleon Dokumentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__ enthält gute Beispiele, wie Docstrings formatiert werden sollten.
ja_jp: 必要に応じて、例を使って公開されているすべてのパブリックインターフェイスを徹底的に文書化するように努める必要があります。 docstringsには、`Google Python Style Docstrings <https://google.github.io/styleguide/pyguide.html?showone=Comments#38-comments-and-docstrings>`__ が使用されます。 これは、 `napoleon sphinx extension <https://www.sphinx-doc.org/en/master/usage/extensions/napoleon.html>`__を使用してパースされます。 `napoleon documentation <https://sphinxcontrib-napoleon.readthedocs.io/en/latest/example_google.html>`__には、docstringのフォーマット法の良い例が掲載されています。

source: You can use any Sphinx directive or rst formatting in a docstring as it makes sense. For example, one common extension used is the ``jupyter-execute`` directive, which is used to execute a code block in Jupyter and display both the code and output. This is particularly useful for visualizations.
de_de: Jede Sphinx Direktive und jedes rst Format kann in Docstrings verwendet werden, soweit dies sinnvoll ist. Eine oft genutzte Erweiterung ist bspw. die ``jupyter-execute`` Direktive. Mit ihr kann man einen Code-Block in Jupyter ausführen und sowohl den Code als auch dessen Ausgabe anzeigen. Das ist gerade für Visualisierungen sehr hilfreich.
ja_jp: 理にかなっているように、docstringには、任意のSphinxディレクティブまたはrstフォーマットを使用できます。 例えば、一般的な拡張機能の1つに、Jupyterでコードブロックを実行し、コードと出力の両方を表示するために使用される ``jupyter-execute`` ディレクティブがあります。 これは特に視覚化に役立ちます。

source: Documentation Integration
de_de: Integration der Dokumentation
ja_jp: ドキュメントの統合
ko_kr: 문서 통합

source: The hosted documentation at https://qiskit.org/documentation/ covers the entire Qiskit project; Terra is just one component of that. As such, the documentation builds for the hosted version are built by the Qiskit meta-package repository https://github.com/Qiskit/qiskit. When commits are merged to that repo, the output of Sphinx builds are uploaded to the qiskit.org website. Those Sphinx builds are configured to pull in the documentation from the version of the Qiskit elements installed by the meta-package at that point. For example, if the meta-package version is currently 0.13.0, then that will copy the documentation from Terra's 0.10.0 release. When the meta-package's requirements are bumped, then it will start pulling documentation from the new version. This means that fixes for incorrect API documentation will need to be included in a new release. Documentation fixes are valid backports for a stable patch release per the stable branch policy (see that section below).
de_de: Die Dokumentation unter https://qiskit.org/documentation/ deckt das komplette Qiskit Projekt ab; Terra ist davon nur eine Komponente. Daher wird die Dokumentation für die Webseite aus dem Qiskit Meta-Paket Repository https://github.com/Qiskit/qiskit erstellt. Wenn Commits in dieses Repository übernommen werden, wird das Ergebnis des Sphinx-Builds auf qiskit.org hochgeladen. Die Sphinx-Builds sind so konfiguriert, dass sie die Dokumentation der einzelnen Qiskit-Elemente mit der Version, welche im Meta-Paket angegeben ist verwenden. Wenn das Meta-Paket bspw. in Version 0.13.0 ist, wird die Dokumentation der 0.10.0 Version von Terra verwendet. Wenn die Versionsnummern in den Abhängigkeiten des Meta-Pakets aktualisiert werden, wird auch die Dokumentation der neuen Versionen übernommen. Das bedeutet, dass Korrekturen für eine fehlerhafte API Dokumentation ein neues Release benötigen. Korrekturen an der Dokumentation sind valide Rückportierungen für ein Stable Patch Release anhand der Stable Branch Regelung (siehe entsprechendes Kapitel).
ja_jp: https://qiskit.org/documentation/でホストされているドキュメントは、Qiskitプロジェクト全体をカバーしています； Terraはその1つのコンポーネントにすぎません。 そのため、ホストされたバージョンのドキュメントのビルドは、Qiskitのメタパッケージリポジトリー https://github.com/Qiskit/qiskit によってビルドされます。 コミットがそのリポジトリにマージされると、Sphinxビルドの出力がqiskit.orgのウェブサイトにアップロードされます。 これらのSphinxビルドは、その時点でメタパッケージによってインストールされたQiskit要素のバージョンからドキュメントを取り込むように構成されています。 例えば、メタパッケージのバージョンが現在0.13.0である場合、Terraの0.10.0リリースからドキュメントをコピーします。 メタパッケージから要求があると、新しいバージョンからドキュメントが取得され始めます。 これは、間違っているAPIドキュメントを修正して新しいリリースに含める必要があることを意味します。 ドキュメントの修正は、安定版ブランチポリシー（下記のセクションを参照）ごとに安定版パッチをリリースする有効なバックポートとなります。

source: During the build process, the contents of each element's ``docs/apidocs/`` are recursively copied into a shared copy of ``doc/apidocs/`` in the meta-package repository along with all the other elements. This means that what is in the root of docs/apidocs on each element at a release will end up on the root of https://qiskit.org/documentation/apidoc/.
de_de: Während des Build-Prozesses werden die Inhalte aus ``docs/apidocs/`` eines jeden Moduls rekursiv in eine Kopie von ``doc/apidocs/`` im Meta-Paket Repository kopiert, inklusive aller anderen Elemente. Das bedeutet, dass das was direkt unter docs/apidocs eines jeden Elements liegt, bei einem Release auch direkt unter https://qiskit.org/documentation/apidoc/ liegt.
ja_jp: ビルドプロセス中に、各要素の ``docs/apidocs/`` のコンテンツは、他のすべての要素とともに、メタパッケージリポジトリー内の ``doc/apidocs/`` の共有コピーに再帰的にコピーされます。 つまり、リリースの各要素のdocs/apidocsのルートにあるものは、最終的にはhttps://qiskit.org/documentation/apidoc/のルートになります。

source: Translating Documentation
de_de: Übersetzen der Dokumentation
ja_jp: ドキュメンテーションの翻訳について
ko_kr: 문서 번역

source: Qiskit documentation is translated (localized) using Crowdin, a software and web localization platform that allows organizations to coordinate translation projects and collaborate with communities to translate materials. Crowdin allows our community of translators to amplify their impact by automatically reusing the work invested translating one sentence to translate other, similar sentences. Crowdin also makes translations resilient to many types of changes to the original material, such as moving sentences around, even across files.
de_de: Die Qiskit-Dokumentation wird übersetzt (lokalisiert) mit Crowdin, einer Software- und Web-Lokalisierungsplatform, die es Unternehmen ermöglicht Übersetzungsprojekte zu koordinieren und mit Gemeinschaften für Übersetzungen zu kollaborieren. Crowdin ermöglicht es unserer Gemeinschaft von Übersetzern, ihre Wirkung zu verstärken, indem die Arbeit die in die Übersetzung eines Satzes investiert wurde, automatisch wieder verwendet wird, um andere, ähnliche Sätze zu übersetzen. Crowdin macht Übersetzungen auch widerstandsfähig gegen viele Arten von Änderungen am Originalmaterial, bspw. das Verschieben von Sätzen und das sogar zwischen Dateien.
ja_jp: Qiskitのドキュメントは、Crowdinを使用して翻訳(ローカライズ) されます。Crowdinは、組織が翻訳プロジェクトを調整し、コミュニティと協力して資料を翻訳できるようにするソフトウェアおよびWebローカリゼーションプラットフォームです。Crowdinを使用すると、翻訳者のコミュニティは、1つの文の翻訳に投資した作業を他の類似の文の翻訳に自動的に再利用することができます。また、Crowdinは、ファイル間での文の移動など、原文に対する多くの種類の変更に対して翻訳の復元力を高めます。

source: Qiskit localization requests are handled in `Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ repository. To contribute to Qiskit localization, please follow these steps:
ja_jp: Qiskit ローカリゼーション リクエストは、`Qiskit Translations <https://github.com/Qiskit/qiskit-translations>`__ リポジトリーで処理されます。 Qiskitのローカリゼーションに貢献するには、次の手順に従ってください：

source: Add your name (or ID) to the `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ file.
ja_jp: 名前 (またはID) を `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit-translations/blob/master/LOCALIZATION_CONTRIBUTORS>`__ ファイルに追加します。

source: Create a pull request (PR) to merge your change. Make sure to follow the template to open a Pull Request.
ja_jp: プルリクエスト (PR) を作成して、変更をマージします。 必ずテンプレートに従ってプルリクエストを開いてください。

source: Each contributor has to create their own PR and sign the CLA.
de_de: Jeder Mitwirkende muss seinen eigenen Pull-Request erstellen und die Mitwirkenden-Lizenzvereinbarung (MLV) unterschreiben.
ja_jp: 貢献する人はそれぞれ、独自のPRを作成し、CLAに署名する必要があります。

source: Please mention the language that you'd like to contribute to in the PR summary.
de_de: Die Pull-Request Zusammenfassung sollte die Sprache, an welcher man mitwirken möchte, beinhalten.
ja_jp: PRのサマリーで、貢献する言語を記載してください。

source: If you have an open issue for a language request, **add the issue link to the PR**.
ja_jp: 言語のリクエストでまだissueがopenのままの場合は、**PRにそのissueのリンクを追加します**。

source: You will be asked to sign the Qiskit Contributors License Agreement (CLA); please do so.
de_de: Man wird gebeten die Qiskit-Mitwirkendenlizenzvereinbarung (MLV) zu unterzeichnen, was man dann bitte tun sollte.
ja_jp: Qiskit Contributors License Agreement（CLA）に署名するよう求められますので、 署名をお願い致します。

source: In the `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdin project, choose the language that you want to contribute to.
de_de: Im Crowdin-Projekt `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ wählt man nun die Sprache, an welcher man mitwirken möchte.
ja_jp: `Qiskit-Docs <https://crowdin.com/project/qiskit-docs>`__ Crowdinプロジェクトで、貢献したい言語を選択します。

source: As mentioned in the blog post, `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, we want to make sure that translated languages have enough community support to build a translation team with translators, proofreaders, and translation leads. If you want to be a translation lead or would be willing to join a new translation project team, you can open a `GitHub issue <https://github.com/Qiskit/qiskit-translations/issues/new/choose>`__ to start a discussion with the Qiskit team and recruit translation project members.
ja_jp: `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__ ブログの投稿で述べたように、私たちは、翻訳された言語が、翻訳者、校正者、および翻訳リーダーで構成される翻訳チームからの十分なサポートを確保したいと考えています。 翻訳のリーダーになりたい場合、または新しい翻訳プロジェクトチームに参加したい場合は、`Github issue <https://github.com/Qiskit/qiskit-translations/issues/new/choose>`__ を開いてQiskitチームと会話を開始した上で、翻訳プロジェクトのメンバーを募集できます。

source: Click the **Join** button and **paste the URL of your PR** in the dialog box where you are asked why you want to join the Crowdin project.
de_de: Nachdem man auf **Join** geklickt hat, **fügt man nun die URL zu seinem Pull-Request** in das Nachrichtenfeld ein in dem man gefragt wird warum man dem Crowdin Projekt beitreten möchte.
ja_jp: **参加**ボタンをクリックし、Crowdinプロジェクトに参加する理由を尋ねるダイアログボックスに** PRのURLを貼り付けます**。

source: The administrators of the Crowdin project will review your request and give you access as quickly as they can.
de_de: Die Administratoren des Crowdin-Projekts werden das Beitrittsgesuch überprüfen und so schnell wie möglich Zugriff geben.
ja_jp: Crowdinプロジェクトの管理者があなたの申請を確認し、できるだけ早くアクセス権を付与するようにします。
