Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: de_de, ja_jp, ko_kr

source: Building from Source
de_de: Aus Quelltext erzeugen
ja_jp: ソースからのビルド
ko_kr: 소스 코드로부터 빌드하기

source: You can build a local copy of the documentation from your local clone of the `Qiskit/qiskit` repository as follows:
de_de: Mit diesen Schritten lässt sich aus einem geklonten `Qiskit/qiskit` Repository eine lokale Kopie der Dokumentation erzeugen:
ja_jp: 以下の方法で`Qiskit/qiskit` のローカルクローンからドキュメントのローカルコピーをビルドすることが出来ます。

source: Clone the Qiskit repository.
de_de: Das Qiskit Repository klonen.
ja_jp: Qiskitリポジトリをクローンします。
ko_kr: 키스킷 코드 저장소 복제.

source: Cloning the repository creates a local folder called ``qiskit``.
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit``.
ja_jp: レポジトリをクローンすると、``qiskit`` という名前のローカル・フォルダが作成されます。

source: Build the documentation by navigating to your local clone of `Qiskit/qiskit` and running the following command in a terminal window.
de_de: Um die Dokumentation zu erstellen führt man auf der Kommandozeile den folgenden Befehl im Verzeichnis des lokalen `Qiskit/qiskit` Klons aus.
ja_jp: `Qiskit/qiskit` クローンの場所に移動し、端末ウィンドウから以下のコマンドを実行してドキュメントをビルドします。

source: If you do not already have the `tox <https://tox.readthedocs.io/en/latest/>`_ command installed, install it by running:
de_de: Hat man den Befehl `tox <https://tox.readthedocs.io/en/latest/>`_ noch nicht installiert, muss man dies wie folgt nachholen:
ja_jp: `tox <https://tox.readthedocs.io/en/latest/>`_ コマンドが無い場合には、以下を実行してインストールしてください:

source: As you make changes to your local RST files, you can update your HTML files by navigating to `/doc/` and running the following in a terminal window:
de_de: Während man an den lokalen RST Dateien arbeitet, kann man die HTML Dateien aktualisieren, indem man in den Ordner `/doc/` wechselt und diesen Befehl auf der Kommandozeile ausführt:
ja_jp: ローカル RST ファイルを変更した場合には、端末ウィンドウで `/doc/` に移動し、以下のコマンドを実行すると HTML ファイルを更新することができます：

source: This will build a styled, HTML version of your local documentation repository in the subdirectory `/docs/_build/html/`.
de_de: Dies erzeugt eine formatierte HTML-Version des lokalen Dokumentations-Repository im Unterverzeichnis `/docs/_build/html`.
ja_jp: これで スタイル化された HTML バージョンのローカルドキュメントリポジトリが `/docs/_build/html/` にビルドされます。

source: Installing from Source
de_de: Installieren aus Quelltext
ja_jp: ソースからインストールする方法
ko_kr: 소스 코드로 설치

source: Installing the elements from source allows you to access the most recently updated version of Qiskit instead of using the version in the Python Package Index (PyPI) repository. This will give you the ability to inspect and extend the latest version of the Qiskit code more efficiently.
de_de: Die Elemente aus dem Quelltext zu installieren, ermöglicht es auf die aktuellste Version von Qiskit zuzugreifen anstatt der Version, welche im Python Package Index (PyPI) veröffentlicht ist. Damit hat man die Möglichkeit, sich effizienter die neueste Version von Qiskit anzusehen und zu erweitern.
ja_jp: ソースからエレメントをインストールすることにより、Python Package Index (PyPI) リポジトリのバージョンを使う代わりに、最新のQiskitバージョンにアクセスすることが出来ます。これにより、Qiskit コードの最新版を調査したり、拡張することがより効果的にできるようになります。

source: When installing the elements and components from source, by default their ``development`` version (which corresponds to the ``master`` git branch) will be used, as opposed to the ``stable`` version (which contains the same codebase as the published ``pip`` packages). Since the ``development`` versions of an element or component usually include new features and changes, they generally require using the ``development`` version of the rest of the items as well.
de_de: Wenn Elemente und Komponenten aus dem Quelltext installiert werden, ist es Voreinstellung, dass die ``development``-Version (welche mit dem git-master-Branch übereinstimmt) benutzt wird, und nicht die ``stable``-Version (welche die Quelltextbasis der veröffentlichten ``pip``-Pakete enthält). Weil die ``development``-Versionen eines Elements oder einer Komponente üblicherweise die neuesten Funktionen und Änderungen beinhalten, erfordern diese in der Regel die Verwendung der ``development``-Versionen der übrigen Objekte.
ja_jp: ソースからエレメントやコンポーネントをインストールする時には、デフォルトでは、``安定`` バージョン( ``pip``パッケージとして公開されているコードベースと同じもの) ではなく、 ``開発`` バージョン( ``master`` git ブランチに該当) が使われます。 エレメントやコンポーネントの ``開発`` バージョンは通常新しい機能や変更が含まれているため、一般的には他の項目についても ``開発`` バージョンを利用することが求められています。

source: The Terra and Aer packages both require a compiler to build from source before you can install. Ignis, Aqua, and the IBM Quantum Provider backend do not require a compiler.
de_de: Die Terra- und Aer-Pakete benötigen beide zum Kompilieren aus dem Quelltext einen Compiler bevor man diese installieren kann. Ignis, Aqua und das "IBM Quantum Provider" Backend benötigen keinen Compiler.
ja_jp: Terraと Aerのパッケージはソースからビルドするためにコンパイラーが必要なため、インストール前に準備します。Ignis、Aqua、IBM Quantum Provider バックエンドにはコンパイラーは必要ありません。

source: Installing elements from source requires the following order of installation to prevent installing versions of elements that may be lower than those desired if the ``pip`` version is behind the source versions:
de_de: Um zu verhindern, ungewünschte frühere Versionen der Elemente zu installieren, wenn die Version von ``pip`` von der aktuellen abweicht, ist eine Installation in dieser Reihenfolge notwendig:
ja_jp: ``pip`` のバージョンがソースバージョンより古い場合に、要求するものよりも古いバージョンをインストールしてしまうことを防ぐため、ソースからエレメントをインストールするには以下の順番で実施します：

source: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (if you want to connect to the IBM Quantum devices or online simulator)
de_de: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (wenn man auf einen IBM Quantum-Device oder einen Online-Simulator zugreifen will)
ja_jp: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (IBM Quantum デバイスやオンライン・シミュレーターに接続する場合)
ko_kr: :ref:`qiskit-ibmq-provider <install-qiskit-ibmq-provider>` (만약 IBM 양자 시스템 장치나 온라인 시뮬레이터 장치에 접속하길 원하는 경우)

source: To work with several components and elements simultaneously, use the following steps for each element.
de_de: Um mit mehreren Komponenten und Elementen gleichzeitig zu arbeiten, müssen die folgenden Schritten für jedes Element ausgeführt werden.
ja_jp: いくつかのコンポーネントとエレメントで同時に作業したい場合には、各エレメントに対して以下のステップを踏みます。

source: Due to the use of namespace packaging in Python, care must be taken in how you install packages. If you're planning to install any element from source, do not use the ``qiskit`` meta-package. Also, follow this guide and use a separate virtual environment for development. If you do choose to mix an existing installation with your development, refer to https://github.com/pypa/sample-namespace-packages/blob/master/table.md for the set of combinations of installation methods that work together.
de_de: Aufgrund der Namensraum-Kapselung in Python, gilt es bei der Installation Sorgfalt walten zu lassen. Falls man ein Element aus dem Quelltext installieren möchte, darf man nicht das ``qiskit`` Meta-Paket verwenden. Am besten folgt man diesem Leitfaden und benutzt eine separate virtuelle Umgebung zum Entwickeln. Falls man eine existierende Installation mit seiner Entwicklungsumgebung kombinieren möchte, kann man auf https://github.com/pypa/sample-namespace-packages/blob/master/table.md nachsehen, welche Kombinationen von Installationsmethoden möglich sind.
ja_jp: Pythonの名前空間パッケージを使用しているため、パッケージのインストール方法には注意する必要がります。もしソースからエレメントをインストールすることを考えている場合は、``qiskit`` メタパッケージを使用しないでください。また、このガイドに従って、開発用に別の仮想環境を使用してください。もし、既存のインストールと開発環境を混在させる場合は、https://github.com/pypa/sample-namespace-packages/blob/master/table.md を参照して、連携するインストール方法の組み合わせを確認してください。

source: Set up the Virtual Development Environment
de_de: Einrichten der virtuellen Entwicklungsumgebung
ja_jp: 仮装開発環境のセットアップ
ko_kr: 가상화 개발 환경 설정하기

source: Installing Terra from Source
de_de: Installieren von Terra aus dem Quelltext
ja_jp: ソースから Terra をインストールする
ko_kr: 소스로부터 테라 설치하기

source: Installing from source requires that you have a C++ compiler on your system that supports C++11.
ja_jp: ソースからインストールするには、お使いのシステム上にC++11をサポートするC++コンパイラが必要です。
ko_kr: 소스에서 설치하려면 C++11을 지원하는 시스템에서 C++ 컴파일러가 있어야 한다.

source: Compiler for Linux
de_de: Compiler für Linux
ja_jp: Linuxのコンパイラ
ko_kr: 리눅스용 컴파일러

source: On most Linux platforms, the necessary GCC compiler is already installed.
de_de: Auf den meisten Linux-Plattformen ist der notwendige GCC-Compiler bereits installiert.
ja_jp: ほとんどのLinuxプラットフォームには、必要なGCCコンパイラがインストール済みです。
ko_kr: 대부분의 리눅스 플랫폼에서는 필요한 GCC 컴파일러가 이미 설치되어 있다.

source: Compiler for macOS
de_de: Compiler für macOS
ja_jp: macOS のコンパイラ
ko_kr: 맥OS용 컴파일러

source: If you use macOS, you can install the Clang compiler by installing XCode. Check if you have XCode and Clang installed by opening a terminal window and entering the following.
de_de: Bei der Verwendung von macOS kann man den Clang-Compiler installieren, indem man XCode installiert. Zum Überprüfen, ob Xcode und Clang installiert sind, kann man folgenden Befehl in einem Terminal-Fenster ausführen.
ja_jp: macOSを使用している場合は、XCodeをインストールすることで、Clangのコンパイラをインストールすることができます。ターミナル・ウィンドウを開き以下のコマンドを入力して、XCodeとClangがイントールされていることを確認します。
ko_kr: 만약 맥오에스를 사용하고 있다면, XCode를 설치하면 Clang 컴파일러를 설치할 수 있다. XCode와 Clang이 설치되어 있는지 확인하기 위해서는 터미널을 열고 다음 명령어를 입력한다.

source: Install XCode and Clang by using the following command.
de_de: XCode und Clang installiert man mit folgendem Befehl.
ja_jp: 以下のコマンドでXCodeとClandをインストールします。
ko_kr: 다음 명령어를 사용하여 XCode와 Clang을 설치한다.

source: Compiler for Windows
de_de: Compiler für Windows
ja_jp: Windowsのコンパイラ
ko_kr: 윈도우용 컴파일러

source: On Windows, it is easiest to install the Visual C++ compiler from the `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__. You can instead install Visual Studio version 2015 or 2017, making sure to select the options for installing the C++ compiler.
de_de: In Windows ist es am einfachsten den Visual C++-Compiler aus den `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__ zu installieren. Stattdessen kann man auch Visual Studio in der Version 2015 oder 2017 installieren. Dabei muss die Option den C++-Compiler zu installieren ausgewählt werden.
ja_jp: Windowsでは、Visual C++ Compilerを Webの `Build Tools for Visual Studio 2017 <https://visualstudio.microsoft.com/downloads/#build-tools-for-visual-studio-2017>`__ からインストールする方法が最も簡単です。その他に Visual Studio 2015 あるいは 2017をインストールする方法もありますが、その際にはインストールオプションの C++ compiler を選択することを忘れない様にしてください。

source: Once the compilers are installed, you are ready to install Qiskit Terra.
de_de: Sind die Compiler installiert, kann man mit der Installation von Qiskit Terra fortfahren.
ja_jp: コンパイラがインストールされたら、Qiskit Terraのイントール準備完了です。
ko_kr: 컴파일러가 설치되고 나면 키스킷 테라를 설치할 준비가 된 것이다.

source: Clone the Terra repository.
de_de: Das Terra Repository klonen.
ja_jp: Terraレポジトリをクローンします。
ko_kr: 테라 코드 저장소를 복제.

source: Cloning the repository creates a local folder called ``qiskit-terra``.
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-terra``.
ja_jp: レポジトリをクローンすると、``qiskit-terra``という名前のローカル・フォルダが作成されます。
ko_kr: 저장소를 복제하면 ``qiskit-terra``라는 이름의 지역 디렉토리가 생성된다.

source: Install the Python requirements libraries from your ``qiskit-terra`` directory.
de_de: Installieren der erforderlichen Python-Pakete aus dem ``qiskit-terra`` Verzeichnis.
ja_jp: 作成された``qiskit-terra``ディレクトリから、Pythonの必要なライブラリをインストールします。
ko_kr: ``qiskit-terra`` 디렉토리에 필요한 파이썬 라이브러리를 설치한다.

source: If you want to run tests or linting checks, install the developer requirements.
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, muss man zusätzlich die Entwicklungs-Abhängigkeiten installieren.
ja_jp: もし、テストを実行したり文法をチェックしたい場合は、開発者向けライブラリをインストールします。
ko_kr: 만약 테스트 코드를 실행하거나 스타일 검사를 하고자 한다면, 개발자 요구사항 라이브러리를 설치한다.

source: Install ``qiskit-terra``.
de_de: ``qiskit-terra`` installieren.
ja_jp: ``qiskit-terra``をインストールします。
ko_kr: ``qiskit-terra``를 설치.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied, you can do this with:
de_de: Möchte man eine Installation im editierbaren Modus vornehmen, das heisst, Code-Änderungen im Projekt benötigen keine Reinstallation, kann man das wie folgt machen:
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合は、次の手順を実行します:
ko_kr: 수정 가능한 모드로 설치, 즉 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는 경우 다음의 명령어를 사용한다.

source: You can then run the code examples after installing Terra. You can run the example with the following command.
de_de: Nachdem Terra installiert ist, kann man mit dem folgenden Befehl die Code-Beispiele ausführen.
ja_jp: Terraのインストール後、サンプル・コードを実行することができます。サンプルを実行するには以下のコマンドを使用します:
ko_kr: 테라를 설치한 이후에 예제 코드들을 실행해 볼 수 있다. 이를 위해서는 다음 명령어를 실행한다.

source: If you do not intend to install any other components, qiskit-terra will emit a ``RuntimeWarning`` warning that both qiskit-aer and qiskit-ibmq-provider are not installed. This is done because users commonly intend to use the additional elements, but do not realize they are not installed, or that the installation of either Aer or the IBM Quantum Provider failed for some reason. If you wish to suppress these warnings, add::
de_de: Beabsichtigt man nicht, weitere Komponenten zu installieren, wird qiskit-terra eine ``RuntimeWarning`` mit dem Hinweis, dass qiskit-aer und qiskit-ibmq-provider nicht installiert sind, ausgeben. Dies ist beabsichtigt, da Benutzer normalerweise die weiteren Elemente verwenden wollen aber nicht realisieren, dass diese noch nicht installiert sind, oder, dass die Installation von Aer oder dem "IBM Quantum Provider" nicht funktioniert hat. Möchte man die Warnung unterdrücken, fügt man dieses hinzu::
ja_jp: 他のコンポーネントをインストールしない場合、qiskit-terraはqiskit-aerとqiskit-ibmq-providerの両方がインストールされていないことを示す ``RuntimeWarning`` を発します。これは追加要素を使用するつもりだが、インストールされていないことに気づかなかったり、AerやIBM Quantum Providerのインストールが何らかの理由でインストールが失敗しているために警告を発します。これらの警告を抑制したい場合は、以下を追加してください:

source: before any ``qiskit`` imports in your code. This will suppress the warning about the missing qiskit-aer and qiskit-ibmq-provider, but will continue to display any other warnings from qiskit or other packages.
de_de: im Code vor jedem ``qiskit`` Import hinzu. Dies unterdrückt nur die Warnung der fehlenden Pakete qiskit-aer und qiskit-ibmq-provider. Andere Warnungen von qiskit oder sonstigen Paketen erscheinen weiterhin.
ja_jp: コード内にて、``qiskit`` をまず最初にインポートするように指定します。 これにより、欠落しているqiskit-aerおよびqiskit-ibmq-providerに関する警告が抑制されますが、qiskitまたは他のパッケージからのその他の警告は継続して表示されます。

source: Installing Aer from Source
de_de: Installieren von Aer aus dem Quelltext
ja_jp: Aerのソースコードからのインストール
ko_kr: 소스에서 아르 설치

source: Clone the Aer repository.
de_de: Das Aer Repository klonen.
ja_jp: Aerレポジトリをクローンします。
ko_kr: 아르 저장소를 복제.

source: Install build requirements.
de_de: Installationsvoraussetzungen installieren.
ja_jp: ビルドの必要要件をインストールします。
ko_kr: 빌드 요구사항을 설치.

source: After this, the steps to install Aer depend on which operating system you are using. Since Aer is a compiled C++ program with a Python interface, there are non-Python dependencies for building the Aer binary which can't be installed universally depending on operating system.
de_de: Ab hier ist die Installation von Aer abhängig vom verwendeten Betriebssystem. Da Aer ein kompiliertes C++ Programm mit einer Python-Schnittstelle ist, gibt es Nicht-Python Abhängigkeiten, um Aer zu kompilieren, welche abhängig vom verwendeten Betriebssystem sind.
ja_jp: この後、Aerをインストールする手順は、使用しているオペレーティング・システムによって異なります。AerはPythonインターフェースを持つコンパイルされたC++プログラムなので、AerバイナリをビルドするのにPythonへの依存性はありませんが、作成されたバイナリはオペレーティング・システムに依存するため普遍的にインストールすることはできません。

source: Install compiler requirements.
de_de: Compiler Abhängigkeiten installieren.
ja_jp: コンパイラの必要要件をインストールします。
ko_kr: 컴파일러 요구사항을 설치.

source: Building Aer requires a C++ compiler and development headers.
de_de: Aer benötigt einen C++-Compiler und Entwicklungsheader.
ja_jp: AerをビルドするにはC++コンパイラと開発ヘッダーが必要です。
ko_kr: 아르 설치는 C++ 컴파일러와 개발 헤더를 필요로 한다.

source: If you're using Fedora or an equivalent Linux distribution, install using:
de_de: Verwendet man Fedora oder eine ähnliche Linux-Distribution, installiert man sie via:
ja_jp: Fedoraもしくは同等のLinux ディストリビューションを使っている場合は、次のコマンドでインストールできます:
ko_kr: 페도라나 유사한 리눅스 배포본을 사용하는 경우 다음을 사용해 설치한다:

source: For Ubuntu/Debian install it using:
ja_jp: Ubuntu/Debianを使っている場合は以下の通りです：
ko_kr: 우분투/데비안을 사용하는 경우 다음을 사용해 설치한다:

source: Install OpenBLAS development headers.
de_de: OpenBLAS Entwicklungsheader installieren.
ja_jp: OpenBLASの開発ヘッダーをインストールします。
ko_kr: OpenBLAS 개발 헤더를 설치한다.

source: Install dependencies.
de_de: Installieren von Abhängigkeiten.
ja_jp: 依存関係をインストールします。
ko_kr: 종속 라이브러리 설치.

source: To use the `Clang <https://clang.llvm.org/>`__ compiler on macOS, you need to install an extra library for supporting `OpenMP <https://www.openmp.org/>`__. You can use `brew <https://brew.sh/>`__ to install this and other dependencies.
de_de: Um den `Clang <https://clang.llvm.org/>`__ Compiler auf macOS zu verwenden, benötigt man eine separate Bibliothek, welche `OpenMP <https://www.openmp.org/>`__ unterstützt. Diese und andere Abhängigkeiten kann man mit `brew <https://brew.sh/>`__ installieren.
ja_jp: macOSで `Clang <https://clang.llvm.org/>`__ コンパイラを使用するには、 `OpenMP <https://www.openmp.org/>`__ をサポートするための追加のライブラリをインストールする必要があります。 `brew <https://brew.sh/>`__ を使用して、この依存関係およびその他の依存関係をインストールできます。
ko_kr: 맥OS 에서 `Clang <https://clang.llvm.org/>`__ 컴파일러를 사용할 경우에는, `OpenMP <https://www.openmp.org/>`__ 를 지원하기 위해서 추가적인 라이브러리를 설치해야 한다. `brew <https://brew.sh/>`__ 를 사용하여 OpennMP 또는 다른 종속 프로그램/라이브러리 들을 설치 할 수 있다.

source: Then install a BLAS implementation; `OpenBLAS <https://www.openblas.net/>`__ is the default choice.
de_de: Anschließend installiert man eine BLAS Implementierung; `OpenBLAS <https://www.openblas.net/>`__ ist der Standard.
ja_jp: 次にBLAS実装をインストールします。`OpenBLAS <https://www.openblas.net/>`__ が一般的な選択です。
ko_kr: 다음으로 BLAS구현을 설치한다; `OpenBLAS <https://www.openblas.net/>`__ 는 기본 선택 사항이다.

source: Next, install ``Xcode Command Line Tools``.
de_de: Als nächstes installiert man die ``Xcode Command Line Tools``.
ja_jp: 次に、``Xcode Command Line Tools`` をインストールします。
ko_kr: 다음으로 ``Xcode Command Line Tools`` 을 설치한다.

source: On Windows you need to use `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ or `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ to install all the dependencies.
de_de: In Windows benötigt man `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ oder `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ um alle Abhängigkeiten installieren zu können.
ja_jp: Windowsでは、すべての依存関係をインストールするために `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ または `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ を使用する必要があります 。
ko_kr: 윈도우에서는 모든 종속 프로그램/라이브러리 를 설치하기 위해 `Anaconda3 <https://www.anaconda.com/distribution/#windows>`__ 나 `Miniconda3 <https://docs.conda.io/en/latest/miniconda.html>`__ 를 사용한다.

source: Install binary and build dependencies.
de_de: Compiler- und Installationsvoraussetzungen installieren.
ja_jp: バイナリをインストールし、依存関係をビルドします。
ko_kr: 바이너리를 설치하고, 종속 프로그램/라이브러리를 빌드한다.

source: Build and install qiskit-aer directly
de_de: qiskit-aer direkt kompilieren und installieren
ja_jp: qiskit-aerを直接ビルドしインストールします。
ko_kr: 키스킷-아르를 직접 빌드하고 설치한다.

source: If you have pip <19.0.0 installed and your environment doesn't require a custom build, run:
de_de: Hat man pip < 19.0.0 installiert und benötigt keine benutzerdefinierte Konfiguration, kann man folgenden Befehl verwenden:
ja_jp: pip 19.0.0 より前がインストールされていて、カスタム・ビルドが不要な環境の場合は、次を実行します:
ko_kr: pip 버전 19.0.0 이하를 설치하였고, 본인의 환경이 사용자 빌드를 요구하지 않으면 다음을 실행한다:

source: This will both build the binaries and install Aer.
de_de: Damit kompiliert und installiert man Aer.
ja_jp: このコマンドは、バイナリのビルドとAerのインストール両方を実行します。
ko_kr: 이는 바이너리를 빌드하고 아르를 설치한다.

source: Alternatively, if you have a newer pip installed, or have some custom requirement, you can build a Python wheel manually.
de_de: Alternativ, wenn man eine neuere Version von pip verwendet oder eine spezielle Konfiguration benötigt, kann man das Python Wheel von Hand erstellen.
ja_jp: 別な手法として、より新しいpipがインストールされている場合、もしくはカスタム要件がある環境の場合、手動でPython wheelをビルドすることができます。
ko_kr: 그렇지 않으면 최신 pip가 설치되어 있거나, 사용자 지정 요구 사항이 있으면 파이썬 휠을 직접 빌드 할 수 있다.

source: If you need to set a custom option during the wheel build, refer to :ref:`aer_wheel_build_options`.
de_de: Benötigt man eine benutzerdefinierte Konfiguration während der Wheel Erstellung, findet man Informationen unter :ref:`aer_wheel_build_options`.
ja_jp: wheelのビルドにカスタム・オプションを指定する必要がある場合は、:ref:`aer_wheel_build_options`を参照してください。
ko_kr: 휠 빌드 중 사용자 옵션을 선택해야 하는 경우 :ref:`aer_wheel_build_options`을 참고한다.

source: After you build the Python wheel, it will be stored in the ``dist/`` dir in the Aer repository. The exact version will depend
de_de: Nachdem das Python Wheel erstellt wurde, findet man es im ``dist/`` Verzeichnis des Aer Repository. Die genaue Version hängt davon ab
ja_jp: Python wheelは、ビルド後Aerレポジトリの ``dist/`` ディレクトリに保存されます。正確なバージョンは場合に依ります。
ko_kr: 파이썬 휠을 빌드 하면 아르 저장소 안의 디렉토리 ``dist/``에 저장이 된다. 정확한 버전은 상황에 따라 다르며 설치 명령어는

source: The exact filename of the output wheel file depends on the current version of Aer under development.
de_de: Der genaue Dateiname der Output Wheel Datei hängt von der aktuellen Version von Aer ab.
ja_jp: 作成されたwheelの正確なファイル名は、開発中であるAerの現在のバージョンに依存します。
ko_kr: 출력 휠 파일의 정확한 파일 이름은 개발중인 아르의 현재 버전에 따라 다르다.

source: Custom options during wheel builds
de_de: Benutzerdefinierte Wheel Konfiguration
ja_jp: wheelビルドのカスタム・オプション
ko_kr: 휠 빌드 중 사용자 정의 옵션

source: The Aer build system uses `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ to run the compilation when building it with the Python interface. It acts as an interface for `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ to call `CMake <https://cmake.org/>`__ and compile the binaries for your local system.
de_de: Das Aer Build-System verwendet `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>`__ für die Kompilierung, wenn man die Python Schnittstelle verwendet. Es fungiert dabei als Schnittstelle zu `setuptools <https://setuptools.readthedocs.io/en/latest/>`__, um `CMake <https://cmake.org/>`__ aufzurufen und die Binärdateien für das lokale System zu kompilieren.
ja_jp: Aerビルドシステムは、 `scikit-build <https://scikit-build.readthedocs.io/en/latest/index.html>` __ を使用して、Pythonインターフェイスでビルドするときにコンパイルを実行します。 これは、 `setuptools <https://setuptools.readthedocs.io/en/latest/>` __ のインターフェースとして機能し、 `CMake <https://cmake.org/>` __ を呼び出して、ローカルシステムのバイナリをコンパイルします。

source: Due to the complexity of compiling the binaries, you may need to pass options to a certain part of the build process. The way to pass variables is:
de_de: Durch die Komplexität, die mit dem Kompilieren von Binärdateien einhergeht, kann es sein, dass man für einen bestimmten Teil des Prozesses benutzerdefinierte Optionen angeben muss. Dies kann man mit:
ja_jp: バイナリのコンパイルは複雑なため、ビルド・プロセスの特定の部分にオプションを渡す必要があるかもしれません。 変数を渡す方法は次のとおりです:
