Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: de_de, ja_jp, ko_kr

source: In addition, the first line of the commit message becomes an entry in the generated changelog if the PR is tagged as being included in the changelog. It is critically important that you write clear and succinct summary lines.
de_de: Zusätzlich wird die erste Zeile einer Commit Nachricht als Eintrag im automatisch generierten Changelog verwendet, wenn der Pull-Request gekennzeichnet wurde, dort aufgenommen zu werden. Daher ist es sehr wichtig, klare und prägnante Zusammenfassungen zu schreiben.
ja_jp: さらに、PRが変更ログに含まれているとタグ付けされている場合、コミットメッセージの最初の行は、生成された変更ログのエントリになります。 明確で簡潔な要約行を書くことが非常に重要です。
ko_kr: 게다가 커미트 메시지의 첫 번째 줄은 해당 풀 리퀘스트가 주요 코드에 포함되는 경우 변경로그(changelog)의 입력으로 사용된다. 따라서 명확하고, 간결한 요약을 작성하는 것은 매우 중요하다.

source: Describe any limitations of the current code.
de_de: Beschreiben die Einschränkungen des derzeitigen Codes.
ja_jp: 現在のコードの制約を説明します。
ko_kr: 현재 코드의 모든 한계를 기술한다.

source: If the code being changed still has future scope for improvements, or any known limitations, mention these in the commit message. This demonstrates to the reviewer that the broader picture has been considered, and what tradeoffs have been done in terms of short-term goals versus long-term wishes.
de_de: Wenn der Code, an den man gearbeitet hat, noch Spielraum für künftige Verbesserung lässt oder bestimmte Einschränkungen oder Grenzen hat, sollte man dies in seiner Commit-Nachricht angeben. Dies zeigt dem Reviewer, dass das Problem in Gänze betrachtet wurde und welche Kompromisse zugunsten von kurzfristigen Zielen gegen langfristige Wünsche eingegangen wurden.
ja_jp: 変更中のコードに、将来的な改善の余地や既知の制限がある場合には、それらについてコミットメッセージで触れてください。そうすることで、レビューアに対して、より大局的な視点が考慮されていること、長期的な展望に対して短期的目標の観点からどのようなトレードオフが行われたかを示すことになります。
ko_kr: 변경되는 코드가 여전히 향후에 개선될 여지가 있거나 어떤 한계가 있는 경우 커미트 메시지에 기술한다. 이런 내용은 검토자에게 넓은 관점에서 고려했다는 것과 장기적인 관점 대비 단기적인 목표의 관점에서 어떤 절충을 했는지 설명한다.

source: Include references to issues.
de_de: Referenzen zu Issues hinzufügen.
ja_jp: Issueへの参照を含めてください。
ko_kr: 이슈에 참조를 포함한다.

source: If the commit fixes are related to an issue, make sure you annotate that in the commit message. Use the syntax::
de_de: Wenn der Commit einen Issue löst, sollte man diesen Issue in der Commit Nachricht referenzieren. Dies ist die Syntax::
ja_jp: コミットする修正がIssueに関係している場合は、コミットメッセージでそのことを忘れずに注釈してください。次の構文を使用してください。
ko_kr: 커미트 수정이 이슈와 관련이 있다면 커미트 메시지에 해당 이슈의 주석을 단다. 다음 문법을 사용한다::

source: if it fixes the issue (GitHub will close the issue when the PR merges).
de_de: um den Issue zu beheben (GitHub schließt den Issue automatisch, wenn der Pull-Request gemerged wird).
ja_jp: 問題が修正された場合（PRがマージされるとGitHubは問題をクローズします）。
ko_kr: 해당 커미트가 이슈를 해결하는 경우에 해당한다 (깃허브는 풀 리퀘스트가 병합될 때 이슈를 닫는다).

source: The main rule to follow is:
de_de: Grundsätzlich sollte man folgendes beherzigen:
ja_jp: 守るべき主なルールは次の通りです。
ko_kr: 여기서 주요 규칙은 다음과 같다.

source: The commit message must contain all the information required to fully understand and review the patch for correctness. Less is not more.
de_de: Die Commit Nachricht muss alle Informationen enthalten, welche benötigt werden um die Änderung komplett zu verstehen und auf Korrektheit prüfen zu können. Weniger ist nicht mehr.
ja_jp: コミットメッセージには、パッチの正確性を完全に理解して確認するために必要なすべての情報が含まれている必要があります。この場合"Less is more（『より少なきは、より多きこと』）"にはなりません。
ko_kr: 커미트 메시지는 패치를 완전히 이해하고, 검토하는데 필요한 모든 정보를 정확하게 포함해야만 한다. 내용이 간략하다고 좋은 것만은 아니다.

source: Documenting Your Code
de_de: Code-Dokumentation
ja_jp: コードの文書化
ko_kr: 코드에 주석 달기

source: If you make a change to an element, make sure you update the associated *docstrings* and parts of the documentation under ``docs/apidocs`` in the corresponding repo. To locally build the element-specific documentation, run ``tox -edocs`` to compile and build the documentation locally and save the output to ``docs/_build/html``. Additionally, the Docs CI job on azure pipelines will run this and host a zip file of the output that you can download and view locally.
de_de: Bei Änderungen an einem Element sollte man immer sichergehen, die zugehörigen *Docstrings* und die Dokumentation unter ``docs/apidocs`` im Repository des jeweiligen Elements entsprechend zu aktualisieren. Um die Dokumentation eines Elements lokal zu generieren, führt man ``tox -edocs`` aus, um die Dokumentation zu kompilieren und die Ausgabe in ``docs/_build/html`` zu speichern. Dies führt auch der Docs CI Job auf Azure Pipelines aus und stellt ein Zip-Archiv mit der Ausgabe zur Verfügung, welches man herunterladen und lokal ansehen kann.
ja_jp: 要素に変更を加える場合、関連する * docstrings* と、対応するリポジトリの ``docs/ apidocs`` の下にあるドキュメントの一部を必ず更新してください。 要素固有のドキュメントをローカルでビルドするには、``tox -edocs`` を実行してドキュメントをコンパイルしてローカルにビルドし、出力を ``docs / _build / html`` に保存します。 さらに、azureパイプラインのDocs CIジョブはこれを実行し、ダウンロードしてローカルで表示できる出力のzipファイルをホストします。
ko_kr: 코드의 어느 부분을 변경한다면, 해당 코드 저장소의 ``docs/apidocs`` 아래 있는 문서 부분의 관련된 *docstrings*를 업데이트 한다. 문서와 관련된 부분을 본인의 컴퓨터에서 컴파일과 빌드하기 위해서는 ``tox -edocs``를 실행하면 결과는 ``docs/_build/html``로 저장된다. 추가적으로 애저(Azure) 파이프라인의 Docs CI 작업은 이 과정을 자동으로 실행하고, 결과를 사용자가 다운로드 하고, 자신의 컴퓨터에서 확인할 수 있도록 압축 파일로 호스팅한다.

source: If you have an issue with the `combined documentation <https://qiskit.org/documentation/>`__ that is maintained in the `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__, you can open a `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ if you see doc bugs, have a new feature that needs to be documented, or think that material could be added to the existing docs.
de_de: Bei Fehlern, Wünschen oder Vorschlägen zur `zusammengeführten Dokumentation <https://qiskit.org/documentation/>`__, welche im `Qiskit/qiskit Repository <https://github.com/Qiskit/qiskit>`__ verwaltet wird, öffnet man einen `documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__.
ja_jp: `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__ でメンテナンスされている `combined documentation <https://qiskit.org/documentation/>`__ に問題がある場合、つまりドキュメントに間違いがあったり、ドキュメントすべき新機能があったり、既存のドキュメントに資料を追加できるような場合には、`documentation issue <https://github.com/Qiskit/qiskit/issues/new/choose>`__ を起こすことができます。
ko_kr: `Qiskit/qiskit repo <https://github.com/Qiskit/qiskit>`__ 에서 관리되는 `합쳐진 문서 <https://qiskit.org/documentation/>`__ 와 관련한 이슈가 있거나, 문서 관련 버그를 발견하거나, 문서 작업이 필요한 새로운 기능이 있거나, 현재 문서에 내용이 추가되어야 한다고 생각하는 경우에는 `문서 이슈 <https://github.com/Qiskit/qiskit/issues/new/choose>`__ 를 만들 수 있다.

source: Good First Contributions
de_de: Guter Einstieg
ja_jp: 上手な最初の貢献
ko_kr: 처음으로 키스킷에 기여하기

source: If you would like to contribute to Qiskit, but aren't sure where to get started, the ``good first issue`` label on issues for a project highlights items appropriate for people new to the project. These are all issues that have been reviewed and tagged by contributors as something a new contributor should be able to work on. In other words, intimate familiarity with Qiskit is not a requirement to develop a fix for the issue.
de_de: Das Issue-Label ``good first issue`` kennzeichnet Vorgänge, die ideal für Einsteiger sind, welche mitwirken möchten, sich aber nicht sicher sind, wo man anfangen soll. Dabei handelt es sich um Vorgänge, welche von Mitwirkenden als anfängerfreundlich eingestuft wurden. Eine tiefere Kenntnis von Qiskit ist dann meist keine Voraussetzung, um das Issue zu lösen.
ja_jp: Qiskit に貢献したいけれどもどこから始めたらよいかわからない、というときは、プロジェクトについている ``good first issue`` というラベルがプロジェクトへの新規参加者にとって適していることを示します。これらのイシューはすべて、新しい貢献者が作業することができるものとして、貢献者によってレビューされタグ付けされたものです。言い換えると、イシューの解決を進めるのに、Qiskit によく精通していることが要求されるわけではありません。
ko_kr: 키스킷에 기여하길 원하지만, 어디서 시작해야 할지 모른다면, 프로젝트의 이슈에 ``좋은 첫번째 이슈(good first issue)`` 레이블이 프로젝트에 새로 참여한 사람들에게 적절한 아이템임을 표시하는 역할을 한다. 좋은 첫번째 이슈들은 기여자들이 이미 검토를 하고, 레이블을 단 것이기 때문에 새로운 기여자가 다룰 수 있다. 다시 말해서 키스킷에 대한 깊은 이해가 이슈를 수정하는데 필수요소는 아니다.

source: Deprecation Policy
de_de: Deprecation-Richtlinie
ja_jp: 非推奨に関する方針
ko_kr: 지원 중단 정책

source: Qiskit users need to know if a feature or an API they rely upon will continue to be supported by the software tomorrow. Knowing under which conditions the project can remove (or change in a backwards-incompatible manner) a feature or API is important to the user. To manage expectations, the following policy is how API and feature deprecation/removal is handled by Qiskit:
de_de: Qiskit-Nutzer müssen wissen, ob eine Funktion oder eine API, auf die sie sich verlassen, auch in Zukunft durch die Software unterstützt wird. Für den Anwender ist es wichtig zu wissen, unter welchen Bedingungen ein Feature oder eine API aus dem Projekt entfernt (oder in einer nicht abwärtskompatiblen Weise geändert) werden kann. Um Erwartungen zu steuern gelten bei Qiskit die Folgenden Richtlinien, nach denen die Entfernung von APIs und Features gehandhabt werden:
ja_jp: Qiskit ユーザは、自分が依存している機能やAPIが将来のソフトウェアでも引き続きサポートされるかどうかを知る必要があります。どのような条件のもとで、プロジェクトが機能やAPIを削除（または後方互換性がないようなやり方で変更）してよいとしているかを知ることは、ユーザにとって重要です。Qiskit は期待を管理するため、以下のポリシーにしたがって、APIおよび機能の廃止／削除を扱っています。
ko_kr: 키스킷 사용자들은 기능이나 API가 향후에도 계속해서 지원이 될 것인지 인지할 필요가 있다. 프로젝트가 어떤 조건 하에서 기능이나 API를 제거할 수 있는지 이해하는 것은 사용자에게 중요하다. 기대치를 맞추기 위해서 다음 정책은 키스킷에서 API와 기능 지원 중단/제거가 관리되는 방법을 정의한다.

source: 1. Features, APIs, or configuration options are marked deprecated in the code. Appropriate ``DeprecationWarning`` class warnings will be sent to the user. The deprecated code will be frozen and receive only minimal maintenance (just so that it continues to work as-is).
de_de: 1. Funktionen, APIs oder Konfigurationsoptionen sind im Code als "deprecated" gekennzeichnet. Die entsprechenden ``DeprecationWarning`` Klassenwarnungen werden an den Benutzer gesendet. Der veraltete Code wird eingefroren und nur minimal gewartet (damit er weiterhin wie gewohnt funktioniert).
ja_jp: 1. 機能、API、構成オプションがコード中で非推奨とマークされます。適切な``DeprecationWarning`` クラスの警告がユーザーに送信されます。非推奨のコードはフリーズされ、最低限のメンテナンスしか受けられません(この時点では、as-isで動作し続けます)。
ko_kr: 1. 기능, APIs, 혹은 다른 설정 옵션은 코드에 지원 중단이라고 표시된다. 적절한 ``지원 중단 경고(DeprecationWarning)`` 클래스 경고가 사용자에게 전달된다. 지원 중단된 코드는 동결되고, (현재 그대로 동작하도록) 최소한의 관리만 적용된다.

source: 2. A migration path will be documented for current users of the feature. This will be outlined in the both the release notes adding the deprecation, and the release notes removing the feature at the completion of the deprecation cycle. If feasible, the warning message will also include the migration path. A migration path might be "stop using that feature", but in such cases it is necessary to first judge how widely used and/or important the feature is to users, in order to determine a reasonable obsolescence date.
de_de: 2. Es wird eine Anleitung zur Migration für bestehende Nutzer des Features dokumentiert. Diese wird sowohl in den Release Notes der Version, in der die Deprecation hinzufügt wurde, als auch in den Release Notes der Version, in der das Feature final entfernt wurde, aufgeführt. Falls möglich, sollte die Warnmeldung auch eine Anleitung zur Migration enthalten. Eine solche Anleitung kann bspw. "stop using that feature" sein. In solchen Fällen ist es aber nötig zuerst abzuwägen, wie wichtig das Feature für Nutzer ist, oder wie oft es verwendet wird, um ein geeignetes Auslaufdatum festzulegen.
ja_jp: 2. 機能の現ユーザーのためにマイグレーション・パスが文書化されます。これは、非推奨化を追加するリリース・ノートと、非推奨サイクルの完了時にフィーチャーを除去するリリース・ノートの両方で説明されます。 可能な場合は、警告メッセージにマイグレーション・パスも含まれます。 マイグレーション・パスは、「その機能を使用することをやめる」という場合がありますが、そのような場合には、まずその機能の使用頻度や重要度を判断する必要があります。これにより、妥当な廃止の日付を決定することができます。
ko_kr: 2. 지원이 중단되는 기능의 경우 사용자에게 변경 방법이 문서로 제공될 것이다. 지원 제공을 추가하는 릴리즈(release) 노트와 지원 중단 작업 사이클이 끝나는 시점에 기능을 제거하는 릴리즈 노트 모두에 서술된다. 가능하면 경고 메시지도 변경 방법을 포함할 것이다. 변경의 중요한 방향이 "기능 사용을 중지함"이 될 수도 있지만, 이런 경우에는 합당한 지원 중단 날짜를 결정하기 위해서 해당 기능이 얼마나 광범위 하고, 중요하게 사용되었는지 결정하는 과정이 필수적이다.

source: 3. An obsolescence date for the feature will be set. The feature must remain intact and working (although with the proper warning being emitted) in all releases pushed until after that obsolescence date. At the very minimum, the feature (or API, or configuration option) should be marked as deprecated (and continue to be supported) for at least three months of linear time from the release date of the first release to include the deprecation warning. For example, if a feature were deprecated in the 0.9.0 release of Terra, which was released on August 22, 2019, then that feature should still appear in all releases until at least November 22, 2019. Since releases do not occur at fixed time intervals, a deprecation warning may only occur in one release prior to removal.
de_de: 3. Ein Auslaufdatum für das Feature wird festgelegt. Das Feature muss bis zu diesem Ablaufdatum in allen weiteren Versionen intakt bleiben und funktionieren (jedoch mit der Ausgabe einer entsprechenden Warnung). Zumindest sollte das Feature (oder die API oder Konfiguration) für mindestens 3 Monate (ab Ausgabe der Deprecation) als Deprecated gekennzeichnet sein (und in dieser Zeit weiter unterstützt werden). Wenn ein Feature bspw. in Terra Version 0.9.0 (welche am 22. August 2019 veröffentlicht wurde) als Deprecated gekennzeichnet wurde, sollte das Feature Bestandteil von allen weiteren Versionen bis mindestens zum 22. November 2019 sein. Da neue Versionen nicht in bestimmten zeitlichen Abständen veröffentlicht werden, kann eine Deprecation Warnung auch in nur einer Version vor der endgültigen Entfernung des Features auftauchen.
ja_jp: 3. その機能の廃止日を設定します。廃止日まで、全てのリリースにおいて、その機能は完全なまま(適切な警告が表示されますが) 動作し続けます。最低限、機能(APIまたは構成オプション) は、最初のリリース日から少なくとも線形時間で3 カ月間、非推奨の警告を表示することで、非推奨(かつサポートされ続ける) としてマークされている必要があります。 例えば、ある機能が2019年8月22日にリリースされたTerraの0.9.0リリースで非推奨となった場合、その機能は少なくとも2019年11月22日まですべてのリリースで使用できるはずです。 リリースは一定の間隔では発生しないため、非推奨の警告は、削除の1つ前のリリースでしか発生しない可能性があります。
ko_kr: 3. 기능에 대한 지원 중단 날짜가 설정될 것이다. 기능은 지원 중단 날짜 전까지 모든 릴리즈에 그대로 유지하고, (적절한 경고 메시지와 함께) 동작해야만 한다. 최소한 기능(또는 API, 설정 옵션)은 지원 중단 메시지를 포함하는 첫 번째 릴리즈의 릴리즈 날짜로부터 최소 3개월 동안 지원 중단에 대해 표시를 해야한다. 예를 들어, 2019년 8월 22일에 릴리즈 된 기능이 테라(Terra)의 0.9.0 릴리즈에서 지원 중단 된다면, 이 기능은 최소한 2 019년 11월 22일까지 모든 릴리즈에서 유지되어야 한다. 릴리즈는 정해진 시간 간격으로 발생하는 것이 아니기 때문에 지원 중단 경고 메시지는 제거되기 바로 전의 릴리즈에서만 발생할 것이다.

source: Note that this delay is a minimum. For significant features, it is recommended that the deprecated feature appears for at least double that time. Also, per the stable branch policy, deprecation removals can only occur during minor version releases; they are not appropriate for backporting.
de_de: Dieser Zeitraum ist jedoch nur ein Minimum. Für wichtige Features sollte es mindestens der doppelte Zeitraum sein. Außerdem können Deprecated Features nach dem Stable Branch Prinzip nur bei Minor-Version Releases entfernt werden; sie sind nicht zur Rückportierung geeignet.
ja_jp: この遅延は最小値であることに注意してください。 重要な機能については、非推奨の機能であると少なくとも 2 回は表示されることを推奨します。 また、ブランチの安定化ポリシーによって、非推奨の削除は、マイナー・バージョンのリリース中にのみ発生することがあります。これらはバックポーティングには不適です。
ko_kr: 이정도의 지연은 최소시간임을 알기 바란다. 중요한 기능에 대해서는 지원 중단 기능을 적어도 최소시간의 2배의 시간만큼 표시되는것 것을 권고한다. 또한 안정된 브랜치 정책에 따르면 기능 중단에 의한 제거는 부 버전(minor version) 릴리즈에서만 반영할 수 있다. 지원 중단 제거는 이전 버전을 수정하는 백포트(backport)를 지원하지 않는다.

source: Deprecation Warnings
de_de: Deprecation Warnungen
ja_jp: 非推奨の警告
ko_kr: 지원 중단 경고

source: The proper way to raise a deprecation warning is to use the ``warn`` function from the `warnings module <https://docs.python.org/3/library/warnings.html>`__ in the Python standard library. The warning category class should be a ``DeprecationWarning``. An example would be::
de_de: Der korrekte Weg, Deprecation Warnungen auszugeben, ist die ``warn`` Funktion des `warnings module <https://docs.python.org/3/library/warnings.html>`__ der Python Standardbibliothek zu nutzen. Die Warnungs-Klasse sollte eine ``DeprecationWarning`` sein. Ein Beispiel dafür wäre::
ja_jp: 非推奨の警告を出すのに適切な方法は、 Python 標準ライブラリの`warnings module <https://docs.python.org/3/library/warnings.html>`__ から``warn`` 機能を使用することです。 警告カテゴリー・クラスは ``DeprecationWarning`` でなければなりません。例として、次のようなものがあります:
ko_kr: 지원 중단 경고를 보여주는 적절한 방법은 파이썬 표준 라이브라리의 `경고 모듈 <https://docs.python.org/3/library/warnings.html>`__ 에서 ``warn`` 함수를 사용하는 것이다. 경고 범주 클래스는 ``DeprecationWarning``이어야 한다. 예제는 다음과 같다::

source: One thing to note here is the ``stack_level`` kwarg on the warn() call. This argument is used to specify which level in the call stack will be used as the line initiating the warning. Typically, ``stack_level`` should be set to 2, as this will show the line calling the context where the warning was raised. In the above example, it would be the caller of ``foo()``. If you did not set this, the warning would show that it was caused by the line in the foo() function, which is not helpful for users trying to determine the origin of a deprecated call. However, this value may be adjusted, depending on the call stack and where ``warn()`` gets called from. For example, if the warning is always raised by a private method that only has one caller, ``stack_level=3`` might be appropriate.
de_de: Erwähnenswert ist hierbei das ``stack_level`` Argument im warn() Aufruf. Dieses Argument definiert, welches Level im Call Stack als die Zeile verwendet wird, welche die Warnung ausgelöst hat. Normalerweise sollte ``stack_level`` auf 2 gesetzt sein, da dies die Zeile zeigt, welche den Kontext aufgerufen hat, der die Warnung ausgelöst hat. Im obigen Beispiel wäre das der Aufrufer von ``foo()``. Definiert man dies nicht, würde die Warnung anzeigen, dass die Zeile in der foo() Funktion die Warnung ausgelöst hat, was für Nutzer, die den Ursprung einer Deprecation Warnung suchen, nicht sinnvoll ist. Der Wert kann jedoch angepasst werden, je nachdem, von wo ``warn()`` aufgerufen wird. Wenn zum Beispiel die Warnung immer durch eine private Methode ausgelöst wird, die nur von einer Stelle aus aufgerufen wird, könnte ``stack_level=3`` besser geeignet sein.
ja_jp: ここで注目すべき点は、 warn() メソッドの ``stack_level`` kwarg です。 この引数は、呼び出しスタック内のどのレベルが、警告を開始する行として使用されるかを指定するために使用されます。 通常、``stack_level`` は 2に設定する必要があります。これにより、警告が出されたコンテキストを呼び出す行が表示されます。 上記の例では、``foo()``の呼び出し元になります。これを設定しなかった場合は、 foo() 関数内の行で発生したと警告が表示されます。これは、非推奨の呼び出しの起点を判別しようとしているユーザーにとっては役に立ちません。 ただし、この値は、コール・スタックや ``warn()`` が呼び出される場所によって調整されることがあります。 例えば、警告が常に 1 つの呼び出し元のみを持つ private メソッドによって生成される場合は、 ``stack_level=3`` が適切である場合があります。
ko_kr: 여기서 한 가지 주의할 사항은 warn() 호출에서 ``stack_level`` kwarg이다. 이 전달 인자는 콜 스택의 어떤 수준에서 경고를 시작하는 줄로 사용될 것인지를 명시하는데 활용된다. 일반적으로 경고가 발생되는 컨텍스트를 호출하는 줄을 보여줄 것이기 때문에 ``stack_level``은 2로 설정되어야 한다. 앞의 예제에서 ``foo()``의 호출자가 될 것이다. 이를 설정하지 않았다면, 경고는 foo() 함수의 줄에서 발생되었다고 보여줄 것이고, 이는 지원 중단 호출의 근원 코드를 알아 내는데 도움이 되지 않는다. 하지만 이 값은 ``warn()``이 호출되는 장소와 콜 스택에 따라서 조정될 것이다. 예를 들어, 경고가 오직 하나의 호출자만 가지는 비공개 메소드에 의해서 발생하는 경우에는 ``stack_level=3``이 적절한 값이다.

source: Stable Branch Policy
de_de: Das Stable Branch Prinzip
ja_jp: ブランチの安定化ポリシー
ko_kr: 안정된 브랜치 정책

source: The stable branch is intended to be a safe source of fixes for high-impact bugs and security issues that have been fixed on master since a release. When reviewing a stable branch PR, we must balance the risk of any given patch with the value that it will provide to users of the stable branch. Only a limited class of changes are appropriate for inclusion on the stable branch. A large, risky patch for a major issue might make sense, as might a trivial fix for a fairly obscure error-handling case. A number of factors must be weighed when considering a change:
de_de: Der Stable Branch ist als sichere Quelle von kritischen Bugfixes und Sicherheitspatches gedacht, welche auf dem Master Branch seit dem letzten Release veröffentlicht wurden. Bei der Prüfung eines Stable Branch Pull-Requests, muss man das Risiko eines jeden Patches gegen den Nutzen für die Benutzer des Stable Branch abwägen. Nur einige bestimmte Arten von Änderungen sind geeignet, um in den Stable Branch aufgenommen zu werden. Das könnte sowohl ein grosser, riskanter Patch für ein schwerwiegendes Problem, aber auch ein kleiner, trivialer Fix für einen unbedeutenden Fehlerfall sein. Eine Reihe an Faktoren müssen für eine Änderung berücksichtigt werden:
ja_jp: Stableブランチは、リリース後にマスター上で修正された、影響の大きいバグやセキュリティー問題に対応する修正の安全なソースになることを目的としています。 安定ブランチのプルリクエスト(PR) をレビューする時、与えられたパッチのリスクと安定ブランチを提供する価値のバランスを取る必要があります。 安定したブランチへ組み込むには、限定されたクラスのみへの変更が適しています。 大きな問題に対する大きくリスクの高いパッチは、あまり目立たないのエラー処理のための些細な修正同様、理にかなっているかもしれません。 変更をレビューする際には、多くの要因を検討する必要があります。
ko_kr: 안정된 브랜치는 이전 릴리즈 이후에 마스터 브랜치에 수정된 높은 영향의 버그나 보안 관련 이슈의 수정이 적용된 안전한 소스 코드를 유지하는 것을 목표로 한다. 안정된 브랜치의 풀 리퀘스트를 검토 할 때는 안정된 브랜치의 사용자에게 제공하는 가치와 제공된 패치의 위험성 사이에 균형을 유지해야 한다. 오직 제한된 종류의 변경 사항만 안정된 브랜치에 포함하는 것이 적절할 것이다. 주요한 이슈에 대한 크고 위험한 패치가 타당할 수 있고, 마찬가지로 상당히 이해하기 힘든 오류 처리에 대한 사소한 수정이 경우에 따라서 안정된 브랜치에 포함될 수 있다. 안정된 브랜치의 변경을 고려할 때는 다음과 같은 요소들을 고려해야만 한다.

source: The risk of regression: even the tiniest changes carry some risk of breaking something, and we really want to avoid regressions on the stable branch.
de_de: Das Risiko des Rückschritts: Selbst die kleinste Änderung bringt das Risiko mit sich, Fehler zu verursachen. Solche Rückschritte wollen wir auf dem Stable Branch definitiv vermeiden.
ja_jp: リグレッションのリスク: 最も小さな変更でも何かを壊すリスクがあり、stableブランチ上でのリグレッションは本当に避けたいです。
ko_kr: 퇴행의 위험: 정말 작은 변경도 프로그램의 동작을 망칠 수 있는 위험이 있고, 안정된 브랜치의 퇴행을 피하기를 원한다.

source: The user visibility benefit: are we fixing something that users might actually notice, and if so, how important is it?
de_de: Der Nutzen aus Benutzersicht: Reparieren wir etwas, das Nutzer auch tatsächlich wahrnehmen und falls ja, wie wichtig ist es?
ja_jp: ユーザーに見える利益: ユーザーが本当に気が付く修正していますか？そうであれば、その重要性はどのくらいですか？
ko_kr: 사용자에 보이는 이득: 사용자가 실제로 알아차릴 만한 것들을 수정하고 있는가? 그렇다면 그 변경은 얼마나 중요한 것인가?

source: How self-contained the fix is: if it fixes a significant issue but also refactors a lot of code, it's probably worth thinking about what a less risky fix might look like.
de_de: Wie autark die Änderung ist: Wenn eine Änderung ein wichtiges Problem löst aber auch jede Menge Code überarbeitet, sollte man wahrscheinlich darüber nachdenken, wie ein weniger riskanter Fix aussehen könnte.
ja_jp: 修正の自己完結度: 重要な問題を修正するだけでなく多くのコードをリファクタリングしている場合は、リスクの低い修正がどのようなものになるかを検討する価値があると考えられます。
ko_kr: 수정이 얼마나 자립적인가: 중요한 이슈를 수정하지만 동시에 많은 코드를 변경하는 경우에는 다소 덜 위험한 수정으로 변경할 수 없는지 생각해볼 가치가 있을 것이다.

source: Whether the fix is already on master: a change must be a backport of a change already merged onto master, unless the change simply does not make sense on master.
de_de: Ob die Änderung bereits im Master Branch ist: Eine Änderung muss eine Rückportierung einer bereits im Master Branch übernommenen Änderung sein, ausser natürlich die Änderung ist nicht sinnvoll im Master Branch.
ja_jp: 修正がすでにマスターブランチにあるかどうか: 変更がマスターに対して意味を持っていない場合、変更は既にマスターにマージされた変更のバックポートでなければなりません。
ko_kr: 수정이 이미 마스터 브랜치에 있는지 여부: 변경 사항이 단순히 마스터 브랜치에서 타당하지 않은 경우가 아니라면, 수정 사항은 마스터 브랜치에 이미 병합된 이전 버전을 수정하는 백포트(backport)여야만 한다.

source: Backporting procedure:
de_de: Rückportierungsprozess:
ja_jp: バックポーティングの方法
ko_kr: 이전 버전을 수정하는 백포트 과정:

source: When backporting a patch from master to stable, we want to keep a reference to the change on master. When you create the branch for the stable PR, use::
de_de: Bei der Rückportierung einer Änderung vom Master in den Stable Branch, wollen wir eine Referenz zur Änderung im Master Branch behalten. Beim Erstellen des Branches für den Pull-Request verwendet man::
ja_jp: マスターから安定ブランチへパッチをバックポーティングする際には、マスター上の変更の参照を保持します。 安定したプルリクエスト(PR) のブランチを作成する場合、以下を使用して下さい:
ko_kr: 마스터 브랜치에서 안정된 브랜치로 패치하는 백포트를 할 때, 마스터 브랜치에 변경에 대한 참조를 유지하길 원한다. 안정된 브랜치에 풀 리퀘스트를 만드는 경우 다음 명령어를 사용하기 바란다.

source: However, this only works for small self-contained patches from master. If you need to backport a subset of a larger commit (from a squashed PR, for example) from master, do this manually. In these cases, add::
de_de: Das funktioniert jedoch nur für kleine, in sich geschlossene Änderungen vom Master Branch. Wenn man einen Teil eines grösseren Commits (wie bspw. eines zusammengefassten Pull-Requests) rückportieren möchte vom Master, macht man dies manuell. In solchen Fällen fügt man dies hinzu::
ja_jp: ただし、これはマスターからの小さな自己完結型パッチのみに対応しています。 マスターから、より大きなコミットのサブセット (例えば、squashされた PRなど) をバックポートする必要がある場合は、手動で行います。 このような場合には、以下を追加します:
