Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: de_de, ja_jp, ko_kr

source: Contributing to Qiskit
de_de: An Qiskit mitwirken
ja_jp: Qiskit に貢献する
ko_kr: 키스킷에 기여하기

source: Qiskit is an open-source project committed to bringing quantum computing to people of all backgrounds. This page describes how you can join the Qiskit community in this goal.
de_de: Qiskit ist ein Open-Source-Projekt mit dem Ziel Menschen aller Alters- und Berufsgruppen die Nutzung von Quanteninformationstechnologien zu ermöglichen. Diese Seite beschreibt wie man sich der Qiskit-Gemeinschaft im Sinne dieses Ziels anschliessen kann.
ja_jp: Qiskit はどのようなバックグランドをもった人にも量子コンピューティングをもたらすことにコミットしたオープンソースプロジェクトです。このページでは、 Qiskit コミュニティーにどのように参加できるかを説明しています。
ko_kr: 키스킷은 다양한 배경지식을 가진 사람들이 양자 컴퓨팅을 사용할 수 있게 하는 오픈소스 프로젝트다. 이 페이지는 당신이 키스킷 커뮤니티에 참여할 수 있는 방법을 설명한다.

source: Where Things Are
de_de: Wo sich die Qiskit-Bestandteile befinden
ja_jp: Qiskitのコードのロケーションについて
ko_kr: 코드 저장소 목록

source: The code for Qiskit is located in the `Qiskit GitHub organization <https://github.com/Qiskit>`__, where you can find the individual projects that make up Qiskit, including
de_de: Der Quelltext von Qiskit befindet sich in dem `Qiskit-Github-Repository <https://github.com/Qiskit>`__. Dort können die einzelnen Bestandteile die Qiskit ausmachen gefunden werden. Unter anderem sind dies
ja_jp: Qiskit のコードは `Qiskit GitHub <https://github.com/Qiskit>`__ にあり、Qiskit を構成する以下の個別のプロジェクトを確認することが出来ます。
ko_kr: 키스킷의 코드는 `키스킷 깃허브 조직 <https://github.com/Qiskit>`__ 내에 있고, 키스킷을 구성하는 개별적인 프로젝트는 다음과 같다.

source: `Qiskit Tutorials <https://github.com/Qiskit/qiskit-tutorials>`__
ja_jp: `Qiskit チュートリアル <https://github.com/Qiskit/qiskit-tutorials>`__
ko_kr: `키스킷 사용 지침서 <https://github.com/Qiskit/qiskit-tutorials>`__

source: `Qiskit API Documentation <https://github.com/Qiskit/qiskit/tree/master/docs>`__
de_de: `Qiskit API-Dokumentation <https://github.com/Qiskit/qiskit/tree/master/docs>`__
ja_jp: `Qiskit API ドキュメンテーション <https://github.com/Qiskit/qiskit/tree/master/docs>`__
ko_kr: `키스킷 API 문서 <https://github.com/Qiskit/qiskit/tree/master/docs>`__

source: Getting Started
de_de: Erste Schritte
ja_jp: はじめに
ko_kr: 시작하기

source: Learn how members of the Qiskit community
de_de: Erfahren wie Mitglieder der Qiskit-Gemeinschaft
ja_jp: Qiskit コミュニティーメンバーの活動方針は以下の通りです
ko_kr: 키스킷 커뮤니티 멤버들의 활동에 도움이 되는 자료는 다음과 같다

source: `Relate to one another <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
de_de: `sich untereinander verhalten <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
ja_jp: `他者とのかかわり <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__
ko_kr: `행동 규칙 <https://github.com/Qiskit/qiskit/blob/master/CODE_OF_CONDUCT.md>`__

source: `Discuss ideas <https://qiskit.slack.com/>`__
de_de: `Ideen diskutieren <https://qiskit.slack.com/>`__
ja_jp: `アイデアの交換 <https://qiskit.slack.com/>`__
ko_kr: `아이디어 논의 <https://qiskit.slack.com/>`__

source: `Get help when we're stuck <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
de_de: `Hilfe erhalten wenn man feststeckt <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
ja_jp: `ヘルプが必要な場合 <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__
ko_kr: `어려운 문제에 직면했을 때 도움 받기 <https://quantumcomputing.stackexchange.com/questions/tagged/qiskit>`__

source: `Stay informed of news in the community <https://medium.com/qiskit>`__
de_de: `Sich über Neuigkeiten in der Gemeinschaft auf dem Laufenden halten <https://medium.com/qiskit>`__
ja_jp: `コミュニティーの最新情報を受け取る <https://medium.com/qiskit>`__
ko_kr: `커뮤니티 관련 뉴스 보기 <https://medium.com/qiskit>`__

source: `Keep a consistent style <https://www.python.org/dev/peps/pep-0008>`__
de_de: `Einen einheitlichen Stil bewahren <https://www.python.org/dev/peps/pep-0008>`__
ja_jp: `スタイル方針 <https://www.python.org/dev/peps/pep-0008>`__
ko_kr: `프로그래밍 스타일 일치시키기 <https://www.python.org/dev/peps/pep-0008>`__

source: :ref:`Build Qiskit packages from source <install_install_from_source_label>`
de_de: :ref:`Qiskit-Pakete aus Quelltext erzeugen <install_install_from_source_label>`
ja_jp: :ref:`ソースから QisKit パッケージをビルドする <install_install_from_source_label>`
ko_kr: :ref:`소스코드에서 키스킷 패키지 빌드하기 <install_install_from_source_label>`

source: Reporting Bugs and Requesting Enhancements
de_de: Bugs melden und Verbesserungen vorschlagen
ja_jp: バグの報告と機能強化のリクエスト
ko_kr: 버그 보고와 기능 개선 요청하기

source: When you encounter a problem, please open an issue in the appropriate element's issue tracker:
de_de: Falls ein Problem auftritt, sollte ein Issue im entsprechenden Issue-Tracker eröffnet werden:
ja_jp: 問題を発見したら、適切な要素（e.g. Terra, Aqua, Aer, Ignis）の課題管理機能 issue trackerでissueをあげてください：
ko_kr: 문제를 발견하면 해당되는 코드 저장소의 이슈 트래커에 이슈를 만든다.

source: Element
ja_jp: 要素
ko_kr: 구성요소

source: Issue Tracker
ja_jp: 課題管理
ko_kr: 이슈 트래커

source: Docs or Qiskit Meta-package
de_de: Dokumente oder Qiskit Meta-Package
ja_jp: ドキュメントまたはQiskitメタパッケージ
ko_kr: 문서나 키스킷 메타-패키지

source: If you have an idea for a new feature, please open an **Enhancement** issue in the appropriate element's issue tracker. Opening an issue starts a discussion with the team about your idea, how it fits in with the project, how it can be implemented, etc.
de_de: Falls man eine Idee für ein neues Feature hat, sollte ein **Enhancement** Issue im entsprechenden Issue Tracker eröffnet werden. Wenn ein neues Issue eröffnet wird, dann wird eine Diskussion gestartet um zu erörtern in wiefern die Idee in das Projekt passt, wie sie implementiert werden kann, etc.
ja_jp: 新しい機能のアイデアがある場合は、該当する要素の課題管理機能 issue trackerで **Enhancement** issue を開いてください。 issue を開くと、チームとあなたのアイデア、プロジェクトとの適合性、実装方法などに関する議論が始まります。
ko_kr: 새로운 기능에 대한 아이디어가 있다면, 해당되는 코드 저장소의 이슈 트래커에 **개선(Enhancement)** 이슈를 등록한다. 이슈를 등록하는 것은 아이디어가 어떻게 프로젝트에 적합하고, 그것이 어떻게 구현될 수 있는지에 대해서 대해 팀과 논의를 시작한다.

source: Contributing Code
de_de: Code Beisteuern
ja_jp: コードの貢献
ko_kr: 코드에 기여하기

source: Style Guide
ja_jp: スタイルガイド
ko_kr: 스타일 가이드

source: To enforce a consistent code style in the project, we use `Pylint <https://www.pylint.org>`__ and `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ to verify that code contributions conform to and respect the project's style guide. To verify that your changes conform to the style guide, run: ``tox -elint``
de_de: Um einen konsistenten Code-Stil in dem Projekt sicherzustellen werden `Pylint <https://www.pylint.org>`__ und `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ verwendet um zu überprüfen ob Code-Beiträge konform sind und den Styleguide respektieren. Um zu überprüfen ob Änderungen mit dem Styleguide konform sind, den folgenden Befehl ausführen: ``tox -elint``
ja_jp: プロジェクト内のコーディング・スタイルの統一を図るため、`Pylint <https://www.pylint.org>`__ と `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ を使用して、コードへの貢献がプロジェクトのスタイルガイドに準拠していることを確認しています。ご自身の変更がスタイルガイドを遵守しているか確認するには、``tox -elint`` を実行してください。
ko_kr: 프로젝트에서 일관된 코드 스타일을 유지하기 위해서 `Pylint <https://www.pylint.org>`__ 와 `pycodesytle <https://pycodestyle.readthedocs.io/en/latest/>`__ 를 사용하여 기여된 코드가 프로젝트의 코드 스타일 가이드에 일치하는지 확인한다. 본인의 코드 변경이 스타일 가이드에 부합되는지 확인하기 위해서 ``tox -elint``를 실행한다.

source: Contributor License Agreement
de_de: Mitwirkenden-Lizenzvereinbarung
ja_jp: Contributor License Agreement (CLA、貢献者ライセンス同意書)
ko_kr: 기여자 라이센스 계약서

source: Before you can submit any code, all contributors must sign a contributor license agreement (CLA). By signing a CLA, you're attesting that you are the author of the contribution, and that you're freely contributing it under the terms of the Apache-2.0 license.
de_de: Bevor neuer Code beigesteuert werden kann müssen alle Mitwirkenden die Mitwirkenden-Lizenzvereinbarung CLA (contributor license agreement) unterscheiben. Mit dem Unterzeichnen der CLA bestätigt man, dass man Autor des Code-Beitrags ist, und dass man diesen unentgeltlich entsprechend der Apache-2.0 Lizenz beisteuert.
ja_jp: 実際にコードを提出する前に、貢献者はCLA (貢献者ライセンス同意書) への同意が必要です。CLAに同意することで、貢献内容の著作者であることを証明し、Apache-2.0 ライセンスの規約の下で貢献していることを意味します。
ko_kr: 코드를 제출할 수 있기 전에 모든 코드 기여자는 기여자 라이센스 계약서(CLA)에 서명해야만 한다. 기여자 라이센스 계약서에 서명함으로써 본인이 기여 코드의 작성자이며, 아파치-2.0 라이센스의 조건 하에서 자유롭게 기여를 함을 인증한다.

source: When you contribute to the Qiskit project with a new pull request, a bot will evaluate whether you have signed the CLA. If required, the bot will comment on the pull request, including a link to accept the agreement. The `individual CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ document is available for review as a PDF.
de_de: Wenn man an einem Qiskit-Projekt mit einem Pull-Request mitwirkt prüft ein Bot ob die CLA unterzeichnet wurde. Falls nötig wird der Bot den Pull-Request kommentieren - inklusive eines Links zum Akzeptieren der Vereinbarung. Die `CLA für natürliche Personen <https://qiskit.org/license/qiskit-cla.pdf>`__ ist zur Überprüfung als PDF-Datei verfügbar.
ja_jp: Qiskit プロジェクトへのプルリクエストを行う際、リクエストを挙げた人がCLAに同意済みか否かをbotが判定します。同意済みではない場合は、botが同意書へのリンクとともに対応を促すコメントを返しますので対応をお願いします。 `CLA <https://qiskit.org/license/qiskit-cla.pdf>`__ の内容はPDF形式で参照可能です。
ko_kr: 키스킷 프로젝트에 새로운 풀 리퀘스트를 기여할 때, 로봇이 기여자 사용 계약서에 서명을 했는지 자동으로 확인한다. 서명이 필요한 경우, 로봇은 풀 리퀘스트에 계약서를 수용하는 링크를 포함한 주석을 자동으로 생성한다. `개인 기여자 사용 계약서 <https://qiskit.org/license/qiskit-cla.pdf>`__ 문서는 PDF로 확인할 수 있다.

source: If your contribution is part of your employment or your contribution is the property of your employer, then you will more than likely need to sign a `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ too and email it to us at <qiskit@us.ibm.com>.
de_de: Falls ein Beitrag einem Beschäftigungsverhältnis entstammt oder Eigentum des Arbeitgebers ist, ist es sehr wahrscheinlich, daß eine `CLA für Unternehmen <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ unterzeichnet werden muss, und per E-Mail an <qiskit@us.ibm.com> geschickt werden muss.
ja_jp: あなたの貢献が業務の一環、または雇用主の所有物として位置づけられる場合は、 `corporate CLA <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ に署名をいただいて <qiskit@us.ibm.com>まで送っていただく必要があります。
ko_kr: 당신의 기여가 고용된 작업의 일부이거나, 고용자의 자산이라면, `기업 기여자 사용 계약서 <https://qiskit.org/license/qiskit-corporate-cla.pdf>`__ 에도 서명하고, <qiskit@us.ibm.com>에 이메일로 송부 할 필요가 있을 것이다.

source: Pull Requests
ja_jp: プルリクエスト
ko_kr: 풀 리퀘스트

source: We use `GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ to accept contributions.
de_de: Wir verwenden `GitHub Pull-Requests <https://help.github.com/articles/about-pull-requests>`__ um Beiträge zu akzeptieren.
ja_jp: コードへの貢献をアクセプトするため、`GitHub pull requests <https://help.github.com/articles/about-pull-requests>`__ を使用しています。
ko_kr: `깃허브 풀 리퀘스트 <https://help.github.com/articles/about-pull-requests>`__ 를 사용하여 당신의 기여를 수락할 수 있다.

source: While not required, opening a new issue about the bug you're fixing or the feature you're working on before you open a pull request is an important step in starting a discussion with the community about your work. The issue gives us a place to talk about the idea and how we can work together to implement it in the code. It also lets the community know what you're working on, and if you need help, you can reference the issue when discussing it with other community and team members.
de_de: Obwohl nicht zwingend benötigt sollte ein Issue bzgl. dem Bug oder dem Feature an welchem man arbeitet vor dem Pull Request geöffnet werden. Dies ist ein wichtiger Schritt um die Diksussion mit der Community bzgl. der Änderungen zu beginnen. Mit einem Issue wird es ermöglicht die Idee zu besprechen und zu erörtern wie entsprechender Code implementiert werden muss. Des Weiteren kann so die Community erfahren an was man gerade arbeitet, ob Hilfe benötigt wird, und zusätzlich kann man auf das Issue in Diskussionen referenzieren.
ja_jp: 必須ではありませんが、プルリクエストを作成する前に修正中のバグや作業中の機能に関する新しいissueを作成することは、あなたの作業についてコミュニティと議論を始めるための重要なステップです。 このissueは、アイデアやコードでそれを実装するためにどのように協力できるかについて話す場を提供します。 また、コミュニティはあなたが取り組んでいるものを知ることができ、助けが必要な場合は、他のコミュニティやチームメンバーと議論するときにissueを参照できます。
ko_kr: 꼭 필요한 사항은 아니지만 풀 리퀘스트를 제출하기 전에 본인이 수정 중인 버그나 개발 중인 기능에 대한 새로운 이슈를 만드는 것은 커뮤니티에서 논의를 시작하는 중요한 과정이다. 이슈는 아이디어와 어떻게 코드에서 함께 구현을 할 수 있을지에 대해 논의하는 공간을 제공한다. 더불어 본인이 하는 일을 커뮤니티가 알 수 있게 하고, 도움이 필요한 경우에 다른 커뮤니티와 팀 멤버들이 이슈를 참고 할 수 있다.

source: If you've written some code but need help finishing it, want to get initial feedback on it prior to finishing it, or want to share it and discuss prior to finishing the implementation, you can open a *Work in Progress* pull request. When you create the pull request, prepend the title with the **\[WIP\]** tag (for Work In Progress). This will indicate to reviewers that the code in the PR isn't in its final state and will change. It also means that we will not merge the commit until it is finished. You or a reviewer can remove the [WIP] tag when the code is ready to be fully reviewed for merging.
de_de: Falls Code geschrieben wurde und man Hilfe benötigt diesen fertig zu stellen, man Feedback vor der Fertigstellung erwünscht, oder den Code vor der Fertigstellung diskutieren möchte, so kann man einen "Work In Progress" Pull Request eröffnen. Wenn man einen Pull Request erstellt muss dem Titel der Tag **\[WIP\]** (Work In Progress) vorangestellt werden. Dies gibt an, dass der Code im Pull Request nicht final ist und sich ändern wird. Des Weiteren wird der entsprechende Commit nicht übernommen ("merged") bis die Änderung final ist. Der [WIP] Tag kann von einem selbst oder einem Reviewer entfernt werden sobald der Code fertig ist und die Änderung übernommen werden kann ("merged").
ja_jp: 書いているコードを完成させるために助けが必要だったり、完成前に初期的なフィードバックが欲しかったり、実装完了前に共有して議論したい場合、*Work in Progress* プルリクエストを作成することができます。プルリクエストを作成する時、**\[WIP\]** タグ (Work in Progressの意) をタイトルの先頭につけて下さい。これはレビューワーに対して、このPR (プルリクエスト) が最終状態ではなく、変更の可能性があることを明示します。また、完成するまでコミットがマージされないことも意味します。コードがマージ用にレビューされる準備ができた時、自分自身もしくはレビューワーが[WIP] タグを削除できます。
ko_kr: 코드를 작성했지만, 마무리하는데 도움이 필요하거나, 마무리 하기 전에 초기 피드백을 받길 원하거나, 구현을 마치기 전에 공유하고, 논의하기 원하는 경우에 *진행 중(Work in Progress)* 풀 리퀘스트를 제출할 수 있다. 풀 리퀘스트를 제출할 때, 제목 앞에 **\[WIP\]** (진행중을 의미) 태그를 추가한다. 이는 검토자에게 풀 리퀘스트에 포함된 코드는 최종 상태가 아니며, 변경될 것임을 알려준다. 또한 최종 마무리 전에는 커미트(commit) 를 병합하지 않을 것임을 의미한다. 본인 혹은 검토자는 병합을 위해서 완전히 검토될 준비가 된 경우에는 [WIP] 태그를 제거할 수 있다.

source: Code Review
ja_jp: コードレビュー
ko_kr: 코드 검토

source: Code review is done in the open and is open to anyone. While only maintainers have access to merge commits, community feedback on pull requests is extremely valuable. It is also a good mechanism to learn about the code base. You can view a list of all open pull requests here:
de_de: Eine Code Review ist öffentlich und kann von jedem ausgeführt werden. Nur "Maintainer" haben Zugriff zu "Merge Commits", jedoch ist das Feedback der Community zu Pull Requests sehr nützlich. Es hilft zusätzlich mehr über den Code zu lernen. Die Liste aller offenen Pull Requests findet sich hier:
ja_jp: コードレビューはオープンになされ、誰でも見ることができます。メンテナーだけがコミットをマージするアクセス権を持ちますが、プルリクエストへのコミュニティのフィードバックは本当に貴重です。また、コードベースについて学ぶ良い仕組みでもあります。オープン状態のプルリクエストのリストは以下から見ることができます:
ko_kr: 코드 검토는 공개적으로 이루어지고, 누구나 확인 가능하다. 오직 관리자들만 커미트를 병합할 수 있는 권한이 있지만, 풀 리퀘스트에 대한 커뮤니티 피드백은 극히 중요하다. 이는 전체 코드에 대해 배우는 좋은 방법이기도 하다. 현재 진행 중인 모든 풀 리퀘스트는 다음에서 확인할 수 있다.

source: Commit Messages
de_de: Commit-Nachrichten
ja_jp: コミットメッセージ
ko_kr: 커미트 메시지

source: The content of the commit message describing a change is just as important as the change itself. The commit message provides the context for not only code review but also the change history in the git log. A detailed commit message will make it easier for your code to be reviewed, and will also provide context to the change when someone looks at it in the future. When writing a commit message, remember these important details:
de_de: Der Inhalt einer Commit-Nachricht beschreibt die Änderung und ist genauso wichtig wie die Änderung selbst. Die Commit-Nachricht liefert den Kontext nicht nur für den Code Review jedoch auch für die Historie der Änderungen ("Change History") im Git Log. Eine detaillierte Commit-Nachricht erleichtert den Code Review und liefert den Kontext falls jemand die Änderung in der Zukunft nachvollziehen möchte. Für eine Commit-Nachricht sollten folgende Dinge beachtet werden:
ja_jp: 変更を説明するコミットメッセージの内容は、変更自体と同じくらい重要です。 コミットメッセージは、コードレビューだけでなく、gitログの変更履歴の前後関係も提供します。 詳細なコミットメッセージによって、コードのレビューが容易になり、将来誰かが変更を確認したときに変更の背景も分かります。 コミットメッセージを書くときは、次の重要な詳細を覚えておいてください。
ko_kr: 변경 사항을 설명하는 커미트 메시지의 내용은 변경 자체 만큼이나 중요하다. 커미트 메시지는 코드 검토 뿐만 아니라 깃 로그의 변경 기록에 대한 맥락을 제공한다. 자세한 커미트 메시지는 코드 검토를 쉽게 하고, 향후에 누군가가 변경된 코드를 확인하는 경우에 맥락을 제공하는 역할도 한다. 커미트 메시지를 작성할 때, 다음 중요한 사항을 기억하면 도움이 될 것이다.

source: Do not assume the reviewer understands what the original problem was.
de_de: Man sollte nicht annehmen, dass der Reviewer versteht, was das ursprüngliche Problem war.
ja_jp: レビュアーがオリジナルの課題をきちんと理解していると思い込まないでください。
ko_kr: 검토자가 원래 문제가 무엇인지 이해할 것이라고 가정하지 않는다.

source: When reading an issue, after a number of back & forth comments, it is often clear what the root cause problem is. The commit message should have a clear statement as to what the original problem is. The bug is merely interesting historical background on *how* the problem was identified. It should be possible to review a proposed patch for correctness from the commit message, without needing to read the bug ticket.
de_de: Wenn man ein Issue und eine Reihe von Kommentaren liest ist die Ursache des Problems in der Regel schnell klar. Die Commit-Nachricht sollte klarstellen was das ursprüngliche Problem ist. Im Falle eines Bugs ist es prinzipiell wichtig zu wissen *wie* das Problem festgestellt wurde. Es sollte mittels der Commit-Nachricht möglich sein einen Patch auf Korrektheit zu überprüfen ohne vorher das Bug Ticket zu lesen.
ja_jp: 多くの前後のコメントの後にissueを読むと、しばしば根本的な原因の問題が何か明確になります。 コミットメッセージには、元の問題が何であるかを明確に記載する必要があります。 バグは、問題の特定方法に関する興味深い歴史的背景にすぎません。 バグチケットを読む必要なく、コミットメッセージから提案されたパッチの正確性をレビューすることが可能であるべきです。
ko_kr: 이슈와 그에 해당하는 몇 개의 코멘트를 읽어 본 후에는 대체로 근본적인 문제가 무엇인지 알게된다. 커미트 메시지는 원래 문제가 무엇인지 정확히 서술해야 한다. 버그는 단지 *어떻게* 문제가 인식이 되었는지에 대한 흥미로운 배경 설명에 불과하다. 버그 티켓을 읽을 필요 없이 커미트 메시지를 통해서 제안된 패치의 정확성 여부를 검토할 수 있어야 한다.

source: Do not assume the code is self-evident/self-documenting.
de_de: Man sollte nicht annehmen der Code sei selbsterklärend.
ja_jp: コードが自明/自己文書化されていると想定しないでください。
ko_kr: 코드 자체가 자명하거나 자체로 문서화되었다고 가정하지 않는다.

source: What is self-evident to one person, might not be clear to another person. Always document what the original problem was and how it is being fixed, for any change except the most obvious typos, or whitespace-only commits.
de_de: Was für eine Person selbsterklärend ist, ist möglicherweise nicht verständlich für eine andere Person. Man sollte immer dokumentieren was das ursprüngliche Problem war und wie es gelöst wird. Dies gilt für jede Änderung mit Ausnahme von offensichtlichen Tippfehlern.
ja_jp: ある人にとって自明なことは、他の人にとっては明らかではないかもしれません。 最も明白なタイプミスまたは空白のみのコミットを除くすべての変更について、元の問題が何であったか、どのように修正されているかを常に文書化します。
ko_kr: 누군가에게 자명한 것이 다른 이에게는 그렇지 않을 수 있다. 너무 뻔한 오자 정정이나 공백만을 포함하는 커미트를 제외하고는 항상 원래 문제가 무엇이었고, 어떻게 수정되었는지 문서화 한다.

source: Describe why a change is being made.
de_de: Man sollte beschreiben wieso eine Änderung vorgenommen wurde.
ja_jp: 変更を行う理由を説明してください。
ko_kr: 변경한 이유를 명확히 서술한다.

source: A common mistake is only to document how the code has been written, without describing *why* the developer chose to do it that way. Certainly, you should describe the overall code structure, particularly for large changes, but more importantly, be sure to describe the intent/motivation behind the changes.
de_de: Ein verbreiteter Fehler ist es nur zu dokumentieren wie ein Code geschrieben wurde, ohne zu erklären *warum* der Entwickler den Code so geschrieben hat. Natürlich sollte die Code-Struktur beschrieben werden; dies gilt insbesondere bei größeren Änderungen. Jedoch sollte man ebenso die Motivation für die Änderungen dokumentieren.
ja_jp: よくある間違いは、開発者がそのように選択した理由を説明せずに、コードの記述方法を文書化することだけです。 確かに、特に大規模な変更の場合は、全体的なコード構造を記述する必要がありますが、さらに重要なことは、変更の背後にある意図/動機を必ず記述してください。
ko_kr: 일반적인 실수는 개발자가 *왜* 그런식으로 변경했는지에 대한 설명 없이 코드가 작성된 방법만을 서술하는 것이다. 물론, 특히 큰 변화에 대해서는 전체적인 코드의 구조를 설명해야 하지만, 더욱 중요한 것은 변경을 한 의도와 동기를 설명하는 것이다.

source: Read the commit message to see if it hints at improved code structure.
de_de: Man sollte die Commit-Nachricht lesen um zu überprüfen ob sie eine verbesserte Code-Struktur beschreibt.
ja_jp: コミットメッセージを読んで、コード構造の改善を示唆しているかどうかを確認します。
ko_kr: 코드를 개선할 수 있는 여지가 있는지 알아보기 위해 커미트 메시지를 읽어본다.

source: Often when describing a large commit message, it becomes obvious that a commit should have been split into two or more parts. Don't be afraid to go back and rebase the change to split it up into separate pull requests.
de_de: Bei grösseren Commit-Nachrichten wird es oft deutlich, dass ein Commit in mehrere Teile aufgeteilt werden sollte. Man sollte nicht davor zurück schrecken die Änderung entsprechend anzupassen und in mehrere Pull Requests zu splitten.
ja_jp: 多くの場合、大きなコミットメッセージを記述するとき、コミットが2つ以上の部分に分割されるべきであることが明らかになります。 戻って変更をリベースし、それを個別のプルリクエストに分割することを恐れないでください。
ko_kr: 종종 큰 커미트 메시지를 설명할 때면 커미트가 두 개 이상으로 쪼개져야 했다는 것이 명확해진다. 이 경우 변경된 것을 원점에서 다시 여러 개의 풀 리퀘스트로 나누어 제출해도 된다.

source: Ensure sufficient information to decide whether to review.
de_de: Bevor man ein Review durchführt sollte sichergestellt werden, dass genügend Informationen vorliegen.
ja_jp: レビューするかどうかを決定するのに十分な情報を確保します。
ko_kr: 검토를 진행할지 여부를 결정하기 위해 충분한 정보를 확보한다.

source: When GitHub sends out email alerts for new pull request submissions, there is minimal information included - usually just the commit message and the list of files changes. Because of the high volume of patches, a commit message must contain sufficient information for potential reviewers to find the patch that they need to review.
ja_jp: Githubが新しいプルリクエストに対して送信するメールアラートには、最小限の情報しか含まれません。通常は、コミットメッセージと更新ファイルのリストだけです。 パッチの量が多いため、コミットメッセージにはレビュー担当者がレビューする必要のあるパッチを見つけるのに十分な情報が含まれている必要があります。
ko_kr: 깃허브가 새로운 풀 리퀘스트 제출에 대한 이메일 경고를 보낼 때, 커미트 메시지와 파일 변경 목록만 포함된 최소한의 정보만 포함된다. 많은 양의 패치로 인해 커미트 메시지에는 잠재적인 검토자가 검토해야하는 패치를 찾기에 충분한 정보가 포함되어 있어야 한다.

source: The first commit line is the most important.
de_de: Die erste Commit-Zeile ist die wichtigste.
ja_jp: 最初のコミット行が最も重要です。
ko_kr: 커미트의 첫 번째 문장이 가장 중요하다.

source: In Git commits, the first line of the commit message has special significance. It is used as the default pull request title, email notification subject line, git annotate messages, gitk viewer annotations, merge commit messages, and many more places where space is at a premium. As well as summarizing the change itself, it should take care to detail what part of the code is affected.
de_de: Die erste Zeile hat bei Git Commits eine besondere Bedeutung. Sie wird als Standard Pull-Request Titel, Betreff der E-Mail-Benachrichtigung, Git Annotate Nachricht, Gitk Viewer Anmerkungen, Merge Commit Nachrichten und vielen weiteren Orten verwendet, wo begrenzter Platz für Nachrichten ist. Neben einer Zusammenfassung der Änderung, sollte in ihr auch stehen, welchen Teil des Codes die Änderung betrifft.
ja_jp: Gitコミットでは、コミットメッセージの最初の行に特別な意味があります。 デフォルトのプルリクエストタイトル、電子メール通知の件名、gitアノテーションメッセージ、gitkビューアーアノテーション、マージコミットメッセージ、およびスペースが貴重なその他の多くの場所として使用されます。 変更自体を要約するだけでなく、コードのどの部分が影響を受けるかを詳細に注意する必要があります。
ko_kr: 깃 커미트에서 커미트 메시지의 첫 번째 줄은 특별한 중요성을 가진다. 즉, 풀 리퀘스트의 기본 제목, 이메일 알림 제목, 깃 주석 메시지, gitk 보기 주석, 병합(merge) 커미트 메시지 등 공간이 제한된 많은 곳에 사용된다. 코드 변경 자체만를 요약하는 것에 더하여 코드의 어떤 부분이 영향을 받는지 상세히 기술할 필요가 있다.
