Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/contributing_to_qiskit.po
Languages: de_de, ja_jp, ko_kr

source: where the elements within square brackets `[]` are optional, and ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` are to be replaced by flags of your choice. A list of *CMake* options is available here: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. For example, you could run something like:
de_de: wobei die Optionen in eckigen Klammern `[]` optional sind und ``skbuild_opts``, ``cmake_opts``, ``build_tool_opts`` durch benutzerdefinierte Konfigurationen ersetzt werden. Eine Liste für *CMake* Optionen findet man unter: https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options. Bspw. kann man folgenden Befehl verwenden:
ja_jp: ここで、角括弧`[]`内の要素はオプションで、``skbuild_opts`` と ``cmake_opts``、 ``build_tool_opts`` はあなたの選択したフラグに置き換えます。*CMake* のオプションはこちら(https://cmake.org/cmake/help/v3.6/manual/cmake.1.html#options) にあります。例えば、以下のようなコマンドを実行できます:

source: This is passing the flag `-j8` to the underlying build system (which in this case is `Automake <https://www.gnu.org/software/automake/>`__), telling it that you want to build in parallel using 8 processes.
de_de: Dadurch wird die Option `-j8` an das Build-System weitergereicht (in diesem Fall `Automake <https://www.gnu.org/software/automake/>`__), wodurch diesem mitgeteilt wird, dass man mit 8 parallelen Prozessen kompilieren möchte.
ja_jp: これは基礎となるビルド・システム(この場合 `Automake <https://www.gnu.org/software/automake/>`__ ) に `-j8` フラグを渡して、8プロセッサを使って並列にビルドしたいことを伝えています。

source: For example, a common use case for these flags on linux is to specify a specific version of the C++ compiler to use (normally if the default is too old):
de_de: Ein typischer Fall für diese Optionen ist, beispielsweise in Linux, eine spezifische Version des C++-Compilers anzugeben (meistens, wenn die Standard-Version zu alt ist):
ja_jp: 例えば、Linuxでのこれらのフラグの一般的な使用例は、使用するC++コンパイラのバージョン(通常デフォルトが古すぎる) を特定のものに指定することがあげられます:

source: which will tell CMake to use the g++-7 command instead of the default g++ when compiling Aer.
de_de: dies teilt CMake mit, den g++-7 Befehl, statt dem standardmäßigen g++ zu verwenden, wenn es Aer kompiliert.
ja_jp: ここでは、Aerをコンパイルするとき、デフォルトのg++ではなくg++-7コマンドを使うようCMakeに伝えています。

source: Another common use case for this, depending on your environment, is that you may need to specify your platform name and turn off static linking.
de_de: Ein weiterer typischer Fall ist, in bestimmten Umgebungen einen Plattform-Namen anzugeben und das statische Linken zu deaktivieren.
ja_jp: 他の一般的な使用例は、環境によって、プラットフォーム名を指定したり、静的リンクを無効にしたりする必要がある場合が考えられます。

source: Here ``--plat-name`` is a flag to setuptools, to specify the platform name to use in the package metadata, ``-DSTATIC_LINKING`` is a flag for using CMake to disable static linking, and ``-j8`` is a flag for using Automake to use 8 processes for compilation.
de_de: Hierbei ist ``--plat-name`` eine Konfiguration für setuptools, um den in den Paket-Metadaten zu verwendenden Plattform-Namen anzugeben. ``-DSTATIC_LINKING`` ist eine Konfiguration für CMake, um das statische Linken zu deaktivieren und ``-j8`` ist eine Konfiguration für Automake, um 8 Prozesse bei der Kompilierung zu verwenden.
ja_jp: ここで、``--plat-name`` はsetuptoolsのフラグでパッケージのメタデータ内で使用されるプラットフォーム名を指定します。``-DSTATIC_LINKING`` はCMakeのフラグで静的リンクを無効にするために使用されます。``-j8`` はAutomakeのフラグで、コンパイラに8プロセッサを使用するよう伝えます。

source: A list of common options depending on platform are:
de_de: Häufig genutzte Optionen aufgegliedert nach Plattform sind:
ja_jp: プラットフォームに依存する共通オプションのリストは以下の通りです。
ko_kr: 플랫폼에 따라 일반적으로 사용되는 옵션의 목록은 다음과 같다:

source: Platform
de_de: Plattform
ja_jp: プラットフォーム
ko_kr: 플랫폼

source: Tool
ja_jp: ツール
ko_kr: 도구

source: Option
ja_jp: オプション
ko_kr: 옵션

source: Use Case
de_de: Anwendungsfall
ja_jp: ユースケース
ko_kr: 활용 예시

source: All
de_de: Alle
ja_jp: 全て
ko_kr: 전체

source: Followed by a number, sets the number of processes to use for compilation.
de_de: Gefolgt von einer Zahl, setzt diese Option die Anzahl der Prozesse, die zur Kompilierung verwendet werden soll.
ja_jp: 後ろに数字が続くこのオプションは、コンパイラが使用するプロセッサの数を指定します。
ko_kr: 옵션 이후에 숫자가 뒤이어 오고, 컴파일 시 사용할 프로세서의 수를 결정한다.

source: Used to specify a specific C++ compiler; this is often needed if your default g++ is too.
de_de: Wird verwendet, um einen spezifischen C++-Compiler zu verwenden; dies wird oft gebraucht, wenn das installierte g++ zu alt ist.
ja_jp: 特定のC++コンパイラを指定するときに使用します。デフォルトがg++の時によく必要になります。
ko_kr: 특정 C++ 컴파일러를 명시하기 위해 사용된다. 이 옵션은 보통 기본 g++ 컴파일러가 너무 오래 되었을 때 사용된다.

source: Used to specify the platform name in the output Python package.
de_de: Wird verwendet, um den Plattform-Namen im resultierenden Python-Paket zu setzen.
ja_jp: 出力Pythonパッケージ内のプラットフォーム名を指定する時に使用します。
ko_kr: 결과 파이썬 패키지에 나타나는 플랫폼 이름을 명시하기 위해 사용된다.

source: Used to specify whether or not static linking should be used.
de_de: Wird verwendet um anzugeben, ob statisch gelinkt werden soll oder nicht.
ja_jp: 静的リンクを使用するか否かを指定する時に使用します。
ko_kr: 정적 연결(static linking)을 사용할지 안 사용할지 결정하는데 사용된다.

source: Some of these options are not platform-specific. These particular platforms are listed because they are commonly used in the environment. Refer to the tool documentation for more information.
de_de: Manche dieser Optionen sind nicht Plattform-spezifisch. Sie sind hier für die entsprechende Plattform aufgeführt, weil sie meistens dort genutzt werden. In der jeweiligen Dokumentation des Tools findet man bei Bedarf weitere Informationen.
ja_jp: これらのオプションの中にはプラットフォーム固有ではないものがあります。これらの特定のプラットフォームは、環境で一般的に使用されるためリストされています。 詳しくはツールの資料を参照してください。
ko_kr: 이러한 몇몇 옵션들은 플랫폼에 좌우되지 않는다. 이러한 특정 플랫폼이 여기 나열된 이유는 보통 일반적으로 사용되는 환경이기 때문이다. 더 많은 정보를 위해서는 도구 문서를 참조한다.

source: Installing Ignis from Source
de_de: Installieren von Ignis aus dem Quelltext
ja_jp: Ignisのソースコードからのインストール
ko_kr: 소스로 부터 이그니스 설치하기

source: Clone the Ignis repository.
de_de: Das Ignis Repository klonen.
ja_jp: Ignisレポジトリをクローンします。
ko_kr: 이그니스 코드 저장소를 복제.

source: Cloning the repository creates a local directory called ``qiskit-ignis``.
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-ignis``.
ja_jp: レポジトリをクローンすると、``qiskit-ignis`` という名前のローカル・フォルダが作成されます。
ko_kr: 저장소를 복제하면 ``qiskit-ignis``라는 이름의 지역 디렉토리가 생성된다.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ignis package when installing from source.
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, muss man zusätzlich die Entwicklungs-Abhängigkeiten installieren. Dies ist nicht notwendig, um das qiskit-ignis Package zu installieren oder zu nutzen, wenn vom Quelltext installiert wird.
ja_jp: テストや文法チェックを実行したい場合は、開発者要件をインストールします。ソースコードからインストール場合、qiskit-ignisパッケージをインストールおよび使用するために、これは必須ではありません。
ko_kr: 만약 테스트를 하거나 스타일 검사를 하려면, 개발자 필수 요소를 설치한다. 이것은 소스에서 키스킷-이그니스 패키지를 설치하거나 사용할 때는 필요하지 않다.

source: Install Ignis.
de_de: Ignis installieren.
ja_jp: Ignisをインストールします。
ko_kr: 이그니스 설치하기.

source: If you want to install it in editable mode, meaning that code changes to the project don't require a reinstall to be applied:
de_de: Möchte man eine Installation im editierbaren Modus vornehmen, das heisst, Code-Änderungen im Projekt benötigen keine Reinstallation:
ja_jp: 編集可能モード(プロジェクトのコードを変更しても再インストールする必要なし) でインストールする場合:
ko_kr: 수정 가능한 모드로 설치, 즉 프로젝트에 코드가 변화하였을 때 재설치가 필요하지 않는 경우:

source: Installing Aqua from Source
de_de: Installieren von Aqua aus dem Quelltext
ja_jp: Aquaのソースコードからのインストール
ko_kr: 소스로부터 아쿠아 설치하기

source: Clone the Aqua repository.
de_de: Das Aqua Repository klonen.
ja_jp: Aquaレポジトリをクローンします。
ko_kr: 아쿠아 코드 저장소를 복제.

source: Cloning the repository creates a local directory called ``qiskit-aqua``.
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-aqua``.
ja_jp: レポジトリをクローンすると、``qiskit-aqua`` という名前のローカル・フォルダが作成されます。
ko_kr: 저장소 복제는 ``qiskit-aqua``이라는 이름의 지역 디렉토리를 생성한다.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-aqua package when installing from source.
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, muss man zusätzlich die Entwicklungs-Abhängigkeiten installieren. Dies ist nicht notwendig, um das qiskit-aqua Package zu installieren oder zu nutzen, wenn vom Quelltext installiert wird.
ja_jp: テストや文法チェックを実行したい場合は、開発者要件をインストールします。ソースコードからインストール場合、qiskit-aquaパッケージをインストールおよび使用するために、これは必須ではありません。
ko_kr: 만약 테스트를 하거나 스타일 검사를 하려면, 개발자 필수 요소를 설치하라. 이는 소스로부터 설치하는 경우 qiskit-aqua 패키지를 설치하거나 사용할 필요가 없다.

source: Install Aqua.
de_de: Aqua installieren.
ja_jp: Aquaをインストールします。
ko_kr: 아쿠아 설치하기.

source: Installing IBM Quantum Provider from Source
de_de: Installieren des "IBM Quantum Providers" aus dem Quelltext
ja_jp: IBM Qプロバイダーのソースコードからのインストール
ko_kr: 소스로부터 IBM 양자 공급자 설치하기.

source: Clone the qiskit-ibmq-provider repository.
de_de: Das qiskit-ibmq-provider Repository klonen.
ja_jp: qiskit-ibmq-providerレポジトリをクローンします。
ko_kr: qiskit-ibmq-provider 코드 저장소를 복제.

source: Cloning the repository creates a local directory called ``qiskit-ibmq-provider``.
de_de: Klonen des Repository erzeugt einen lokalen Ordner namens ``qiskit-ibmq-provider``.
ja_jp: レポジトリをクローンすると、``qiskit-ibmq-provider`` という名前のローカル・フォルダが作成されます。
ko_kr: 저장소 복제는 ``qiskit-ibmq-provider``이라는 이름의 지역 디렉토리를 생성한다.

source: If you want to run tests or linting checks, install the developer requirements. This is not required to install or use the qiskit-ibmq-provider package when installing from source.
de_de: Falls Tests oder Linting-Checks durchgeführt werden sollen, muss man zusätzlich die Entwicklungs-Abhängigkeiten installieren. Dies ist nicht notwendig, um das qiskit-ibmq-provider Package zu installieren oder zu nutzen, wenn vom Quelltext installiert wird.
ja_jp: テストや文法チェックを実行したい場合は、開発者要件をインストールします。ソースコードからインストール場合、qiskit-ibmq-providerパッケージをインストールおよび使用するために必須ではありません。
ko_kr: 만약 테스트를 하거나 스타일(linting) 검사를 하려면, 개발자 필수 요소를 설치하라. 이때 소스로부터 설치하는 경우에는 qiskit-ibmq-provider 패키지를 설치하거나 사용할 필요가 없다.

source: Install qiskit-ibmq-provider.
de_de: qiskit-ibmq-provider installieren.
ja_jp: qiskit-ibmq-providerをインストールします。
ko_kr: qiskit-ibmq-provider 설치하기.

source: When Github sends out email alerts for new pull request submissions, there is minimal information included - usually just the commit message and the list of files changes. Because of the high volume of patches, a commit message must contain sufficient information for potential reviewers to find the patch that they need to review.
de_de: Wenn Github eine Email bzgl. neuen Pull Requests aussendet ist nur minimale Information enthalten - in der Regel nur die Commit-Nachricht und die Liste der Dateien die von einer Änderung betroffen sind. Wegen der hohen Anzahl an Patches muss eine Commit-Nachricht ausreichend Informationen für potentielle Reviewer enthalten.

source: To contribute to Qiskit localization, please follow these steps:
de_de: Um zu Qiskit's Lokalisierung beizutragen, sind die Schritte wie folgt:

source: Add your name (or ID) to the `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit/blob/master/docs/ LOCALIZATION_CONTRIBUTORS>`__ file.
de_de: Seinen Namen (oder seine ID) zu der Datei `LOCALIZATION_CONTRIBUTORS <https://github.com/Qiskit/qiskit/blob/master/docs/ LOCALIZATION_CONTRIBUTORS>`__ hinzufügen.

source: Create a pull request (PR) to merge your change.
de_de: Einen Pull Request (PR) erstellen um die Änderungen in den Master-Branch einfließen zu lassen.

source: If you have an open issue for a language request, please add the issue link to the PR.
de_de: Gibt es ein offenes Issue für die Sprache, fügt man den Issue-Link seinem Pull-Request hinzu.

source: As mentioned in the blog post, `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__, we want to make sure that translated languages have enough community support to build a translation team with translators, proofreaders, and translation leads. If you want to be a translation lead or would be willing to join a new translation project team, you can open a `Github issue <https://github.com/Qiskit/qiskit/issues>`__ to start a discussion with the Qiskit team and recruit translation project members.
de_de: Wie im Blogbeitrag `Qiskit in my language is Qiskit <https://medium.com/qiskit/qiskit-in-my-language-is-qiskit-73d4626a99d3>`__ beschrieben, möchten wir sicherstellen, dass eine übersetzte Sprache genug Unterstützung aus der Community hat, um ein Team aus Übersetzern, Korrekturlesern und Projektleitern zusammenzustellen. Möchte man Projektleiter einer Sprache werden oder wäre bereit, einem neuen Übersetzungsteam beizutreten, öffnet man dazu einen `Github Vorgang <https://github.com/Qiskit/qiskit/issues>`__ um eine Diskussion mit dem Qiskit Team zu starten und Mitwirkende für das Übersetzungsprojekt zu gewinnen.

source: Installing from source requires that you have a C++ compiler on your system that supports C++-11.
de_de: Das Installieren aus dem Quelltext erfordert einen C++-Compiler mit C++-11-Unterstützung.

source: `Qiskit Terra <https://github.com/Qiskit/qiskit-terra>`__
ko_kr: `키스킷 테라 <https://github.com/Qiskit/qiskit-terra>`__

source: `Qiskit Aer <https://github.com/Qiskit/qiskit-aer>`__
ko_kr: `키스킷 에어 <https://github.com/Qiskit/qiskit-aer>`__

source: `Qiskit Ignis <https://github.com/Qiskit/qiskit-ignis>`__
ko_kr: `키스킷 이그니스 <https://github.com/Qiskit/qiskit-ignis>`__

source: `Qiskit Aqua <https://github.com/Qiskit/qiskit-aqua>`__
ko_kr: `키스킷 아쿠아 <https://github.com/Qiskit/qiskit-aqua>`__

source: `Qiskit IBMQ Provider <https://github.com/Qiskit/qiskit-ibmq-provider>`__
ko_kr: `키스킷 IBMQ 공급자 <https://github.com/Qiskit/qiskit-ibmq-provider>`__

source: qiskit-terra
ko_kr: 키스킷-테라

source: :ref:`qiskit-terra <install-qiskit-terra>`
ko_kr: :ref:`키스킷-테라 <install-qiskit-terra>`

source: :ref:`qiskit-aer <install-qiskit-aer>`
ko_kr: :ref:`키스킷-아르 <install-qiskit-aqua>`

source: :ref:`qiskit-ignis <install-qiskit-ignis>`
ko_kr: :ref:`키스킷-이그니스 <install-qiskit-ignis>`

source: :ref:`qiskit-aqua <install-qiskit-aqua>`
ko_kr: :ref:`키스킷-아쿠아 <install-qiskit-aqua>`

source: Linux
ko_kr: 리눅스

source: macOS
ko_kr: 맥OS

source: Windows
ko_kr: 윈도우

source: Automake
ko_kr: 오토메이크(Automake)

source: CMake
ko_kr: 씨메이크(CMake)

source: setuptools
ko_kr: 셋업툴(setuptools)
