Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de, ja, ko_kr, tr_tr

source: Getting Started with Qiskit
de: Einführung in Qiskit
ja: Qiskit 入門
ko_kr: 키스킷 시작하기
tr_tr: Qiskit'e Başlarken

source: The workflow of using Qiskit consists of three high-level steps:
de: Der Workflow bei der Verwendung von Qiskit besteht im Wesentlichen aus 3 Schritten:
ja: Qiskit を使用する流れには大きく3つの手順があります。
ko_kr: 키스킷을 이용하는 작업흐름은 다음의 세가지 높은 수준의 단계로 이루어져있다:
tr_tr: Qiskit kullanımının işakışı üç üst düzey adım içerir:

source: **Build**: design a quantum circuit that represents the problem you are considering.
de: **Entwurf**: Erstellen eines Quantenschaltkreis, welcher das zu betrachtende Problem darstellt.
ja: **ビルド**: 検討している問題を表現する量子回路をデザインします。
ko_kr: **빌드**: 고려중인 문제를 나타내는 양자 회로의 설계.
tr_tr: **İnşa Et**: Üzerine düşündüğün problemi temsil eden bir kuantum devre tasarla.

source: **Execute**: run experiments on different backends (*which include both systems and simulators*).
de: **Ausführung**: Experimente auf verschiedenen Backends ausführen (*Simulatoren und Quantencomputer*).
ja: **実行**: 異なるバックエンド (*これにはシステムとシミュレーターの両方が含まれます*) で実験を実行します。
ko_kr: **실행**: 다양한 후위 처리 장치를 통해 실험 실행하기 (*여기에는 시스템과 시뮬레이터가 포함된다*).
tr_tr: **Çalıştır**: farklı backendler (*bilgisayarlar ve simülatörler*) üzerinde denemeler yap.

source: **Analyze**: calculate summary statistics and visualize the results of experiments.
de: **Analyse**: Berechnung zusammenfassender Statistiken und Visualisierung der Ergebnisse von Experimenten.
ja: **分析**: 要約統計量を計算し、実験の結果を可視化します。
ko_kr: **분석**: 요약한 통계를 계산하고 실험 결과를 가시화.
tr_tr: **Analiz Et**: Özet istatistikleri hesapla ve denemelerin sonuçlarını görselleştir.

source: Here is an example of the entire workflow, with each step explained in detail in subsequent sections:
de: Hier ein Beispiel des kompletten Workflows, wobei jeder Schritt einzeln im Detail erklärt ist:
ja: ワークフロー全体の例を挙げます。各手順は以下のセクションで詳しく説明します。
ko_kr: 다음 항목에서 자세한 설명과 함께 각각의 단계와 전체 작업 흐름을 보여주는 예제가 있다:
tr_tr: Burası bir sonraki bölümde detaylı her adımının anlatılacağı iş akışının örneğidir:

source: Workflow Step--by--Step
de: Workflow Schritt für Schritt
ja: ワークフローの手順
ko_kr: 순차적 작업 흐름
tr_tr: Adım Adım İşakışı

source: The program above can be broken down into six steps:
de: Das Programm von oben kann in sechs Schritte aufgeteilt werden:
ja: 上のプログラムは6つの手順に分解できます。
ko_kr: 위의 프로그램은 다음의 여섯 단계로 나누어 질 수 있다:
tr_tr: Yukarıdaki program altı adıma ayrılabilir:

source: Import packages
de: Pakete importieren
ja: パッケージのインポート
ko_kr: 패키지 가져오기
tr_tr: Paketleri Yükle

source: Initialize variables
de: Variablen definieren
ja: 変数の初期化
ko_kr: 변수 초기화
tr_tr: Değişkenlere İlk Değerlerini Ata

source: Add gates
de: Gatter hinzufügen
ja: ゲートの追加
ko_kr: 게이트 추가하기
tr_tr: Kapılar Ekle

source: Visualize the circuit
de: Schaltkreis visualisieren
ja: 回路の可視化
ko_kr: 회로 가시화하기
tr_tr: Devreyi Görselleştir

source: Simulate the experiment
de: Experiment simulieren
ja: 実験のシミュレーション
ko_kr: 실험 시뮬레이션 하기
tr_tr: Deneyi simüle Et

source: Visualize the results
de: Ergebnisse visualisieren
ja: 結果の可視化
ko_kr: 결과를 가시화하기
tr_tr: Sonuçları görselleştir

source: Step 1 : Import Packages
de: Schritt 1 : Pakete importieren
ja: 手順1 : パッケージのインポート
ko_kr: 1단계: 패키지 가져오기
tr_tr: Adım 1: Paketleri Yükle

source: The basic elements needed for your program are imported as follows:
de: So werden die Grundbausteine für das Programm importiert:
ja: プログラムに必要な基本的要素は以下のようにインポートされます。
ko_kr: 프로그램에 필요한 기본적인 요소들은 다음과 같이 가져올 수 있다:
tr_tr: Programınız için gerekli olan temel elementler takip eden şekilde yüklenir:

source: In more detail, the imports are
de: Die Pakete im Detail, sind
ja: インポートされるものの詳細は以下の通りです。
ko_kr: 좀 더 자세하게, 가져올 패키지는
tr_tr: Daha ayrıntılı bir şekilde, yüklemeler

source: ``QuantumCircuit``: can be thought as the instructions of the quantum system. It holds all your quantum operations.
de: ``QuantumCircuit``: Der Quantenschaltkreis kann als Anweisungen im Quantensystem gesehen werden. Er beinhaltet alle Quantenoperationen.
ja: ``QuantumCircuit``: 量子コンピューターシステムにおける動作命令を示し、全ての量子演算をつかさどっています。
ko_kr: ``QuantumCircuit``: 양자 시스템의 설명서로 생각할 수 있다. 여기에는 모든 양자 연산을 포함된다.
tr_tr: ``QuantumCircuit``: Kuantum sisteminin talimatları olarak düşünülebilir. Sizin bütün kuantum operatörlerinizi taşır.

source: ``execute``: runs your circuit / experiment.
de: ``execute``: Führt den Quantenschaltkreis bzw. das Experiment aus.
ja: ``execute``: 回路や実験を実行する
ko_kr: ``execute``: 회로를 실행하고, 실험을 실행한다.
tr_tr: ``execute``: Devrenizi/Deneyinizi çalıştırır.

source: ``Aer``: handles simulator backends.
de: ``Aer``: Ist für das Simulations-Backend zuständig.
ja: ``Aer``: シミュレーターのバックエンドを管理する
ko_kr: ``아르(Aer)``: 시뮬레이터 후위 처리장치를 다룬다.
tr_tr: ``Aer``: Simülatör backendlerini tutar.

source: ``plot_histogram``: creates histograms.
de: ``plot_histogram``: Erstellt Histogramme.
ja: ``plot_histogram``: ヒストグラムを作成する
ko_kr: ``plot_histogram``: 히스토그램을 생성한다.
tr_tr: ``plot_histogram``: histogramlar oluşturur.

source: Step 2 : Initialize Variables
de: Schritt 2 : Variablen definieren
ja: 手順2：変数の初期化
ko_kr: 2단계: 변수 초기화하기
tr_tr: Adım 2: Değişkenlere İlk Değerlerini Atama

source: Consider the next line of code
de: Betrachtet man die nächste Zeile Code
ja: 次のコードを考えてみます。
ko_kr: 다음 코드를 살펴보자
tr_tr: Aşağıdaki kod satırına bakalım

source: Here, you are initializing with 2 qubits in the zero state; with 2 classical bits set to zero; and ``circuit`` is the quantum circuit.
de: Wird hier ein Quantenschaltkreis ``circuit`` definiert, bestehend aus 2 Qubits im Basiszustand 0 und 2 klassischen, auf 0 gesetzten Bits.
ja: ここでは、二つの量子ビットをゼロの状態に、二つの古典ビットをゼロに初期化し、量子回路 ``circuit`` に代入しています。
ko_kr: 여기 2개의 큐비트를 0으로 초기화하고, 2개의 고전적인 비트를 0으로 초기화 하는 경우를 생각해 보자. ``circuit``은 양자 회로를 말한다.
tr_tr: Burada sıfır halinde 2 kubit ve sıfırlanmış iki klasik bitle başlıyorsunuz; ``circuit`` ise kuantum devreniz.

source: Syntax:
ja: 構文：
ko_kr: 문법:
tr_tr: Sözdizimi:

source: Step 3 : Add Gates
de: Schritt 3 : Gatter hinzufügen
ja: 手順3：ゲートの追加
ko_kr: 3단계: 게이트를 추가하기
tr_tr: Adım 3: Kapılar Ekle

source: You can add gates (operations) to manipulate the registers of your circuit.
de: Gatter (Operationen) werden hinzugefügt, um Quantenregister des Schaltkreises zu manipulieren.
ja: ゲート(演算子) を追加することで、回路のレジスターを操作します。
ko_kr: 회로의 레지스터를 조작하기 위한 게이트 (연산) 을 추가할 수 있다.
tr_tr: Devrenizin yazmaçlarını manipüle etmek için kapılar (işlemler) ekleyebilirsiniz.

source: Consider the following three lines of code:
de: Man betrachte die nächsten drei Zeilen Code:
ja: 次の3行のコードを考えてみます。
ko_kr: 다음 세 줄의 코드를 보자:
tr_tr: Aşağıdaki üç kod satırına bakalım:

source: The gates are added to the circuit one-by-one to form the Bell state
de: Die Gatter werden einzeln nacheinander hinzugefügt um den Bell-Zustand zu repräsentieren
ja: ゲートが一つづつ回路に追加され、Bell状態が形成されます。
ko_kr: 게이트들은 벨 상태를 형성하기 위해 하나씩 회로에 추가될 수 있다
tr_tr: Mantık kapıları Bell halini oluşturmak için devreye teker teker eklenir

source: The code above applies the following gates:
de: Der Code von oben wendet diese Gatter an:
ja: 上記コードは以下のゲートが適用されています。
ko_kr: 위의 코드는 다음의 게이트들에 적용된다:
tr_tr: Yukarıdaki kod aşağıdaki kapıları uygular:

source: ``QuantumCircuit.h(0)``: A Hadamard gate :math:`H` on qubit 0, which puts it into a **superposition state**.
de: ``QuantumCircuit.h(0)``: Ein Hadamard-Gatter :math:`H` auf Qubit 0, welches das Qubit in **Superposition** überführt.
ja: ``QuantumCircuit.h(0)``: 量子ビット0に対するアダマール・ゲート :math:`H` 。量子ビット0を **重ね合わせ状態** にします。
ko_kr: ``QuantumCircuit.h(0)``: 하다마드 게이트 :math:`H` 큐비트 0에 작용해서 그것을 **중첩 상태**로 만든다.
tr_tr: ``QuantumCircuit.h(0)``: Kubit 0'a uygulanıp onu **süperpozisyon haline** sokan bir Hadamard kapısı :math:`H`.

source: ``QuantumCircuit.cx(0, 1)``: A controlled-Not operation (:math:`C_{X}`) on control qubit 0 and target qubit 1, putting the qubits in an **entangled state**.
de: ``QuantumCircuit.cx(0, 1)``: Eine Controlled-NOT Operation (:math:`C_{X}`) auf dem Kontroll-Qubit 0 und dem Ziel-Qubit 1, wodurch die beiden **verschränkt** werden.
ja: ``QuantumCircuit.cx(0, 1)``: 量子ビット0をコントロール・ビット、量子ビット1をターゲット・ビットとした制御NOTゲート(:math:`C_{X}`)。量子ビットを **量子もつれ状態** にします。
ko_kr: ``QuantumCircuit.cx(0, 1)``: 제어된 부정 연산 (:math:`C_{X}`) 제어 큐비트 0, 목적 큐비트 1, 결과적으로 큐비트들을 **얽힘 상태**로 만든다.
tr_tr: ``QuantumCircuit.cx(0, 1)``: Kontrol kubit 0 ve hedef kubit 1 üzerine uygulanıp onları **dolaşık hale** sokan bir kontrollü değil operasyonu (:math:`C_{X}`).

source: Step 4 : Visualize the Circuit
de: Schritt 4 : Schaltkreis visualisieren
ja: 手順４：回路の可視化
ko_kr: 4단계: 회로 시각화하기
tr_tr: Adım 4: Devreyi Görselleştir

source: You can use ``QuantumCircuit.draw()`` to view the circuit that you have designed in the `various forms <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ used in many textbooks and research articles.
de: Um den erstellten Quantenschaltkreis zu visualisieren, verwendet man ``QuantumCircuit.draw()``. Dabei stehen `diverse Formate <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ zur Verfügung, welche auch in verschiedenen Lehrbüchern und Forschungsartikeln verwendet werden.
ja: ``QuantumCircuit.draw()`` を使って、作成した回路を可視化することができます。いろいろな教科書や研究論文で使われている `様々な形式 <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`__ を利用することができます。
ko_kr: 다음 명령어 ``QuantumCircuit.draw()``를 통해 당신이 디자인한 양자 회로들을 많은 교과서나 연구 논문에서 인용된 `다양한 포맷 <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>`으로 볼 수 있다.
tr_tr: Tasarladığınız devreyi ders kitapları ve araştırma makalelerinde kullanılan `çeşitli formlarda <api/qiskit.circuit.QuantumCircuit.html#qiskit.circuit.QuantumCircuit.draw>` görüntülemek için ``QuantumCircuit.draw()`` kullanabilirsiniz.

source: In this circuit, the qubits are ordered with qubit zero at the top and qubit one at the bottom. The circuit is read left-to-right, meaning that gates which are applied earlier in the circuit show up farther to the left.
de: In diesem Schaltkreis sind die Qubits so sortiert, dass sich Qubit 0 oben und Qubit 1 unten befindet. Der Schaltkreis wird von links nach rechts gelesen. Gatter welche früher hinzugefügt wurden, befinden sich also weiter links.
ja: この回路では、量子ビットは量子ビット0が上、量子ビット1が下に記述されています。回路は左から右に読み、左に表示されているゲートから順に適用されます。
ko_kr: 이 회로에서는 큐비트들이 0 큐비트은 위쪽에 1 큐비트은 아래쪽에 놓이도록 순서가 정해져 있다. 회로는 왼쪽에서 오른쪽으로 읽혀지는데, 이것은 가장 왼쪽의 게이트들이 회로에서 먼저 적용된다는 것을 의미한다.
tr_tr: Bu devrede kubitler, üstte kubit sıfır ve altta kubit bir olacak şekilde sıralanmıştır. Devre soldan sağa doğru okunur, yani daha önce uygulanacak kapılar devrenin daha solunda olanlardır.

source: For example, a ``settings.conf`` file for setting a Matplotlib drawer is:
de: Eine ``settings.conf``, welche den Matplotlib Drawer verwendet, sieht bspw. so aus:
ja: 例えば, Matplotlib drawer を設定するための ``settings.conf`` ファイルは：
ko_kr: 예를 들어 ``settings.conf`` 파일은 Matplotlib를 설정:
tr_tr: Örneğin, bir Matplotlib çizimcisi ayarlamaya yarayan bir ``settings.conf`` dosyası:

source: You can use any of the valid circuit drawer backends as the value for this config, this includes text, mpl, latex, and latex_source.
de: Hierbei kann man jedes gültige Schaltkreis Drawer Backend verwenden, inklusive text, mpl, latex und latex_source.
ja: このconfigには、有効な circuit drawer バックエンドであればどれでも指定することができます。これらには text, mpl, latex, そして latex_source が含まれます。
ko_kr: 이 설정의 값으로 유효한 회로 그리기 후위 처리 장치를 사용할 수 있고, 여기서 값은 text, mpl, latex, latex_source를 포함한다.
tr_tr: Bu yapılandırmanın değeri olarak, text, mpl, latex, ve latex_source dahil tüm geçerli devre çizimci backendlerini kullanabilirsiniz.

source: Step 5 : Simulate the Experiment
de: Schritt 5 : Experiment simulieren
ja: 実験のシミュレーション
ko_kr: 5단계: 실험을 시뮬레이션 하기
tr_tr: Adım 5: Deneyi Simüle Etmek

source: Qiskit Aer is a high performance simulator framework for quantum circuits. It provides `several backends <apidoc/providers/aer/aer_backends.html>`__ to achieve different simulation goals.
de: Qiskit Aer ist ein hochperformantes Simulations-Framework für Quantenschaltkreise. Es stellt `diverse Backends <apidoc/providers/aer/aer_backends.html>`__ für verschiedene Simulationszwecke zur Verfügung.
ja: Qiskit Aerは、量子回路の高パフォーマンス・シミュレーター・フレームワークです。様々なシミュレーションの目的を達成するために、`いくつかのバックエンド <apidoc/providers/aer/aer_backends.html>`__ を提供します。
ko_kr: 키스킷 아르는 양자 회로를 위한 고성능 시뮬레이터 프레임워크이다. 이는 여러 다양한 시뮬레이션 목적을 이루기 위해서 `여러 후위 처리 장치 <apidoc/providers/aer/aer_backends.html>`를 제공한다.
tr_tr: Qiskit Aer kuantum devreleri için yüksek performanslı bir simülatör frameworküdür ve farklı simülasyon hedeflerini başarıyla gerçekleştirmek için `birçok backend <apidoc/providers/aer/aer_backends.html>` sağlar.

source: If you have issues installing Aer, you can alternatively use the Basic Aer provider by replacing `Aer` with `BasicAer`. Basic Aer is included in Qiskit Terra.
de: Bei Problemen mit der Installation von Aer, kann man alternativ den Basic Aer Provider verwenden, indem man `Aer` mit `BasicAer` ersetzt. Basic Aer ist Teil von Qiskit Terra.
ko_kr: 만약 아르를 설치하는데 문제가 발생한다면, `BasicAer`를 `Aer`로 교체함으로서 기본 아르를 사용해 볼 수 있다. 기본 아르는 키스킷 테라에 포함되어 있다.
tr_tr: Aer'i yüklemekte sorun yaşıyorsanız, `Aer` yerine `BasicAer` koyarak Basic Aer sağlayıcısını kullanabilirsiniz. Basic Aer, Qiskit Terra içerisinde bulunmaktadır.

source: To simulate this circuit, you will use the ``qasm_simulator``. Each run of this circuit will yield either the bit string 00 or 11.
de: Um den Schaltkreis zu simulieren, verwendet man den ``qasm_simulator``. Jeder Durchlauf des Schaltkreises ergibt entweder den Bit-String 00 oder 11.
ja: 回路のシミュレートには、``qasm_simulator`` を使用します。回路の実行毎にビット文字列00もしくは11を生成します。
ko_kr: 이 회로를 시뮬레이션 하기 위해 ``qasm_simulator`` 명령어를 사용해 볼 수 있다. 각각의 회로 시뮬레이션 결과는 00 혹은 11의 비트 문자열을 보여줄 것이다.
tr_tr: Bu devreyi simüle etmek için ``qasm_simulator`` kullanacaksınız. Devrenin her çalışması 00 veya 11 bit dizilerinden biriyle sonuçlanacaktır.

source: As expected, the output bit string is 00 approximately 50 percent of the time. The number of times the circuit is run can be specified via the ``shots`` argument of the ``execute`` method. The number of shots of the simulation was set to be 1000 (the default is 1024).
de: Wie erwartet, ist bei ca. 50% der Durchläufe 00 das Ergebnis. Wie oft der Schaltkreis durchläuft, wird über das Argument ``shots`` der Methode ``execute`` definiert. Die Anzahl der Durchläufe dieser Simulation wurde auf 1000 gesetzt (der Standard ist 1024).
ja: 期待通りにビット文字列の出力が00になるのはおおよそ50％です。回路の実行回数は ``execute`` メソッドの ``shots`` 引数で指定できます。このシミュレーションの実行回数は1000(デフォルトは1024) に設定されています。
ko_kr: 예상할 수 있듯이 출력 비트 문자열은 대략 50 퍼센트의 확율로 00일 것이다. 회로가 몇 번 실행될 것인가는 ``execute`` 함수에 ``shots`` 전달인자를 어떻게 정하느냐에 따라 달라진다. 시뮬레이션을 몇 번 실행할 것인지는 1000번으로 설정되었다 (기본값은 1024번이다).
tr_tr: Beklendiği gibi çıktılarının yaklaşık yarısı 00 bit dizisinden oluşuyor. Devrenin kaç kere çalıştırılacağı ``execute`` metodunun ``shots`` argümanı aracılığıyla belirlenebilir. Simülasyonun deneme sayısı 1000 olarak belirlenmişti (varsayılan 1024).

source: Step 6 : Visualize the Results
ja: ステップ6：結果の可視化
ko_kr: 6단계: 결과 시각화하기
tr_tr: Adım 6: Sonuçları Görselleştirin

source: Qiskit provides `many visualizations <apidoc/visualization.html>`__,
ko_kr: 키스킷은 많은 `시각화 방법<apidoc/visualization.html>`__을 제공한다.
tr_tr: Qiskit `birçok görselleştirme <apidoc/visualization.html>`__ sağlar,

source: The observed probabilities :math:`Pr(00)` and :math:`Pr(11)` are computed by taking the respective counts and dividing by the total number of shots.
ja: 観測された確率 :math:`Pr(00)` と :math:`Pr(11)` は、対応する事象が観測された回数を全実行回数で割った数値です。
ko_kr: 관찰 확률 :math:`Pr(00)` 과 :math:`Pr(11)` 은 상대적으로 나타난 각각의 경우의 수를 전체 시뮬레이션 횟수로 나누어 계산된다.
tr_tr: Gözlemlenen :math:`Pr(00)` ve :math:`Pr(11)` olasılıkları, durumların gözlemlenme miktarlarının toplam deneme miktarına bölünmesiyle hesaplanır.

source: Try changing the ``shots`` keyword in the ``execute`` method to see how the estimated probabilities change.
ja: ``execute`` メソッドの ``shots`` 引数を変更して、推定される確率がどのように変化するか見てみましょう。
ko_kr: ``execute`` 함수의 ``shots`` 전달 인자를 바꿔서 입력해 보고 각각의 경우에 따라 예상되는 확률이 어떻게 변하는 지를 확인해 보라.
tr_tr: Tahmini olasılıkların nasıl değiştiği görmek için ``execute`` metodu içerisindeki ``shots`` anahtar sözcüğünü değiştirmeyi deneyin.

source: Next Steps
ja: 次の手順
tr_tr: Sonraki Adımlar

source: Now that you have learnt the basics, consider these learning resources:
ja: 基礎の学習が終わりました。ここから先は、以下の学習リソースでの継続的な学習をおすすめします。
tr_tr: Şimdi temel noktaları öğrendiğinize göre şu öğretici kaynakları değerlendirin:

source: `About the Qiskit framework <the_elements.html>`__
tr_tr: `Qiskit frameworkü hakkında <the_elements.html>`__

source: `Qiskit documentation <apidoc/qiskit.html>`__
tr_tr: `Qiskit dökümantasyonu <apidoc/qiskit.html>`__

source: `Qiskit tutorials <https://nbviewer.jupyter.org/github/Qiskit/qiskit-tutorials/blob/master/qiskit/1_start_here.ipynb>`__
tr_tr: `Qiskit başlangıç eğitimleri <https://nbviewer.jupyter.org/github/Qiskit/qiskit-tutorials/blob/master/qiskit/1_start_here.ipynb>`__

source: `Textbook: Learn Quantum Computing using Qiskit <https://community.qiskit.org/textbook/preface>`__
tr_tr: `Ders Kitabı: Learn Quantum Computing using Qiskit <https://community.qiskit.org/textbook/preface>`__

source: `Video series: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__
tr_tr: `Video serileri: Coding with Qiskit <https://www.youtube.com/playlist?list=PLOFEBzvs-Vvp2xg9-POLJhQwtVktlYGbY>`__

source: ``QuantumCircuit.measure([0,1], [0,1])``: if you pass the entire quantum and classical registers to ``measure``, the ith qubit’s measurement result will be stored in the ith classical bit.
de: ``QuantumCircuit.measure([0,1], [0,1])``: Werden die Quanten- und klassischen Register als Ganzes an ``measure`` übergeben, wird das Messergebnis des x-ten Qubits im x-ten klassischen Bit gespeichert.
ja: ``QuantumCircuit.measure([0,1], [0,1])``: 全ての量子レジスターと古典レジスターを ``measure`` に送ると、i番目の量子ビットの結果がi番目の古典ビットに保存されます。
ko_kr: ``QuantumCircuit.measure([0,1], [0,1])``: 만약 전체 양자 및 고전 레지스터를 ``측정``한다면, i 번째 큐비트의 측정 결과는 i 번째 고전 비트에 저장될 것이다.

source: The default backend for ``QuantumCircuit.draw()`` or ``qiskit.visualization.circuit_drawer()`` is the text backend. However, depending on your local environment you may want to change these defaults to something better suited for your use case. This is done with the user config file. By default the user config file should be located in ``~/.qiskit/settings.conf`` and is a ``.ini`` file.
de: Das Standard-Backend für ``QuantumCircuit.draw()`` oder ``qiskit.visualization.circuit_drawer()`` ist das Text-Backend. Dies kann man, abhängig von der lokalen Entwicklungsumgebung, nach Belieben konfigurieren. Die Konfigurationsdatei dafür befindet sich normalerweise in ``~/.qiskit/settings.config``. Dies ist eine ``.ini``-Datei.
ko_kr: ``QuantumCircuit.draw()`` 이나 ``qiskit.visualization.circuit_drawer()`` 에 사용되는 기본 후위 처리 장치는 문자 후위 처리 장치이다. 그러나 사용되어지는 지역 환경에 따라서, 당신은 필요에 맞는 좀 더 적절한 후위 처리 장치를 기본으로 설정할 수 있다. 이러한 설정은 사용자 환경 파일에서 변경될 수 있는데, 기본으로 사용자 설정 파일은 ``~/.qiskit/settings.conf`` 디렉토리에 저장되어 있고 ``.ini`` 를 확장자로 가진 파일들이다.

source: Once you have a ``result`` object, you can access the counts via the method ``get_counts(circuit)``. This gives you the aggregate outcomes of the experiment you ran.
ja: ``result`` オブジェクトを取得できたら、``get_counts(circuit)`` メソッドを使用して回数を取得することができます。これにより、実行した実験の総計を得ることができます。
ko_kr: ``result`` 객체를 얻은 후에는 이러한 시뮬레이션 횟수를 ``get_counts(circuit)`` 함수를 통해 접근할 수 있다. 이를 통해서 지금까지 실행했던 시뮬레이션의 결과들을 모두 합친 값을 제공한다.

source: including the function ``plot_histogram``, to view your results.
ja: その中には結果を表示するための ``plot_histogram`` という関数も含まれます。
ko_kr: 이는 결과를 보여주기 위한 ``plot_histogram`` 함수를 포함한다.
