Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es_es, ja_jp, ko_kr

source: Circuits
ja_jp: 回路
ko_kr: 회로

source: Advanced Circuits
ja_jp: 高度な回路
ko_kr: 고급 회로

source: High-Performance Simulators
ja_jp: ハイパフォーマンス・シミュレーター
ko_kr: 고성능 시뮬레이터

source: Quantum System Error Analysis
ja_jp: 量子システムエラー解析
ko_kr: 양자 시스템 오류 분석

source: Optimization
ja_jp: 最適化
ko_kr: 최적화

source: Tutorials
ja_jp: チュートリアル
ko_kr: 사용 지침서

source: Circuit Library
ja_jp: サーキット・ライブラリ
ko_kr: 회로 라이브러리

source: Libraries
ja_jp: ライブラリ
ko_kr: 라이브러리

source: Qiskit Terra
ko_kr: 키스킷 테라

source: Qiskit Aer
ko_kr: 키스킷 아르

source: Qiskit Ignis
ko_kr: 키스킷 이그니스

source: Qiskit Aqua
ko_kr: 키스킷 아쿠아

source: Qiskit IBM Quantum Provider
ja_jp: Qiskit IBM Quantum プロバイダー
ko_kr: 아이비엠 양자 시스템 공급자

source: API References
es_es: Referencia de la API
ja_jp: API リファレンス
ko_kr: 응용 프로그램 인터페이스(API) 참조 문서

source: Quantum Experience API error codes
ja_jp: Quantum Experience API エラーコード一覧
ko_kr: 양자 경험 API 에러 코드

source: Troubleshooting
ja_jp: トラブルシューティング
ko_kr: 문제 해결

source: Qiskit documentation
ja_jp: Qiskit ドキュメンテーション
ko_kr: 키스킷 문서

source: Qiskit is an open-source framework for working with quantum computers at the level of circuits, pulses, and algorithms.
es_es: Qiskit es un marco de trabajo de código abierto para trabajar con ordenadores cuánticos a nivel de circuitos, pulsos y algoritmos.
ja_jp: Qiskit はパルス、回路、アルゴリズムの各レベルで量子コンピューターを扱うためのオープンソース・フレームワークです。
ko_kr: 키스킷은 양자 컴퓨터를 회로, 펄스 및 알고리즘 단위에서 조작하고 관찰하기 위한 오픈 소스 프레임 워크이다.

source: A central goal of Qiskit is to build a software stack that makes it easy for anyone to use quantum computers. However, Qiskit also aims to facilitate research on the most important open issues facing quantum computation today.
es_es: Uno de los objetivos principales de Qiskit es construir un paquete software que facilite que cualquier persona pueda usar un ordenador cuántico. Sin embargo, Qiskit también tiene como objetivo facilitar la investigación de los principales asuntos sin resolver a los que se enfrenta la computación cuántica hoy en día.
ja_jp: Qiskit の主要なゴールは、ソフトウェア・スタックの構築して、誰もが簡単に量子コンピューターを使用できるようにすることです。Qiskit にはまた、今日の量子コンピューティングが直面する、もっとも重要な未解決課題の研究を促進する目的もあります。
ko_kr: 키스킷의 주된 목적은 양자 컴퓨터를 사용하는 어느 누구나 쉽게 사용할 수 있는 소프트웨어 스택을 만드는 것이다. 그러나 키스킷은 오늘날 양자 컴퓨터가 마주하는 가장 중요한 공개적인 이슈들에 대해 연구를 증진시키기 위한 목적도 가지고 있다.

source: You can use Qiskit to easily design experiments and run them on simulators and real quantum computers.
es_es: Puedes usar Qiskit para diseñar experimentos y ejecutarlos en simulaciones y ordenadores cuánticos reales con facilidad.
ja_jp: Qiskit を使用して簡単に実験をデザインし、シミュレーターや本物の量子コンピューターの上で実行することができます。
ko_kr: 키스킷을 사용해서 손쉽게 양자 컴퓨터의 실험은 디자인하고 시뮬레이터로 실행해 보고 또한 실제 양자 컴퓨터에 적용해 볼 수도 있다.

source: Qiskit consists of four foundational elements:
es_es: Qiskit está formado por cuatro elementos fundamentales:
ja_jp: Qiskitは4つの基本的な要素から構成されます。
ko_kr: 키스킷은 네 가지 기본 구성요소로 되어 있다.

source: :ref:`Qiskit Terra <Terra>`: Composing quantum programs at the level of circuits and pulses with the code foundation.
es_es: :ref:`Qiskit Terra <Terra>`: Creando programas cuánticos a nivel de circuitos y pulsos con la base del código.
ja_jp: :ref:`Qiskit Terra <Terra>`: 基盤コードを使用して、回路やパルスのレベルで量子プログラムを作成します。
ko_kr: :ref:`Qiskit Terra <Terra>`: 기반 코드에서 사용되는 양자 회로와 펄스 단계에서 실행되는 양자 프로그램들의 모음

source: :ref:`Qiskit Aer <Aer>`: Accelerating development via simulators and noise models
es_es: :ref:`Qiskit Aer <Aer>`: Acelerando el desarrollo vía simuladores y modelos con ruido
ja_jp: :ref:`Qiskit Aer <Aer>`: シミュレーターとノイズモデルにより開発を加速する
ko_kr: :ref:`키스킷 아르 <Aer>`: 시뮬레이터와 잡음 모델을 이용한 개발 가속화 함수들

source: :ref:`Qiskit Ignis <Ignis>`: Addressing noise and errors
es_es: :ref:`Qiskit Ignis <Ignis>`: Abordando ruido y errores
ja_jp: :ref:`Qiskit Ignis <Ignis>`: ノイズやエラーに対処します。
ko_kr: :ref:`Qiskit Ignis <Ignis>`: 노이즈나 에러를 처리하는 함수들

source: :ref:`Qiskit Aqua <Aqua>`: Building algorithms and applications
es_es: :ref:`Qiskit Aqua <Aqua>`: Construyendo algoritmos y aplicaciones
ja_jp: :ref:`Qiskit Aqua <Aqua>`: アルゴリズムやアプリケーションを構築します。
ko_kr: :ref:`Qiskit Aqua <Aqua>`: 알고리즘과 응용 프로그램 만들기

source: IBM Quantum Cloud Error Codes
es_es: Códigos de error de IBM Quantum Cloud

source: Qiskit API documentation
es_es: Documentación API de Qiskit

source: This is the Qiskit API documentation. For detailed workflow examples, please sign in to the IBM Quantum Experience to `explore Qiskit tutorials <https://quantum-computing.ibm.com/jupyter/tutorial/1_start_here.ipynb>`__.
es_es: Esto es la documentación de la API de Qiskit. Para ejemplos detallados de workflow, por favor inicie sesión en la IBM Quantum Experience para `explorar tutoriales de Qiskit <https://quantum-computing.ibm.com/jupyter/tutorial/1_start_here.ipynb>`__.
