Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: de, es_es, ja, ko_kr, tr_tr

source: **1.** `Create a free IBM Quantum Experience account <https://quantum-computing.ibm.com/login>`__.
es_es: **1.** `Crea una cuenta gratis de IBM Quantum Experience <https://quantum-computing.ibm.com/login>`__.
tr_tr: **1.** `Ücretsiz bir IBM Quantum Experience hesabı oluşturun <https://quantum-computing.ibm.com/login>`__.

source: For more details, such as how to manage multiple IBM Quantum account credentials, refer to this tutorial titled `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
es_es: Si buscas más detalles, por ejemplo sobre cómo gestionar varias credenciales de cuentas de IBM Quantum, puedes visitar el tutorial `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
tr_tr: Çoklu IBM Kuantum hesap kimlik bilgilerinin nasıl yönetildiği gibi daha fazla detay için, bu eğitsel başlıklı `The IBM Quantum Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__ na başvurun.

source: To simplify your experience we also recommend installing the following
ko_kr: 경험을 단순화하려면 다음을 설치하는 것이 좋습니다
