Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: de, es_es, ja, ko_kr, tr_tr

source: Installing Qiskit
de: Qiskit installieren
es_es: Instalando Qiskit
ja: Qiskitのインストール
ko_kr: 키스킷 설치하기
tr_tr: Qiskit Kurulumu Yapmak

source: Requirements
de: Anforderungen
es_es: Requisitos
ja: 要件
ko_kr: 요구 사항
tr_tr: Gereksinimler

source: If you're having trouble installing or using Qiskit after updating Python, check the `Qiskit Package metadata <https://pypi.org/project/qiskit/>`__ for **Programming Language** to see which specific versions of Python are supported.
de: Bei Problemen mit der Installation oder der Verwendung von Qiskit nach einem Python-Update, kann in den `Qiskit Paket-Metadaten <https://pypi.org/project/qiskit/>`__ unter **Programming Language** eingesehen werden, welche genauen Python-Versionen unterstützt sind.
es_es: Si tienes problemas instalando o usando Qiskit después de actualizar Python, revisa `Qiskit Package metadata <https://pypi.org/project/qiskit/>`__ for **Programming Language** para ver qué versiones específicas de Python son soportadas.
ja: Pythonをアップデートした後Qiskitのインストールや使用に問題が生じた場合は、 どのバージョンのPythonがサポートされているか、`Qiskit Package metadata <https://pypi.org/project/qiskit/>`__ の**Programming Language** を確認して下さい。
ko_kr: 만약 파이썬을 업데이트 하고 나서 키스킷을 사용하거나 설치하는데 문제가 발생한다면, 특정한 버전의 파이쎤이 지원되는지 확인을 위해 **프로그래밍 언어**을 위한 `Qiskit Package metadata <https://pypi.org/project/qiskit/>`을 참조하라.
tr_tr: Eğer Python'u güncelledikten sonra Qiskit'i yüklemekte veya kullanmakta sıkıntı yaşıyorsanız, hangi Python versiyonlarının desteklendiğini görmek için `Qiskit Paket metadatası <https://pypi.org/project/qiskit/>`__ içerisinde **Programming Language** kısmını kontrol edin.

source: We recommend installing `Anaconda <https://www.anaconda.com/download/>`__, a cross-platform Python distribution for scientific computing. Jupyter, included in Anaconda, is recommended for interacting with Qiskit.
de: Die Installation von `Anaconda <https://www.anaconda.com/download/>`__, einer cross-platform Python-Distribution für wissenschaftliches Rechnen, wird empfohlen. Zur Interaktion mit Qiskit wird Jupyter empfohlen, welches in Anaconda vorinstalliert ist.
es_es: Recomendamos instalar `Anaconda <https://www.anaconda.com/download/>`__, una distribución Python multiplataforma para el cálculo científico. A su vez, es recomendable el uso de Jupyter, incluido en Anaconda, para trabajar con Qiskit.
ja: 科学技術計算用クロスプラットフォームのPythonディストリビューションである `Anaconda <https://www.anaconda.com/download/>`__ をインストールすることをおすすめします。`Qiskit tutorials <https://github.com/Qiskit/qiskit-tutorial>`__ とのやり取りには、Anacondaに含まれるJupyter Notebookをおすすめします。
ko_kr: 과학 계산을 위해서 교차 사용이 가능한 파이썬 배포본인 `아나콘다 (Anaconda) <https://www.anaconda.com/download/>`를 설치하는 것을 추천한다. 아나콘다에 포함된 주피터(Jupyter) 패키지는 키스킷과 상호 작용하는 프로그래밍을 위해 사용되면 좋다.
tr_tr: Bilimsel programlama için çok platformlu Python dağıtımı olan `Anaconda <https://www.anaconda.com/download/>`__ yı kurmanızı tavsiye ederiz. Anaconda bünyesindeki Jupyter, Qiskit ile etkileşime girmek için tavsiye edilir.

source: Qiskit is tested and supported on the following 64-bit systems:
de: Qiskit ist getestet und unterstützt auf diesen 64-Bit-Systemen:
es_es: Qiskit está probado y soportado en los siguientes sistemas de 64-bit:
ja: Qiskitは以下の64ビットシステムでテストされサポートされています。
ko_kr: 키스킷은 다음의 64비트 시스템들에서 실행되고 지원되는지 확인하였다.
tr_tr: Qiskit, aşağıdaki 64 bitlik sistemler üzerinde test edilmiş ve desteklenir:

source: Ubuntu 16.04 or later
de: Ubuntu 16.04 oder neuer
es_es: Ubuntu 16.04 o posterior
ja: Ubuntu 16.04またはそれ以降
ko_kr: 우분투 16.04 혹은 최신 버전
tr_tr: Ubuntu 16.04 veya üzeri

source: macOS 10.12.6 or later
de: macOS 10.12.6 oder neuer
es_es: macOS 10.12.6 o posterior
ja: macOS 10.12.6またはそれ以降
ko_kr: 맥오에스 (macOS) 10.12.6 혹은 최신 버전
tr_tr: macOS 10.12.6 veya üzeri

source: Windows 7 or later
de: Windows 7 oder neuer
es_es: Windows 7 o posterior
ja: Windows 7またはそれ以降
ko_kr: 윈도우 7 혹은 최신 버전
tr_tr: Windows 7 veya üzeri

source: Using Qiskit on Windows requires VC++ runtime components. We recommend one of the following:
de: Qiskit auf Windows benötigt VC++ Laufzeitkomponenten. Die folgenden werden empfohlen:
es_es: Para utilizar Qiskit en Windows se requieren los componentes de runtime de VC++. Recomendamos alguno de los siguientes:
ja: WindowsでQiskitを使用するにはVC++ランタイムコンポーネントが必要です。下記のいずれかをおすすめします。
tr_tr: Windows üzerinde Qiskit kullanımı VC++ runtime bileşenleri gerektirir. Biz aşağıdakilerden birini tavsiye ederiz:

source: Install
de: Installation
es_es: Instalación
ja: インストール
ko_kr: 설치하기
tr_tr: Kurulum

source: We recommend using Python virtual environments to cleanly separate Qiskit from other applications and improve your experience.
de: Um Qiskit sauber von anderen Anwendungen zu separieren und die Nutzung zu vereinfachen, wird die Verwendung von Python Virtual Environments empfohlen.
es_es: Recomendamos utilizar entornos virtuales de Python para separar claramente Qiskit de otras aplicaciones y mejorar su experiencia.
ja: Qiskitを他のアプリケーションから明確に分離して、経験をよりよいものにするため、Python仮想環境を使用することをおすすめします。
ko_kr: 키스킷을 다른 응용 프로그램과 분리해서 설치하고 사용자 경험을 증진시키기 위해서 파이썬을 가상 환경에 설치하는 것을 추천한다.
tr_tr: Qiskit'i diğer uygulamalardan net bir şekilde ayırabilmek ve deneyiminizi geliştirmek için Python sanal ortamınlarını kullanmanızı tavsiye ederiz.

source: The simplest way to use environments is by using the ``conda`` command, included with Anaconda. A Conda environment allows you to specify a specific version of Python and set of libraries. Open a terminal window in the directory where you want to work.
de: Der einfachste Weg, Environments zu verwenden, ist der in Anaconda verfügbare ``conda`` Befehl. Ein Conda Environment erlaubt es, eine spezifische Python-Version und eine Liste an Paketen festzulegen. In dem gewünschten Arbeitsverzeichnis kann dann ein Terminal-Fenster geöffnet werden.
es_es: La forma más simple de usar los entornos es usando el comando ``conda``, que se incluye con Anaconda. Un entorno Conda te permite especificar una versión específica de Python y un conjunto de librerías. Abre una ventana de terminal en la carpeta donde quieres trabajar.
ja: 環境を使用するもっともシンプルな方法は、Anacondaに含まれている ``conda`` コマンドを使う方法です。Conda環境では、Pythonの特定のバージョンおよびライブラリを指定することができます。作業したいディレクトリでターミナルウィンドウを開きます。
ko_kr: 가상 환경을 사용하기 위한 가장 손쉬운 방법은 아나콘다(Anaconda) 에 포함되어 있는 ``conda`` 명령어를 사용하는 것이다. 콘다(Conda) 환경은 특정 버전의 파이썬이나 라이브러리 등을 선택할 수 있게 해준다. 작업하고자 하는 디렉토리에서 터미널 창을 연다.
tr_tr: Ortamları kullanmanın en basit yolu Anaconda'nın içindeki ``conda`` komutunu kullanmaktır. Bir Conda ortamı Python'ın özel bir sürümünü belirtmenize ve kütüphaneler kurmanıza imkan sağlar. Çalışmak istediğiniz klasör içinde bir terminal penceresi açın.

source: Create a minimal environment with only Python installed in it.
de: Eine minimale, ausschließlich Python enthaltende Umgebung wird erstellt.
es_es: Crea un entorno mínimo sólo con Python instalado.
ja: Pythonのみをインストールした最小環境を作ります。
ko_kr: 오직 파이썬만 설치한 최소한의 환경을 만드시오.
tr_tr: Yalnızca Python yüklü olan bir minimal ortamı oluşturun.

source: Or, if you're using Windows
de: Oder, wenn Windows verwendet wird
es_es: O bien, si usas Windows
ja: Windowsをお使いの場合は
ko_kr: 또는, 만약 윈도우를 사용하고 있다면
tr_tr: Ya da, Windows kullanıyorsanız

source: Install Anaconda
de: Anaconda installieren
es_es: Instala Anaconda
ja: Anacondaをインストールする
ko_kr: 아나콘다를 설치하시오
tr_tr: Anaconda'yı yükleyin

source: Search for Anaconda Prompt
de: Nach dem Anaconda Prompt suchen
ja: Anacondaのコマンドプロンプトを探す
ko_kr: 아나콘다 프롬프트를 찾으시오.
tr_tr: Anaconda Komut İstemcisi'ni arayın

source: Open Anaconda Prompt
de: Den Anaconda Prompt öffnen
ja: Anacondaのコマンドプロンプトを開く
ko_kr: 아나콘다 프롬프트 열기
tr_tr: Anaconda Komut İstemcisi'ni açın

source: Use the following commands
de: Die folgenden Befehle verwenden
es_es: Utiliza los siguientes comandos
ja: 次のコマンドを使います
ko_kr: 다음 명령어들을 사용 합니다.
tr_tr: Aşağıdaki komutları kullanın

source: Next, install the Qiskit package, which includes Terra, Aer, Ignis, and Aqua.
de: Als nächstes wird das Qiskit Paket Installiert, welches Terra, Aer, Ignis und Aqua enthält.
es_es: Después, instala el paquete de Qiskit, que incluye Terra, Aer, Ignir y Aqua.
ja: 次に、Qiskitパッケージをインストールします。Terra, Aer, Ignis, そしてAquaが含まれています。
ko_kr: 다음으로 테라, 아르, 이그니스, 아쿠아를 포함하고 있는 키스킷 패키지를 설치합니다.
tr_tr: Sonra, Terra, Aer, Ignis, ve Aqua'yı içeren Qiskit paketini yükleyin.

source: Starting with Qiskit 0.13.0 pip 19 or newer is needed to install qiskit-aer from precompiled binary on Linux. If you do not have pip 19 installed you can run ``pip install -U pip`` to upgrade it. Without pip 19 or newer this command will attempt to install qiskit-aer from sdist (source distribution) which will try to compile aer locally under the covers.
de: Seit Qiskit 0.13.0 ist pip 19 oder neuer erforderlich, um qiskit-aer unter Linux von einer vorkompilierten Binärdatei zu installieren. Ist pip 19 nicht installiert, kann pip mit ``pip install -U pip`` aktualisiert werden. Ohne pip 19 oder neuer wird versucht, qiskit-aer von sdist (source distribution) zu installieren, indem aer lokal im Hintergrund zu kompiliert wird.
es_es: Para instalar qiskit-aer del paquete binario precompilado en Linux necesitas tener Qiskit 0.13.0 pip 19 o posterior. Si no has instalado pip 19 puedes ejecutar ``pip install -U pip`` para actualizarlo. Sin pip 19 o posterior este comando intentará instalar qiskit-aer desde sdits (distribución fuente) lo que intentará compilar aer en local de forma encubierta.
ja: Qiskit 0.13.0 以降は、qiskit-aer をLinux上のプリコンパイルされたライブラリからインストールするためには pip 19 以上のバージョンが必要です。pip 19がインストールされていない場合は ``pip install -U pip`` でアップグレード可能です。pip 19以降がインストールされていない状態でqiskit-aerをインストールしようとすると、sdist (source distribution) からのインストールが実行され、裏で aer をローカル・コンパイルしようとしてしまいます。
ko_kr: 키스킷 0.13.0 버전부터는 리눅스에서 미리 컴파일된 바이너리 파일로 키스킷-아르를 설치하기 위해서는 핍(pip) 19 혹은 최신의 버전이 필요합니다. 만약 19 버전의 핍이 설치되어 있지 않다면 다음의 명령어 ``pip install -U pip``로 업그레이드 할 수 있습니다. 핍 19 혹은 최신 버전이 없다면 이 명령어는 소스 배포본(sdist) 로부터 키스킷-아르를 설치하기 위해 현재 사용하는 컴퓨터에서 아르를 소스 컴파일하려고 할 것이다.

source: If the packages installed correctly, you can run ``conda list`` to see the active packages in your virtual environment.
de: Nachdem die Pakete korrekt installiert wurden, können mit ``conda list`` alle aktiven Pakete in der virtuellen Umgebung aufgelistet werden.
es_es: Si los paquetes se han instalado correctamente, puedes usar ``conda list``para ver los paquetes que están activos en tu entorno virtual.
ja: パッケージが正しくインストールされると、``conda list`` で仮想環境に存在するアクティブなパッケージを見ることができます。
ko_kr: 만약 패키지들이 제대로 설치되었다면, 이 명령어 ``conda list``를 실행시켜서 현재 가상 환경에서 설치된 패키지들을 볼 수 있다.

source: When upgrading from Qiskit < 0.7 to the latest version, uninstall the old version of Qiskit with ``pip uninstall qiskit`` and then install the latest version.
de: Bei einem Upgrade von Qiskit < 0.7 auf die neueste Version, ist eine Deinstallation der alten Version mit ``pip uninstall qiskit`` notwendig. Anschließend kann die neueste Version installiert werden.
es_es: Cuando actualices una versión de Qiskit < 0.7 a la última versión, antes desinstala la versión anterior de Qiskit con ``pip uninstall qiskit`` y luego instala la última versión.
ja: Qiskit < 0.7から最新版にアップグレードするときは、 ``pip uninstall qiskit`` で古いバージョンのQiskitをアンインストールしてから最新版をインストールしてください。

source: There are optional dependencies that are required to use all the visualization functions available in Qiskit. You can install these optional dependencies by with the following command
de: Um alle in Qiskit verfügbaren Visualisierungs-Funktionen verwenden zu können, gibt es weitere optionale Abhängigkeiten. Diese können folgendermassen installiert werden
es_es: Hay dependencias opcionales que son necesarias para utilizar todas las funciones de visualización disponibles en Qiskit. Puedes instalar estas dependencias opcionales con el siguiente comando
ja: Qiskitで使うことのできるすべての表示機能を使うために必要となる、オプションの依存関係があります。これらのオプション依存関係は、以下のコマンドでインストールすることができます。

source: After you've installed and verified the Qiskit packages you want to use, import them into your environment with Python to begin working.
de: Nachdem alle Qiskit Pakete installiert und verfügbar sind, können diese in die Python-Umgebung importiert werden, um mit der Nutzung zu beginnen.
es_es: Después de haber instalado y verificado los paquetes de Qiskit que quieres usar, impórtalos en tu entorno con Python para comenzar a trabajar.
ja: 使いたいQiskitパッケージをインストールおよび検証したら、Pythonのある自分の環境にインポートして作業を始めます。
ko_kr: 사용하고자 하는 키스킷 패키지들을 다 설치하고 확인하였다면, 시작하기 위해서 파이썬 환경에 그것들을 임포트해야 한다.

source: If you want to contribute to the Qiskit community by developing and contributing code with the most recently updated Qiskit code, see :ref:`Build Qiskit packages from source <install_install_from_source_label>`.
de: Um zur Qiskit-Community beizutragen und mitzuentwickeln, benötigt man den aktuellsten Entwicklungs-Stand. Siehe :ref:`Qiskit aus dem Quellcode installieren<install_install_from_source_label>`.
ja: 最新のQiskitコードに対して開発や寄与を行うことによってQiskitコミュニティに貢献したいときは、:ref:`Build Qiskit packages from source <install_install_from_source_label>` を参照してください。
ko_kr: 만약 최신 버전의 키스킷 코드에 새로운 코드를 개발하여 키스킷 공동체에 기여를 하고 싶다면, 다음 :ref:`소스 코드로부터 키스킷 설치하기 <install_install_from_source_label>` 을 참조하시오.

source: Access IBM Q Systems
ja: IBM Q Systemsへのアクセス

source: IBM Q offers several real quantum computers and high-performance classical computing simulators through its IBM Q Experience with Qiskit. Follow these steps to set up your Qiskit environment to send jobs to IBM Q systems.
ja: IBM Q では Qiskit の `量子クラウドサービス`を介して量子コンピューターの実機と高パフォーマンスの古典コンピューティング・シミュレーターを提供します。IBM Q システムにジョブを送るには次の手順にしたがって Qiskit 環境をセットアップしてください。

source: With the release of Qiskit 0.11, if you had previously saved your IBM Q credentials locally, you might need to update your IBM Q Experience credentials so that you can use the new IBM Q Experience V2. See `Updating your IBM Q Experience Credentials <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
ja: Qiskit 0.11のリリースに伴い, 過去にIBM Q credentialsをローカルに保存された場合は新しいIBM Q Experience V2を利用するために再度IBM Q Experience credentialsを更新する必要がある可能性があります。詳しくは `Updating your IBM Q Experience Credentials <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__ を参照ください。

source: To configure your account, you create a local configuration file which includes an API key
de: Um einen Account zu konfigurieren, erstellt man eine lokale Konfigurationsdatei, welche den API Schlüssel beinhaltet
es_es: Para configurar tu cuenta, crea un archivo de configuración local que incluya una clave API
ja: アカウントの設定には、ローカルの設定ファイルにAPIキーを追記します。
tr_tr: Hesabınızı yapılandırmak için, bir API anahtarı içeren yerel bir konfigürasyon dosyası oluşturursunuz

source: **1.** `Create a free IBM Q Experience account <https://quantum-computing.ibm.com/login>`__.
ja: **1.** `無料のIBM Q Experience アカウントを作成します <https://quantum-computing.ibm.com/login>`__ 。

source: **2.** Navigate to **My Account** to view your account settings.
de: **2.** Einstellungen unter **My Account** aufrufen.
ja: **手順 2:** **My Account** に移動し、アカウントの設定を表示します。
tr_tr: **2.** Hesap ayarlarınızı görüntülemek için **My Account**'a gidin.

source: **3.** Click on **Copy token** to copy the token to your clipboard. Temporarily paste this API token into your favorite text editor so you can use it later to create an account configuration file.
de: **3.** Mit einem Klick auf **Copy token** den API Schlüssel in die Zwischenablage kopieren und vorübergehend in einem Texteditor einfügen, um ihn später in der Konfigurationsdatei zu verwenden.
ja: **手順3:** トークンをクリップボードにコピーするには、**Copy token** をクリックします。 このAPIトークンを一時的にあなたのお気に入りのテキストエディターに貼り付けておいて、後でアカウント設定ファイルを作成するときに使用できるようにします。
tr_tr: **3.** Panonuza token'ı kopyalamak için **Copy token** a tıklayın. Bu API token'ını geçici olarak favori metin editörünüze kopyalayın. Böylece daha sonra bir hesap konfigürasyon dosyası oluşturmak için kullanabilirsiniz.

source: **4.** Run the following commands to store your API token locally for later use in a configuration file called ``qiskitrc``. Replace ``MY_API_TOKEN`` with the API token value that you stored in your text editor.
de: **4.** Folgender Befehl speichert den API Schlüssel in einer Konfigurationsdatei namens ``qiskitrc``. ``MY_API_TOKEN`` wird hierbei mit dem API Schlüssel aus dem Text Editor ersetzt.
ja: **手順4:** 以下のコマンドを実行して、``qiskitrc`` という設定ファイルで後に使用するために、ローカルにAPIトークンを保存します。 ``MY_API_TOKEN`` をテキストエディターに保存したAPIトークンの値に置き換えます。
tr_tr: **4.** ``qiskitrc`` olarak adlandırılan konfigürasyon dosyasında sonraki kullanıma uygun API token'ınızı yerel olarak depolamak için aşağıdaki komutları yürütün. Metin editörünüzde depoladığınız API token değerini ``MY_API_TOKEN`` ile değiştirin.

source: For more details, such as how to manage multiple IBM Q account credentials, refer to this tutorial titled `The IBM Q Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__.
ja: 複数のIBM Qアカウントの管理の仕方などの詳細については、`The IBM Q Account <https://github.com/Qiskit/qiskit-tutorials/blob/master/qiskit/fundamentals/3_the_ibmq_account.ipynb>`__ を参照ください。

source: Checking Which Version is Installed
de: Testen, welche Version installiert ist
es_es: Comprobar la Versión Instalada
ja: インストールされたバージョンの確認方法
tr_tr: Hangi Versiyonun Yüklü Olduğunu Öğrenmek

source: Since the Qiskit package includes a constellation of different elements, simply printing the version by running ``qiskit.__version__`` can be misleading as it returns only the version for the ``qiskit-terra`` package. This is because the ``qiskit`` namespace in Python doesn't come from the Qiskit package, but instead is part of the ``qiskit-terra`` package.
de: Nachdem das Qiskit Paket eine Zusammenstellung verschiedener Elemente ist, kann die Versionsnummer, die ``qiskit.__version__`` ausgibt, etwas irreführend sein, da dieser Befehl nur die Versionsnummer für ``qiskit-terra`` ausgibt. Das liegt daran, dass der Namespace ``qiskit`` in Python nicht vom Paket Qiskit kommt, sondern Teil des Pakets ``qiskit-terra`` ist.
ja: Qiskit パッケージにはさまざまな要素の集まりが含まれているので、``qiskit.__version__`` の実行では、``qiskit-terra`` パッケージのバージョンのみが返されるため、誤解を招く可能性があります。 これは Python の ``qiskit`` namespace が Qiskit パッケージから来ているのではなく、``qiskit-terra`` パッケージの一部だからです。
tr_tr: Qiskit paketi farklı elementlerin konstelasyonunu içerdiğinden dolayı, ``qiskit.__version__`` u çalıştırarak versiyonu kolay bir şekilde yazdırmak sadece ``qiskit-terra`` paketine uygun sürümü döndürerek yanıltabilir. Bunun sebebi Python'daki ``qiskit`` namespace'inin Qiskit paketinden değil, fakat onun yerine ``qiskit-terra`` paketinin bir parçası olmasındandır.

source: To see the versions of all the Qiskit elements in your environment you can use the ``__qiskit_version__`` attribute. For example, running the following command will return a dictionary that includes the versions for each of the installed Qiskit packages.
de: Um die Versionsnummern aller Qiskit Elemente zu sehen, kann ``qiskit.__qiskit_version__`` verwendet werden. Dies gibt ein assoziatives Array zurück, welches die Versionen aller installierten Qiskit Pakete enthält.
es_es: Para ver las versiones de todos los elementos de Qiskit de tu entorno puedes usar el atributo ``__qiskit_version__``. Por ejemplo, ejecutar el siguiente comando te devolverá un diccionario que incluye las versiones de cada uno de los paquetes de Qiskit instalados.
ja: あなたの環境のすべての Qiskit 要素のバージョンを見るためには、``__qiskit_version__`` 属性を使います。例えば、次のコマンドを実行すると、インストールされている各 Qiskit パッケージのバージョンを含む dictionary が返されます。
tr_tr: Ortamınızdaki bütün Qiskit elementlerinin sürümlerini görmek için ``__qiskit_version__`` özelliğini kullanabilirsiniz. Örneğin, aşağıdaki komudu çalıştırmak yüklenen her Qiskit paketine uygun versiyonu içeren bir sözlük getirir.

source: If you're filing an issue or need to share your installed Qiskit versions for something, use the ``__qiskit_version__`` attribute.
de: Bei einem Bugreport oder um die verwendete Qiskit-Versionen mitzuteilen, sollte das ``__qiskit_version__`` Attribut verwendet werden.
es_es: Si estás creando una incidencia o necesitas compartir por cualquier motivo las versiones de Qiskit que tienes instaladas, usa el atributo ``__qiskit_version__``.
ja: あなたが issue を出すときや、何かの理由であなたがインストールしている Qiskit バージョンを共有する必要があるときは、``__qiskit_version__`` attribute を使用してください。
tr_tr: Eğer bir sorun bildiriyorsanız veya bir iş için yüklü Qiskit versiyonlarınızı paylaşmanız gerekiyorsa ``__qiskit_version__`` değişkenini kullanın.

source: Qiskit supports Python 3.5 or later. However, both Python and Qiskit are evolving ecosystems, and sometimes when new releases occur in one or the other, there can be problems with compatibility.
de: Qiskit unterstützt Python 3.5 oder neuer. Jedoch sind sowohl Python als auch Qiskit sich weiterentwickelnde Ökosysteme und manchmal, wenn neue Versionen in dem einen oder anderen veröffentlicht werden, kann es zu Kompatibilitätsproblemen kommen.
es_es: Qiskit es compatible con versiones de Python 3.5 o superior. Sin embargo, tanto Python como Qiskit son sistemas en constante evolución, por lo que cuando se lanzan nuevas actualizaciones en alguno de los dos entornos puede que ocurran problemas de compatibilidad.
ko_kr: 키스킷은 파이선 3.5나 이후 버전을 지원한다. 그러나 파이썬과 키스킷은 상호 진화하는 생태계를 이루기 때문에 때때로 어느 한쪽에서 새로운 버전이 출시되면, 호환성에 문제가 발생할 수도 있다.
tr_tr: Qiskit, Python 3.5 veya daha üst sürümleri desteklemektedir. Fakat, hem Python hem de Qiskit devamlı evrilen ekosistemler olduğu için herhangi birinin yeni sürümünün çıkması durumunda uyumluluk problemleri ortaya çıkabilir.

source: `Microsoft Visual C++ Redistributable for Visual Studio 2017 <https:// go.microsoft.com/fwlink/?LinkId=746572>`__
es_es: `Microsoft Visual C++ Redistribuible para Visual Studio 2017 <https:// go.microsoft.com/fwlink/?LinkId=746572>`__
tr_tr: Visual Studio 2017 için `Microsoft Visual C++ Redistributable <https:// go.microsoft.com/fwlink/?LinkId=746572>`__

source: `Microsoft Visual C++ Redistributable for Visual Studio 2015 <https:// www.microsoft.com/en-US/download/details.aspx?id=48145>`__
es_es: `Microsoft Visual C++ Redistribuible para Visual Studio 2015 <https://www.microsoft.com/es-es/download/confirmation.aspx?id=48145>`__
tr_tr: Visual Studio 2015 için `Microsoft Visual C++ Redistributable <https:// www.microsoft.com/en-US/download/details.aspx?id=48145>`__

source: Access IBM Quantum Systems
es_es: Accede a los Sistemas Cuánticos de IBM
ko_kr: IBM 양자 시스템에 접근하기

source: IBM Quantum offers several real quantum computers and high-performance classical computing simulators through its IBM Quantum Experience with Qiskit. Follow these steps to set up your Qiskit environment to send jobs to IBM Quantum systems.
es_es: IBM Quantum ofrece varios ordenadores cuánticos reales y simuladores cuánticos de alto rendimiento para ordenadores clásicos a través de la IBM Quantum Experience con Qiskit. Sigue los siguientes pasos para configurar el entorno en Qiskit y enviar los trabajos a los sistemas cuánticos de IBM.

source: With the release of Qiskit 0.11, if you had previously saved your IBM Quantum credentials locally, you might need to update your IBM Quantum Experience credentials so that you can use the new IBM Quantum Experience V2. See `Updating your IBM Quantum Experience Credentials <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
es_es: Con la Release de Qiskit 0.11, si previamente has guardado en local tus credenciales de IBM Quantum, podrías necesitar actualizar tus credenciales de IBM Quantum Experience de modo que puedas utilizar el nuevo IBM Quantum Experience V2. Mira `Actualizar tus Credenciales de IBM Quantum Experience <https://github.com/Qiskit/qiskit-ibmq-provider/#updating-your-ibm-q-experience-credentials>`__.
