Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/the_elements.po
Languages: de_de, ja_jp, ko_kr

source: For certain Ignis experiments, the fitters can output a Filter object. Filters can be used to mitigate errors in other experiments using the calibration results of an Ignis experiment.
de_de: Für bestimmte Ignis-Experimente können Fitter ein Filterobjekt ausgeben. Filter können verwendet werden, um Fehler in anderen Experimenten mit Hilfe der Kalibrierungsergebnisse eines Ignis-Experiments zu korrigieren.
ja_jp: あるIgnisの実験に対し、フィッターはFilterオブジェクトを出力します。フィルターは、Ignis実験のキャリブレーション結果を使用して、他の実験のエラーを軽減するために使われます。
ko_kr: 어떤 이그니스 실험에 대해서는 적합 기술자는 Filter(필터) 객체를 출력할 수도 있다. 필터들은 이그니스 실험의 교정 결과를 이용하여 다른 실험의 오류를 줄이는데 사용될 수도 있다.

source: Qiskit Ignis is organized into three types of experiments that can be performed:
de_de: Qiskit Ignis ist in drei Arten von durchführbaren Experimenten aufgeteilt:
ja_jp: Qiskit Ignisは、実行可能な3種類の実験で編成されています:
ko_kr: 키스킷 이그니스는 세 가지 유형의 실험으로 구분될 수 있다:

source: Characterization experiments are designed to measure parameters in the system such as noise parameters (T1, T2-star, T2), Hamiltonian parameters such as the ZZ interaction rate and control errors in the gates.
de_de: Charakterisierungsexperimente werden entworfen um Rauschparameter (T1, T2-star, T2), Hamiltonian-Parameter wie die ZZ-Wechselwirkungsrate, oder Kontrollfehler in Gattern zu messen.
ja_jp: Characterization実験は、ノイズ・パラメーター (T1, T2-star, T2) などのシステム中のパラメーターや、ZZ相互作用レートなどのハミルトニアン・パラメーター、ゲート中の制御エラーなどを測定するために設計されています。
ko_kr: 특성화 실험은 게이트들에서 ZZ 상호작용률 같은 해밀톤(Hamiltonian) 매개 변수나 잡음 매개 변수(T1, T2-star, T2) 같은 변수를 측정하고 오류를 조절 하도록 설계되었다.

source: Verification experiments are designed to verify gate and small circuit performance. Verification includes state and process tomography, quantum volume and randomized benchmarking (RB). These experiments provide the information to determine performance metrics such as the gate fidelity.
de_de: Verifikationsexperimente haben die Absicht die Gatter- und Schaltkreis-Performance (bei kleinen Schaltkreisen) zu überprüfen. Die Verifikation beinhaltet die Zustandstomographie, das Quantenvolumen und randomisiertes Benchmarking (RB). Diese Experimente liefern die Daten zur Bestimmung von Performance-Metriken wie der Fidelity der Quantengatter ("gate fidelity").
ja_jp: Verification実験は、ゲートや小さい回路のパフォーマンスを検証するために設計されています。Verificationは、状態およびプロセス・トモグラフィー、量子ボリューム、ランダム・ベンチマーキング(RB) を含みます。これらの実験は、ゲートの忠実度(fidelity) のようなパフォーマンス・メトリックを決定する情報を提供します。
ko_kr: 증명 실험은 게이트나 작은 회로의 성능을 입증하기 위해 설계되었다. 여기에는 상태 및 과정 단층 촬영, 양자 볼륨 그리고 임의 벤치마킹 (randomized benchmarking, RB) 가 포함된다. 이런 실험들은 게이트의 정확성과 같은 성능 메트릭을 결정하기 위한 정보를 제공한다.

source: Mitigation experiments run calibration circuits that are analyzed to generate mitigation routines that can be applied to arbitrary sets of results run on the same backend. Ignis code will generate a list of circuits that run calibration measurements. The results of these measurements will be processed by a Fitter and will output a Filter than can be used to apply mitigation to other results.
de_de: Bei Experimenten zur Fehlerreduktion werden Kalibrierungsschaltkreise ausgeführt. Diese werden analysiert, um Routinen zur Fehlerreduktion zu generieren, die auf beliebige, auf demselben Backend ausgeführte Ergebnismengen, angewendet werden können. Ignis-Code generiert eine Liste von Schaltkreisen, die Kalibrierungsmessungen durchführen. Die Ergebnisse dieser Messungen werden von einem Fitter verarbeitet und geben einen Filter aus, der zur Fehlerreduktion auf andere Ergebnisse angewendet werden kann.
ja_jp: Mitigation実験は、同じバックエンドで実行される結果セットに適用できる軽減ルーチンを生成するために分析する回路のキャリブレーションを実行します。Ignisのコードはキャリブレーション測定を実行する回路のリストを作成します。これらの測定結果は、Fitterによって処理され、他の結果の軽減に使えるようなFilterを出力します。
ko_kr: 완화 실험은 같은 후위 처리 장치에서 실행된 임의의 결과 집합에 적용되는 완화 루틴을 만들기 위해 분석용 교정 회로를 실행한다. 이그니스 코드는 교정 측정을 수행하는 회로 목록을 생성할 것이다. 이런 측정의 결과들은 적합 기술자로 처리되고 다른 결과에 완화 루틴을 적용하는데 사용될 필터를 출력할 것이다.

source: Aqua, the ‘water’ element, is the element of life. To make quantum computing live up to its expectations, we need to find real-world applications. Aqua is where algorithms for quantum computers are built. These algorithms can be used to build applications for quantum computing. Aqua is accessible to domain experts in chemistry, optimization, finance and AI, who want to explore the benefits of using quantum computers as accelerators for specific computational tasks.
de_de: Aqua, das Element "Wasser", ist das Element des Lebens. Um den Erwartungen an die Quanteninformatik gerecht zu werden, müssen wir Anwendungen in der realen Welt finden. In Aqua werden Algorithmen für Quantencomputer gebaut. Diese Algorithmen können verwendet werden, um Anwendungen für die Quanteninformatik zu bauen. Aqua ist zugänglich für Experten aus den Bereichen Chemie, Optimierung, Finanzwesen und Künstlicher Intelligenz, welche die Vorteile von Quantencomputern zur Beschleunigung von spezifischen, rechenaufwändigen Aufgaben entdecken wollen.
ja_jp: 「Aqua」要素 (「水」の意) は、生命の要素です。 量子コンピューティングが期待に応えるには、実世界のアプリケーションを見つける必要があります。 Aquaには量子コンピューター用アルゴリズムが揃っていて、このアルゴリズムを使用して量子コンピューティングのアプリケーションを構築できます。 化学や最適化、金融、AI の専門家はAquaを使用することで、量子コンピューターの特定の計算タスクを加速化する利益を享受できます。
ko_kr: 아쿠아는 '물'을 나타내는 생명의 구성 요소이다. 양자 컴퓨팅이 기대되는 수준까지 상용화되려면, 실생활에 사용되는 응용 프로그램을 찾아야 한다. 아쿠아는 양자 컴퓨터를 위한 알고리즘이 만들어지는 곳이다. 이러한 알고리즘은 양자 컴퓨팅을 위한 응용 프로그램을 만드는데 사용된다. 화학, 최적화, 금융, AI 분야에 종사하는 전문가들이 아쿠아를 사용하게 되는데, 특정 연산 작업을 위한 가속화 장치로 양자 컴퓨터를 사용하는 사람들에게 유익할 것이다.

source: Problems that may benefit from the power of quantum computing have been identified in numerous domains, such as Chemistry, Artificial Intelligence (AI), Optimization and Finance. Quantum computing, however, requires very specialized skills. To address the needs of the vast population of practitioners who want to use and contribute to quantum computing at various levels of the software stack, we have created Qiskit Aqua.
de_de: Problemstellungen, welche von dem Potential der Quanteninformatik profitieren können, wurden in verschiedenen Bereichen identifiziert, wie beispielsweise Chemie, Künstliche Intelligenz (KI), Optimierung und dem Finanzwesen. Quanteninformatik benötigt jedoch sehr spezialisierte Fähigkeiten. Um den Bedürfnissen aller, die Quanteninformatik einsetzen und zu ihr auf den verschiedenen Ebenen des Software Stacks beitragen wollen, gerecht zur werden, wurde Qiskit Aqua geschaffen.
ja_jp: 量子コンピューターのパワーから利益を享受できる問題は、ChemistryやArtificial Intelligence (AI)、Optimization、やFinanceなど、数多くの分野で確認されています。しかし、量子コンピューターはとても特殊なスキルを要求します。ソフトウェア・スタックの様々なレベルで、量子コンピューターを使い貢献したいと考えている多くの実行者のニーズに対応するため、Qiskit Aquaを開発しました。
ko_kr: 양자 컴퓨팅의 힘으로 해결하기 좋은 문제들은 화학, 인공 지능(AI), 최적화 및 금융 부분 등 여러 도메인에서 확인되었다. 하지만, 양자 컴퓨팅은 매우 특화된 기술들을 필요로 한다. 여러 다양한 레벨의 소프트웨어 스택에서 양자 컴퓨팅을 사용하거나 기여하고자 하는 많은 전문가 집단의 요구를 충족시키기 위해 키스킷 아쿠아(Aqua)를 제공한다.

source: `Circuit <https://qiskit.org/documentation/apidoc/circuit/circuit.html>`__ A quantum circuit is a model for quantum computing in which a computation is done by performing a sequence of quantum operations (usually gates) on a register of qubits. A quantum circuit usually starts with the qubits in the :math:`|0,…,0>` state and these gates evolve the qubits to states that cannot be efficiently represented on a classical computer. To extract information on the state a quantum circuit must have a measurement which maps the outcomes (possible random due to the fundamental nature of quantum systems) to classical registers which can be efficiently represented.
de_de: `Circuit <https://qiskit.org/documentation/apidoc/circuit/circuit.html>`__ Eine Quantenschaltung ist ein Modell des Quantencomputing, in welchem eine Berechnung erfolgt, indem eine Reihe von Operationen (üblicherweise Gatter) auf ein Quantenregister angewandt werden. Die Qubits in einer Quantenschaltung starten für gewöhnlich im Basiszustand :math:`|0,…,0>`, welcher durch Gatter dahingehend verändert wird, dass diese von einem klassischen Computer nicht effizient dargestellt werden können. Um Informationen über den Zustand einer Quantenschaltung zu erlangen, benötigt man Messungen, welche die Ergebnisse (eventuell zufällig, aufgrund der Beschaffenheit von Quantensystemen) in ein klassisches Bit-Register schreiben, um sie effizient darstellen zu können.

source: `Pulse <https://qiskit.org/documentation/apidoc/pulse/pulse.html>`__ A pulse schedule is set of pulses which are sent to a quantum experiment that are applied to a channel (experimental input line). This is a lower level than circuits and requires each gate in the circuit to be represented as a set of pulses. At this level the experiments can be designed to reduce errors (dynamical decoupling, error mitigation, and optimal pulse shapes).
de_de: `Pulse <https://qiskit.org/documentation/apidoc/pulse/pulse.html>`__ Ein Pulse Schedule ist eine Reihe von Pulsen welche zu einem Quantenexperiment geschickt werden und auf einen Kanal (experimenteller Input) angewendet werden. Dies ist auf einer Ebene unter einer Quantenschaltung und setzt voraus, dass jedes Quantengatter in einem Schaltkreis als eine Reihe von Pulsen ausgedrückt werden kann. Auf dieser Ebene können Experimente so kreiert werden, dass Fehler reduziert werden (z. B. durch dynamische Entkopplung, optimales Puls-Formen, etc.).

source: `Transpiler <https://qiskit.org/documentation/apidoc/transpiler/transpiler.html>`__ A major part of research on quantum computing is working out how to run a quantum circuits on real devices. In these devices, experimental errors and decoherence introduce errors during computation. Thus, to obtain a robust implementation it is essential to reduce the number of gates and the overall running time of the quantum circuit. The transpiler introduces the concept of a pass manager to allow users to explore optimization and find better quantum circuits for their given algorithm. We call it a transpiler as the end result is still a circuit.
de_de: `Transpiler <https://qiskit.org/documentation/apidoc/transpiler/transpiler.html>`__ Ein grosser Teil der Forschung über Quantencomputer beschäftigt sich damit, wie Quantenschaltkreise auf echter Hardware ausgeführt werden können. Auf dieser Hardware führen experimentelle Fehler und Dekoheränz zu Fehlern während der Rechnung. Um eine robuste Implementierung zu erreichen ist es essentiell die Anzahl der Quantengatter und die totale Laufzeit des Schaltkreises zu reduzieren. Der "Transpiler" führt das Konzept des "Pass Managers" ein, welches Nutzern erlaubt mittels Optimierung bessere Schaltkreise für einen gegebenen Algorithmus zu finden. Es wird als "Transpiler" bezeichnet, da das Endergebnis immer noch ein Schaltkreis ist.

source: `Providers <https://qiskit.org/documentation/apidoc/providers/providers.html>`__ Once the user has made the circuits to run on the backend they need to have a convenient way of working with it. In Terra we do this using four parts:
de_de: `Providers <https://qiskit.org/documentation/apidoc/providers/providers.html>`__ Sobald der Benutzer den Schaltkreis auf dem Backend zum Laufen gebracht hat, benötigt er eine bequeme Möglichkeit, damit zu arbeiten. In Terra werden dazu vier Komponenten eingesetzt:

source: `Result <https://qiskit.org/documentation/api/qiskit.result.Result.html>`__. Once the job has finished Terra allows the results to be obtained from the remote backends using `result = job.result()`. This result object holds the quantum data and the most common way of interacting with it is by using `result.get_counts(circuit)`. This method allows the user to get the raw counts from the quantum circuit and use them for more analysis with quantum information tools provided by Terra.
de_de: `Ergebnis <https://qiskit.org/documentation/api/qiskit.result.Result.html>`__. Sobald der Job ausgeführt wurde, ermöglicht es Terra mit `result = job.result()` die Ergebnisse vom dezentralen Backend zu erhalten. Dieses Ergebnis-Objekt enthält die Quantendaten. Die verbreitetste Art mit dem Objekt zu interagieren ist die Verwendung von `result.get_counts(circuit)`. Diese Methode erlaubt es dem Benutzer, die Rohdaten aus dem Quantenschaltkreis zu erhalten und sie für weitere Analysen mit den von Terra zur Verfügung gestellten Quanteninformationswerkzeugen zu verwenden.

source: `Quantum Information <https://qiskit.org/documentation/apidoc/quantum_info/quantum_info.html>`__ To perform more advanced algorithms and analysis of the circuits run on the quantum computer, it is important to have tools to implement simple quantum information tasks. These include methods to both estimate metrics and generate quantum states, operations, and channels.
de_de: `Quanteninformation <https://qiskit.org/documentation/apidoc/quantum_info/quantum_info.html>`__ Um komplexere Algorithmen auszuführen, sowie die Analyse von Schaltkreisen auf einem Quantencomputer durchzuführen, ist es wichtig Werkzeuge zu haben um einfache Quanteninformationsaufgaben zu implementieren. Dies beinhaltet Methoden um Metriken zu bestimmen und Quantenzustände, Quantenoperatoren und Quantenkanäle zu generieren.

source: Allows ideal and noisy multi-shot execution of qiskit circuits and returns counts or memory. There are multiple methods that can be used that simulate different cirucits more efficiently. These inlude:
de_de: Erlaubt die ideale und rauschende Mehrfach-Ausführung von Qiskit Schaltkreisen und gibt die "counts" oder "memory" zurück. Es gibt mehrere Methoden, welche verwendet werden können um verschiedene Schaltkreise effizienter zu simulieren:

source: `Characterization <https://qiskit.org/documentation/apidoc/ignis/characterization/characterization.html>`__
de_de: `Charakterisierung <https://qiskit.org/documentation/apidoc/ignis/characterization/characterization.html>`__

source: `Verification <https://qiskit.org/documentation/apidoc/ignis/verification/verification.html>`__
de_de: `Verifizierung <https://qiskit.org/documentation/apidoc/ignis/verification/verification.html>`__

source: `Mitigation <https://qiskit.org/documentation/apidoc/ignis/mitigation/mitigation.html>`__
de_de: `Fehlerreduktion <https://qiskit.org/documentation/apidoc/ignis/mitigation/mitigation.html>`__

source: Terra
ko_kr: 테라

source: Aer
ko_kr: 아르

source: Ignis
ko_kr: 이그니스

source: `Characterization <https://qiskit.org/documentation/apidoc_legacy/ignis/characterization/characterization.html>`__
ko_kr: `특성화 <https://qiskit.org/documentation/apidoc_legacy/ignis/characterization/characterization.html>`__

source: `Verification <https://qiskit.org/documentation/apidoc_legacy/ignis/verification/verification.html>`__
ko_kr: `증명 <https://qiskit.org/documentation/apidoc_legacy/ignis/verification/verification.html>`__

source: `Mitigation <https://qiskit.org/documentation/apidoc_legacy/ignis/mitigation/mitigation.html>`__
ko_kr: `완화 <https://qiskit.org/documentation/apidoc_legacy/ignis/mitigation/mitigation.html>`__

source: Aqua
ko_kr: 아쿠아
