Repository: Qiskit/qiskit-metapackage
Catalog: docs/locale/*/LC_MESSAGES/the_elements.po
Languages: de_de, ja_jp, ko_kr

source: The Qiskit Elements
de_de: Die Qiskit Elemente
ja_jp: Qiskit の要素
ko_kr: 키스킷 구성 요소

source: Terra, the ‘earth’ element, is the foundation on which the rest of Qiskit lies. Terra provides a bedrock for composing quantum programs at the level of circuits and pulses, to optimize them for the constraints of a particular device, and to manage the execution of batches of experiments on remote-access devices. Terra defines the interfaces for a desirable end-user experience, as well as the efficient handling of layers of optimization, pulse scheduling and backend communication.
de_de: Terra, das Element `Erde`, ist das Fundament auf dem der Rest von Qiskit aufbaut. Terra bietet die Grundlage um Quantenprogramme mit Schaltkreisen und Pulsen zu erstellen, diese für die Anforderungen bestimmter Geräte zu optimieren, und die Ausführung von Experimenten auf externen Geräten zu verwalten. Terra definiert die Schnittstellen für eine freundliche Endnutzer-Erfahrung, sowie eine effiziente Handhabung von Optimierungsebenen, Impulsplanung und Backend Kommunikation.
ja_jp: Terra 要素(「地」の意) は、他のQiskitを支える土台です。特定の量子デバイスの制約に対して最適化したり、 リモート・アクセスのデバイスに対して行われた実験実行を管理するために、回路やパルスのレベルで量子プログラムを構築する基盤を提供します。Terraは、効率的な最適化レイヤー処理、パルス・スケジューリング、バックエンド通信とともに、望ましいエンド・ユーザー体験のためのインターフェースを定義します。
ko_kr: 테라, '대지' 엘리먼트는 나머지 키스킷 하위 구조들이 놓어지는 기반을 형성한다. 테라는 펄스와 회로 단위에서 양자 프로그램을 구성하는 기반을 제공하여서 특정 장치의 제한 아래서 최적화를 할 수 있게 해주고 다른 원격 접속된 장치 상에서 여러 실험들이 일괄 처리되는 것을 관리할 수 있게 해 준다. 테라는 원하는 최종 사용자 경험 및 최적화 계층, 펄스 스케줄링과 후위 처리장치 간의 커뮤니케이션 등을 효율적으로 다룰 수 있게 해주는 인터페이스를 정의한다.

source: Qiskit Terra is organized in six main modules:
de_de: Qiskit Terra ist in sechs Modulen organisiert:
ja_jp: Qiskit Terra は６つの主要なモジュールで構成されています：
ko_kr: 키스킷 테라는 여섯가지 중요한 모듈로 구성되어 있다.

source: `Circuit <https://qiskit.org/documentation/apidoc/circuit.html>`__ A quantum circuit is a model for quantum computing in which a computation is done by performing a sequence of quantum operations (usually gates) on a register of qubits. A quantum circuit usually starts with the qubits in the :math:`|0,…,0>` state and these gates evolve the qubits to states that cannot be efficiently represented on a classical computer. To extract information on the state a quantum circuit must have a measurement which maps the outcomes (possible random due to the fundamental nature of quantum systems) to classical registers which can be efficiently represented.
ja_jp: `量子回路 <https://qiskit.org/documentation/apidoc/circuit.html>`__ 量子回路は量子コンピューティングをモデル化し、量子ビットのレジスター上で一連の量子演算 (通常はゲート) を実行することで計算を行います。量子回路ににおける量子ビットの初期状態は通常 :math:`|0,…,0>` の状態から始まり、ゲート操作の適用によってこれらの量子ビットは古典コンピューターでは効率的に表現できない状態を保持します。 この量子状態を取得するには最終的に量子回路を測定する必要があり、測定によって（量子システム特有のランダム性をもった）出力が古典レジスターにマッピングされます。
ko_kr: `회로 <https://qiskit.org/documentation/apidoc/circuit.html>`__ 양자 회로란 큐빗으로 이루어진 레지스터에 연속적인 양자 연산(보통 게이트들)을 통해 이루어지는 양자 컴퓨팅을 위한 모델이다. 보통 양자 회로는 :math:`|0,…,0>` 상태에 있는 큐비트들로 시작되어 전통적인 컴퓨터로는 표현되기 힘든 상태의 큐비트들로 발전해 나간다. 양자 상태에 대한 정보를 알아내기 위해서는 결과값(양자 시스템의 근본적인 성질 때문에 임의값을 가질 수 있다)들을 효과적으로 표현할 수 있는 고전적인 레지스터들로 옮겨주는 측정이 필요하다.

source: `Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ A pulse schedule is set of pulses which are sent to a quantum experiment that are applied to a channel (experimental input line). This is a lower level than circuits and requires each gate in the circuit to be represented as a set of pulses. At this level the experiments can be designed to reduce errors (dynamical decoupling, error mitigation, and optimal pulse shapes).
ja_jp: `パルス <https://qiskit.org/documentation/apidoc/pulse.html>`__ パルス・スケジュールは、量子実験に送信される一連のパルスであり、チャネル(実験入力ライン)に適用されます。 これは回路よりも低いレベルのもので、回路内の各ゲートはパルスのセットとして表される必要があります。 このレベルでは、(動的デカップリング、エラー軽減、および最適なパルス形状などで) エラーを低減するように実験を設計できます。
ko_kr: `펄스 <https://qiskit.org/documentation/apidoc/pulse.html>`__ 펄스 스케줄은 (실험적인 입력 라인인) 채널에 적용되는 양자 실험으로 보내지는 펄스들의 집합이다. 이는 회로 보다 하위 레벨이며 회로에 있는 각각의 게이트는 펄스들의 집합으로 표현되어진다. 이 단계에서는 에러를 줄이기 위해 다양한 동적 분리(dynamic decoupling), 에러 완화(error mitigation), 최적 펄스 형상(optimal pulse shape)과 같은 방식으로 실험들을 디자인한다.

source: `Transpiler <https://qiskit.org/documentation/apidoc/transpiler.html>`__ A major part of research on quantum computing is working out how to run a quantum circuits on real devices. In these devices, experimental errors and decoherence introduce errors during computation. Thus, to obtain a robust implementation it is essential to reduce the number of gates and the overall running time of the quantum circuit. The transpiler introduces the concept of a pass manager to allow users to explore optimization and find better quantum circuits for their given algorithm. We call it a transpiler as the end result is still a circuit.
ja_jp: `トランスパイラー <https://qiskit.org/documentation/apidoc/transpiler.html>`__ 量子コンピューティング研究の多くは、実際のデバイスでどのように量子回路を実行するかになります。 デバイスでは測定誤差とデコヒーレンスにより、計算中にエラーが入り込みます。 堅牢な実装のためには、ゲート数と量子回路の総実行時間の削減が重要です。 トランスパイラーではパス・マネージャの概念を導入しました。 ユーザーは、与えたアルゴリズムに対して最適化を実行し、より良い量子回路を発見できます。 最終結果が回路であることに変わりはないためトランスパイラーと呼ばれます。
ko_kr: `트랜스파일러 <https://qiskit.org/documentation/apidoc/transpiler.html>`__ 양자 컴퓨터 연구의 중심 파트는 어떻게 양자 회로를 실제 장치에서 구동시킬지를 알아내는 것이다. 이러한 장치들에서는 실험적인 에러와 위상 결집 (coherence)가 약해져 계산 과정동안 연산 에러를 만들게 된다. 따라서 탄탄한 실행을 위해서는 양자 회로의 게이트의 숫자를 줄이고 전체적인 연산 시간을 줄이는 것이 필수적이다. 트랜스파일러는 사용자들이 그들의 알고리즘을 위해 최적화를 시험해보고 더 나은 양자 회로를 발견하기 위한 경로 매니저의 개념을 도입하였다. 우리는 그것을 트랜스파일러라 부르는데 왜냐하면 그 연산의 결과 역시 또 하나의 회로이기 때문이다.

source: `Providers <https://qiskit.org/documentation/apidoc/providers.html>`__ Once the user has made the circuits to run on the backend they need to have a convenient way of working with it. In Terra we do this using four parts:
ja_jp: `プロバイダー <https://qiskit.org/documentation/apidoc/providers.html>`__ バックエンドで実行するための回路を作成すると、次はそれを走らせる便利な方法が必要になります。Terraでは、以下の4つのパートを使って実施します:
ko_kr: `공급자들 <https://qiskit.org/documentation/apidoc/providers.html>`__ 사용자들이 후위 처리 장치에서 돌아갈 회로를 만들고 나면, 그들은 만들어진 회로를 다룰 손쉬운 방법이 필요하다. 테라에서는 다음의 네 가지 파트를 가지고 이것을 이루어낸다.

source: A `Provider <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ is an entity that provides access to a group of different backends (for example, backends available through the `IBM Quantum Experience <https://quantum-computing.ibm.com>`__). It interacts with those backends to, for example, find out which ones are available, or retrieve an instance of a particular backend.
de_de: Ein `Provider <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ gibt Zugriff zu einer Gruppe verschiedener "Backends" (zum Beispiel "Backends" welche über die `IBM Quantum Experience <https://quantum-computing.ibm.com>`__ erreichbar sind). Er interagiert mit diesen Backends um, zum Beispiel, herauszufinden welche verfügbar sind, oder um eine Instanz eines bestimmten Backends abzurufen.
ja_jp: `プロバイダー <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ は異なるバックエンド群 (例えば `IBM Quantum Experience <https://quantum-computing.ibm.com>`__ の中で利用可能なバックエンド) へのアクセスを提供します。 これらのバックエンドとやり取りをすることで、現在利用可能なバックエンドを見つけたり、特定のバックエンドのインスタンスを取得できます。
ko_kr: `공급자 <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ 다른 후위 처리 장치의 그룹들에 대한 접근을 제공하는 개체다 (예를 들어, `IBM 양자 경험 시스템(IBM Quantum Experience) <https://quantum-computing.ibm.com>`__ 을 통해 제공되는 후위 처리 장치들). 공급자는 그러한 후위 처리 장치와 상호 작용하고, 예를 들면 사용 가능한 것을 찾거나, 특정 후위 처리 장치의 인스턴스를 찾도록 한다.

source: `Backend <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ represent either a simulator or a real quantum computer and are responsible for running quantum circuits and returning results. They have a run method which takes in a `qobj` as input and returns a `BaseJob` object. This object allows asynchronous running of jobs for retrieving results from a backend when the job is completed.
de_de: Ein `Backend <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ repräsentiert entweder einen Simulator oder einen echten Quantencomputer und ist für die Ausführung von Quantenschaltkreisen verantwortlich, sowie die Lieferung der Ergebnisse. Sie haben eine "run" Methode welche ein `qobj` als Eingabe erhält und ein `BaseJob` Objekt zurückliefert. Dieses Objekt erlaubt asynchrone Ausführung von Jobs um die Ergebnisse vom Backend zu erhalten so bald ein Job fertiggestellt wurde.
ja_jp: `バックエンド <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ はシミュレーターまたは実際の量子コンピューターを表し、量子回路の実行と結果に責任を持ちます。 run メソッドは `qobj` を入力に取り、`BaseJob` オブジェクトを返します。 このオブジェクトはジョブを非同期に実行し、ジョブが完了するとバックエンドから結果を取得します。
ko_kr: `후위 처리 장치 <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ 는 실제 양자 컴퓨터나 시뮬레이터를 나타내는데, 양자 회로를 실행하고 결과를 출력하는 것을 담당한다. 이는 `양자 객체(qobj)`를 입력으로 받아들여 `기본작업(BaseJob)` 객체를 출력하는 실행 메소드를 가지고 있다. 이 객체는 작업이 끝났을 때 후위 처리 장치로부터 결과를 불러들이는 일을 비동기적으로 하도록 해준다.

source: `Job <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ instances can be thought of as the “ticket” for a submitted job. They find out the execution’s state at a given point in time (for example, if the job is queued, running, or has failed) and also allow control over the job.
de_de: `Job <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__-Instanzen können als "Ticket" für das abgeschickte Job angesehen werden. Sie finden den Zustand einer gewissen Ausführung zu einem bestimmten Zeitpunkt heraus (zum Beispiel, ob sich ein Job in der Warteschlange befindet, ausgeführt wird, oder fehlgeschlagen ist) und erlauben einen Job zu steuern.
ja_jp: `ジョブ <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ インスタンスは、サブミットされたジョブの 「チケット」 と見なせます。 ある時点、例えばジョブがキューされたときや実行中、あるいは失敗したときなどの実行状態を検索し、ジョブを制御できます。
ko_kr: `작업 <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ 인스턴스는 제출된 작업을 위한 “티켓” 같이 생각될 수 있다. 이는 특정 시간에 (예를 들어, 작업이 대기열에 있거나, 실행, 또는 실패한 경우) 연산 상태를 알아내고, 작업에 대한 통제를 가능하게 해준다.

source: `Result <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>`__. Once the job has finished Terra allows the results to be obtained from the remote backends using `result = job.result()`. This result object holds the quantum data and the most common way of interacting with it is by using `result.get_counts(circuit)`. This method allows the user to get the raw counts from the quantum circuit and use them for more analysis with quantum information tools provided by Terra.
ja_jp: `結果 <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>`__ 。ジョブの完了後は `result = job.result()` を使用してリモートのバックエンドから結果を取得します。 取得した結果オブジェクトには量子データが含まれ、通常は `result.get_counts(circuit)` を使用してやりとりします。 このメソッドでは量子回路から生のカウント数を取得でき、Terra で提供される量子情報ツールを使用することで更に分析できます。
ko_kr: `결과 <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>`__. 작업이 끝나면, 테라는 원격 후위 처리 장치로부터 `result = job.result()`라는 명령을 통해 결과를 얻을 수 있게 한다. 이런 result 객체는 양자 정보를 가지고 있으며 그것과 상호 작용할 수 있는 가장 일반적인 방법은 `result.get_counts(circuit)` 명령어를 사용하는 것이다. 이 메소드는 사용자들이 양자 회로로부터 가공되지 않는 카운트를 얻게 해주고 이를 이용하여 테라에서 제공되는 양자 정보 도구들을 활용하여 더 복잡한 분석을 가능하게 한다.

source: `Quantum Information <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ To perform more advanced algorithms and analysis of the circuits run on the quantum computer, it is important to have tools to implement simple quantum information tasks. These include methods to both estimate metrics and generate quantum states, operations, and channels.
ja_jp: `量子情報 <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ 。量子コンピューター上で実行される回路のより高度なアルゴリズムおよび分析を実行するためには、シンプルな量子情報タスクを実行するためのツールを持つことが重要です。 これらには、メトリックを推定し、量子状態、操作、およびチャネルを生成するメソッドが含まれています。
ko_kr: `양자 정보 <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ 더 진보된 알고리즘과 회로 분석을 양자 컴퓨터에서 하고 싶다면, 간단한 양자 정보 작업을 할 수 있는 도구들을 사용하는 것은 중요하다. 이는 메트릭(metrics)을 추정하고, 양자 상태, 연산 및 채널을 만드는 것을 포함한다.

source: `Visualization <https://qiskit.org/documentation/apidoc/visualization.html>`__ In Terra we have many tools to visualize a quantum circuit. This allows a quick inspection of the quantum circuit to make sure it is what the user wanted to implement. There is a text, python and latex version. Once the circuit has run it is important to be able to view the output. There is a simple function (`plot_histogram`) to plot the results from a quantum circuit including an interactive version. There is also a function `plot_state` and `plot_bloch_vector` that allow the plotting of a quantum state. These functions are usually only used when using the `statevector_simulator` backend but can also be used on real data after running state tomography experiments (Ignis).
de_de: `Visualisierung <https://qiskit.org/documentation/apidoc/visualization.html>`__ In Terra gibt es viele Werkzeuge, mit denen ein Quantenschaltkreis visualisiert werden kann. Dies ermöglicht eine schnelle Kontrolle des Quantenschaltkreises, um sicherzustellen, dass er den Anforderungen des Anwenders entspricht. Es gibt eine Text-, Python- und Latex-Version. Nachdem der Schaltkreis ausgeführt wurde, ist es wichtig, die Ausgabe sehen zu können. Die einfache Funktion (`plot_histogram`) stellt die Ergebnisse eines Quantenschaltkreises dar und beinhaltet auch eine interaktive Version. Außerdem gibt es die Funktionen `plot_state` und `plot_bloch_vector`, die die Darstellung eines Quantenzustands ermöglichen. Diese Funktionen werden normalerweise nur verwendet, wenn das `statevector_simulator` Backend benutzt wird. Sie können aber auch auf reale Daten nach der Durchführung von "state tomography" Experimenten (Ignis) angewendet werden.
ja_jp: `可視化 <https://qiskit.org/documentation/apidoc/visualization.html>`__ 。 Terraには量子回路を可視化する多くのツールがあります。ツールを使用することで、量子回路が実装したい形をしているかどうかを素早く確認できます。ツールにはテキスト版、Python 版、LaTeX版があります。 回路の実行後は、結果の表示が重要になります。量子回路から結果をプロットするシンプルな関数 (`plot_histogram`) があります。 これには対話バージョンもあります。また関数 `plot_state` と `plot_bloch_vector` は量子状態をプロットできます。 これらの関数は通常 `statevector_simulator` バックエンドの場合でのみ使用されますが、 状態トモグラフィー実験 (Ignis) 後の実際のデータでも使用できます。
ko_kr: `시각화 <https://qiskit.org/documentation/apidoc/visualization.html>`__ 테라에는 양자 회로를 시각화 하기 위한 많은 도구들이 있다. 이는 사용자들이 구현하고자 하는 것을 확인할 수 있도록 양자 회로를 빠르게 검사할 수 있게 해준다. 텍스트, 파이썬, 라텍스 버전이 존재한다. 회로가 한번 실행되어지면, 결과를 확인하는 것이 중요하다. 양자 회로의 결과를 그래프로 보여주는 간단한 함수 (`plot_historam`)가 있고, 실제로 상호 작용 버전도 있다. 양자 상태를 그려주는 `plot_state` 와 `plot_bloch_vector` 함수도 있다. 이런 함수들은 보통 `상태 벡터 시뮬레이터(statevector_simulator)` 후위 처리 장치와 함께 사용되나, (이그니스에 포함된) 상태 단층 촬영 실험(state tomography experiments) 결과로 나온 실제 데이터를 분석하는데도 사용될 수 있다.

source: Aer, the ‘air’ element, permeates all Qiskit elements. To really speed up development of quantum computers we need better simulators, emulators and debuggers. Aer helps us understand the limits of classical processors by demonstrating to what extent they can mimic quantum computation. Furthermore, we can use Aer to verify that current and near-future quantum computers function correctly. This can be done by stretching the limits of simulation, and by simulating the effects of realistic noise on the computation.
de_de: Aer, das Element "Luft", zieht sich durch alle Qiskit Elemente. Um die Entwicklung von Quantencomputern richtig zu beschleunigen, brauchen wir bessere Simulatoren, Emulatoren und Debugger. Aer hilft uns die Grenzen klassischer Prozessoren zu verstehen, indem es uns zeigt inwieweit diese Quantenberechnungen imitieren können. Des Weiteren können wir mit Aer verifizieren, dass derzeitige und künftige Quantencomputer korrekt funktionieren. Das erreichen wir durch die Auslotung der Grenzen einer Simulation und dem Simulieren der Auswirkungen von realistischem Quantenrauschen auf die Berechnungen.
ja_jp: 「Aer」要素(「空気」の意) は、あらゆる Qiskit 要素に横断的にはたらきかけます。量子コンピューターの開発スピードを本当に上げるには、より良いシミュレーター、より良いエミュレーター、より良いデバッガーが必要です。 「Aer」を使用することで古典プロセッサーのどの部分で量子コンピューティングを模倣できるかが分かり、 古典プロセッサーの限界を理解できます。 さらに「Aer」を使用して、現在そして近い将来の量子コンピューターの機能を正確に検証できます。 これはシミュレーションの限界を引き上げること、そして、 計算における現実のノイズの効果をシミュレーションすることで可能になります。

source: Aer provides a high performance simulator framework for quantum circuits using the Qiskit software stack. It contains optimized C++ simulator backends for executing circuits compiled in Terra. Aer also provides tools for constructing highly configurable noise models for performing realistic noisy simulations of the errors that occur during execution on real devices.
de_de: Aer bietet ein hochperformantes Simulations-Framework für Quantenschaltkreise auf Basis des Qiskit Software Stacks. Es enthält optimierte C++ Simulations-Backends, um in Terra kompilierte Schaltkreise auszuführen. Aer stellt außerdem Tools zur Erstellung fein konfigurierbarer Modelle von Quantenrauschen zur Verfügung, um realistische Quantenfehler zu simulieren, welche während der Ausführung auf echten Geräten auftreten.
ja_jp: Aer は、QisKitソフトウェア・スタックを利用した量子回路の高速シミュレーター・フレームワークです。Terraでコンパイルされた回路実行のために最適化された C++ シミュレーター・バックエンドが含まれます。Aerは実デバイス上で実行した場合に発生するエラーの現実的なノイズ・シミュレーションを行う、高度に構成可能なノイズ・モデル・ツールも提供しています。

source: Qiskit Aer includes three high performance simulator backends:
de_de: Qiskit Aer enthält drei hochperformante Simulator-Backends:
ja_jp: Qiskit Aerには3つの高パフォーマンス・シミュレーター・バックエンドがあります:

source: `Qasm Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.QasmSimulator.html>`__
ja_jp: `Qasm シミュレーター <https://qiskit.org/documentation/stubs/qiskit.providers.aer.QasmSimulator.html>`__

source: Allows ideal and noisy multi-shot execution of qiskit circuits and returns counts or memory. There are multiple methods that can be used that simulate different circuits more efficiently. These include:
ja_jp: Qiskitの回路を理想的またはノイズありの環境で複数回実行し、カウントまたはメモリーを返します。以下の通り、異なる回路をより効率的にシミュレートする複数のメソッドがあります:

source: *statevector* - Uses a dense statevector simulation.
de_de: *statevector* - Verwendet eine Zustandsvektor-Simulation.
ja_jp: *statevector* - 高密度状態ベクトルシミュレーションに使用されます。

source: *stabilizer* - Uses a Clifford stabilizer state simulator that is only valid for Clifford circuits and noise models.
de_de: *stabilizer* - Verwendet eine "Clifford stabilizer" Zustandssimulator welcher nur für Clifford-Schaltkreise und Rauschmodelle funktioniert.
ja_jp: *stabilizer* - Cliffordスタビライザー状態シミュレーターに使用されます。これは、Clifford回路とノイズ・モデルに対してのみ有効です。

source: *extended_stabilizer* - Uses an approximate simulator that decomposes circuits into stabilizer state terms, the number of which grows with the number of non-Clifford gates.
de_de: *extended_stabilizer* - Verwendet einen approximierenden Simulator, welcher den Schaltkreis in Stabilisator-Zustände zerlegt, welche mit der Anzahl an Nicht-Clifford Gattern anwachsen.
ja_jp: *extended_stabilizer* - 回路をスタビライザー状態に分解する近似シミュレーターに使用されます。その数は非Cliffordゲートの数とともに増加します。

source: *matrix_product_state* - Uses a Matrix Product State (MPS) simulator.
de_de: *matrix_product_state* - Verwendet einen "Matrix Product State" (MPS) Simulator.
ja_jp: *matrix_product_state* -行列積 (Matrix Product State、MPS) シミュレーターに使用されます。

source: `Statevector Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.StatevectorSimulator.html>`__
ja_jp: `状態ベクトル シミュレーター <https://qiskit.org/documentation/stubs/qiskit.providers.aer.StatevectorSimulator.html>`__

source: Allows ideal single-shot execution of qiskit circuits and returns the final statevector of the simulator after application.
de_de: Erlaubt die ideale, einfache Ausführung eines Qiskit Schaltkreises und gibt den finalen Zustandsvektor nach der Ausführung der Simulation zurück.
ja_jp: Qiskit回路の理想的な実行を一度し、適用後のシミュレーターの最終的な状態ベクトルを返します。

source: `Unitary Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.UnitarySimulator.html>`__
ja_jp: `ユニタリー シミュレーター <https://qiskit.org/documentation/stubs/qiskit.providers.aer.UnitarySimulator.html>`__

source: Allows ideal single-shot execution of qiskit circuits and returns the final unitary matrix of the circuit itself. Note that the circuit cannot contain measure or reset operations for this backend.
de_de: Erlaubt die ideale, einfache Ausführung eines Qiskit Schaltkreises und gibt die finale unitäre Matrix des Schaltkreises zurück. Hierbei darf der Schaltkreis keine Messung oder Reset Operation enthalten.
ja_jp: Qiskit回路の理想的な実行を一回行い、回路自身の最終ユニタリー行列を返します。このバックエンドにおいて、回路は測定やリセット操作を含められないことに注意してください。

source: Ignis, the ‘fire’ element, is dedicated to fighting noise and errors and to forging a new path. This includes better characterization of errors, improving gates, and computing in the presence of noise. Ignis is meant for those who want to design quantum error correction codes, or who wish to study ways to characterize errors through methods such as tomography, or even to find a better way for using gates by exploring dynamical decoupling and optimal control.
de_de: Ignis, das Element "Feuer", ist bestimmt Quanten-rauschen und -fehler zu bekämpfen und einen neuen Pfad zu schmieden. Das beinhaltet die bessere Charakterisierung von Fehlern, das Verbessern von Gattern und Berechnungen unter dem Einfluss von Quantenrauschen. Ignis ist für diejenigen gedacht, welche Codes zur Quantenfehlerkorrektur gestalten wollen, Möglichkeiten zur besseren Charakterisierung von Quantenfehlern entdecken (etwa durch Tomographie) oder sogar einen besseren Weg zur Verwendung von Gattern finden, indem sie dynamische Entkopplung und optimale Kontrolle erforschen.
ja_jp: 「Ignis」要素 (「火」の意) は、ノイズやエラーと戦い、新しい道を確立します。 「Ignis」には、より正確なエラー特定、ゲートの改良、ノイズ存在下での計算が含まれます。 量子エラー訂正コードの設計者や、断層撮影法などでのエラー特定方法を研究したい人、 あるいはダイナミカルデカップリングと最適制御の研究からゲートを使用したより良い方法を見つけたい人までをも対象とします。
ko_kr: 이그니스는 '불'을 나타내고, 잡음과 오류를 관리하고, 새로운 길을 모색하는데 특화된 패키지다. 여기에는 에러를 더욱 잘 특징 짓고, 게이트를 향상 시키며, 노이즈가 있을 때 계산을 하는 동작을 포함한다. 이그니스는 양자 오류 정정을 디자인 하려는 사람들이나 단층 촬영 같은 방법을 이용한 오류 특성 파악을 공부하고자 하는 사람들, 동적 비동기화나 최적화 조절 등을 이용하여서 게이트를 더욱 잘 이용하는 법을 찾으려는 사람들에게 유용하다.

source: Ignis provides code for users to easily generate circuits for specific experiments given a minimal set of user input parameters. Ignis code contains three fundamental building blocks:
de_de: Ignis stellt Code zur Verfügung, welcher es Nutzern erlaubt, auf einfache Weise Schaltkreise für spezifische Experimente mit einem minimalen Set an Eingabeparametern zu erstellen. Ignis enthält drei grundlegende Bausteine:
ja_jp: Ignisは、ユーザー入力パラメーターの最小セットが与えられた特定の実験について、簡単に回路を生成するコードをユーザーに提供します。Ignisのコードには、以下の3つの基本的な構成要素があります:
ko_kr: 이그니스는 사용자들이 최소한의 사용자 입력 매개변수를 가지고 특정 실험을 위한 회로를 쉽게 만들 수 있는 코드를 제공한다. 이그니스 코드는 세가지 핵심적인 구성 블록을 가진다.

source: **Circuits**
ja_jp: **回路**
ko_kr: **회로들(Circuits)**

source: The circuits module provides the code to generate the list of circuits for a particular Ignis experiment based on a minimal set of user parameters. These are then run on Terra or Aer.
de_de: Das "circuits" Modul stellt den Code zur Verfügung, um eine Liste von Schaltkreisen für ein bestimmtes Ignis-Experiment basierend auf einem minimalen Set an Eingabeparametern zu erstellen. Diese werden dann auf Terra oder Aer ausgeführt.
ja_jp: 回路モジュールは、最小セットのユーザー・パラメーターに基づいたあるIngis実験について、回路リストを生成するコードを提供します。これらはTerraやAerで実行されます。
ko_kr: 회로 모듈은 최소한의 사용자 매개 변수를 기반으로 하는 특정 이그니스 실험을 위한 회로의 목록을 만들어내는 코드를 제공한다. 이들은 이후 테라나 아르에서 실행된다.

source: **Fitters**
ja_jp: **フィッター**
ko_kr: **적합 기술자들(Fitters)**

source: The results of an Ignis experiment are passed to the Fitters module where they are analyzed and fit according to the physics model describing the experiment. Fitters can plot the data plus fit and output a list of parameters.
de_de: Das Ergebnis eines Ignis-Experiments wird dann an das Korrektur-Modul ("Fitters") weitergegeben, wo es analysiert und nach dem zugrunde liegenden physikalischen Modell angepasst wird. Fitters können die Daten plotten und korrigieren und eine Liste von Parametern ausgeben.
ja_jp: Ignis実験の結果はフィッター・モジュールに渡され、実験に記述された物理モデルにしたがって解析、フィットされます。フィッターはデータを描画することも、パラメータのリストを出力することもできます。
ko_kr: 이그니스 실험의 결과는 적합 기술자 모듈로 전달되는데, 여기서는 결과가 분석되고, 실험을 기술하는 물리 모델에 따라 적합하게 맞춘다. 적합 기술자는 자료를 적합하게 맞춘 결과와 함께 그려주고 매개 변수의 목록을 출력한다.

source: **Filters**
ja_jp: **フィルター**
ko_kr: **필터들(Filters)**
